
// Серверная процедура [ПриСозданииНаСервере] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура Справочник_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		
КонецПроцедуры

// Серверная процедура [ПриСозданииНаСервере] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура Обработка_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		
КонецПроцедуры

// Серверная процедура [ПриСозданииНаСервере] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура РегистрСведений_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Серверная процедура [ПриСозданииНаСервере] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ПланВидовХарактеристик_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Серверная процедура [ПослеСозданияНаСервере] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура Справочник_ПослеСозданияНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Серверная процедура [ПослеСозданияНаСервере] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура Обработка_ПослеСозданияНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Серверная процедура [ПослеСозданияНаСервере] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура РегистрСведений_ПослеСозданияНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Серверная процедура [ПослеСозданияНаСервере] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ПланВидовХарактеристик_ПослеСозданияНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

КонецПроцедуры