
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписи(пМассивСтруктур) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМассивСтруктур, "АукРасчетИтоговПеременные"); 
	
	Если Не сткРез.Успех Тогда	
		ВызватьИсключение сткРез.Ошибка;		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьДанныеДляЗаписи(пСткПараметры) Экспорт
	масРезультат = Новый Массив;
	
	Для Каждого сткДанныеПеременной Из пСткПараметры.ПеременныеФормулы Цикл
		Для Каждого сткЗначениеПеременной Из сткДанныеПеременной.Переменные Цикл	
			сткЗапись = Новый Структура;
			
			сткЗапись.Вставить("Аукцион",		пСткПараметры.Аукцион);
			сткЗапись.Вставить("НомерЭтапа",	пСткПараметры.НомерЭтапа);
			
			сткЗапись.Вставить("Участник",		сткДанныеПеременной.Участник);
			сткЗапись.Вставить("СтрокаДанных",	сткДанныеПеременной.СтрокаДанных);
			
			сткЗапись.Вставить("Переменная",			сткЗначениеПеременной.Переменная);
			сткЗапись.Вставить("ТипПеременной",			сткЗначениеПеременной.ТипПеременной);
			сткЗапись.Вставить("ЗначениеПеременной",	сткЗначениеПеременной.ЗначениеПеременной);
			
			сткЗапись.Вставить("Автор",			пСткПараметры.Автор);
			сткЗапись.Вставить("ДатаЗаписи",	пСткПараметры.ТекДата);
			
			масРезультат.Добавить(сткЗапись);	
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат масРезультат;
КонецФункции

Функция СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу(пАукцион, пНомерЭтапа, пНастройкаРасчета) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговПеременные.Участник КАК Участник,
	|	АукРасчетИтоговПеременные.СтрокаДанных КАК СтрокаДанных,
	|	АукРасчетИтоговПеременные.Переменная КАК Переменная,
	|	АукРасчетИтоговПеременные.ТипПеременной КАК ТипПеременной,
	|	АукРасчетИтоговПеременные.ЗначениеПеременной КАК ЗначениеПеременной
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговПеременные КАК АукРасчетИтоговПеременные
	|ГДЕ
	|	АукРасчетИтоговПеременные.Аукцион = &Аукцион
	|	И АукРасчетИтоговПеременные.НомерЭтапа = &НомерЭтапа
	|ИТОГИ ПО
	|	Участник,
	|	СтрокаДанных";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа",	пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе	
		тзРезультат = СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу_Таблица();
		
		СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу_ЗаполнитьДанныеРекурсивно(тзРезультат, РезультатЗапроса);
		
		Возврат тзРезультат;
	КонецЕсли;
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу_ЗаполнитьДанныеРекурсивно(пТзРезультат, пРезультатЗапроса)
	ВыборкаУчастник = пРезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУчастник.Следующий() Цикл
		
		ВыборкаСтрокаДанных = ВыборкаУчастник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСтрокаДанных.Следующий() Цикл
			
			ВыборкаДетальная = ВыборкаСтрокаДанных.Выбрать();
			
			Пока ВыборкаДетальная.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(пТзРезультат.Добавить(), ВыборкаДетальная);	
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры	

Функция СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу_Таблица()
	тзРезультат = Новый ТаблицаЗначений;
	
	тзРезультат.Колонки.Добавить("Участник",			Новый ОписаниеТипов("СправочникСсылка.АукУчастникиАукционов"));
	тзРезультат.Колонки.Добавить("СтрокаДанных",		Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("Переменная",			Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(256)));
	тзРезультат.Колонки.Добавить("ТипПеременной",		Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АукЭлементыДанныхАукционов"));
	тзРезультат.Колонки.Добавить("ЗначениеПеременной",	Метаданные.ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.Тип);
	
	Возврат тзРезультат;
КонецФункции	

#КонецОбласти