
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат АукОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "АукИсторияКомандАукционов");
	
КонецФункции

Функция ДобавитьЗаписи(пМасЗаписи) Экспорт	
	
	Возврат АукОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМасЗаписи, "АукИсторияКомандАукционов");
	
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат АукОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "АукИсторияКомандАукционов");
	
КонецФункции	

Функция ОбновитьЗапись(пСтруктураЗаписи) Экспорт
	
	сткРез =  АукОбщийСервер.ОбновитьЗаписьВРегистрСведений(пСтруктураЗаписи, "АукИсторияКомандАукционов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;	
	
КонецФункции	

Функция КомандыОжидающиеВыполненияВАвтоматическомРежиме() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = ДанныеКомандДляВыполнения_БазовыйФрагментЗапроса();
	
	стрОтборы =
	"	АукИсторияКомандАукционов.Автоматическая
	|	И АукИсторияКомандАукционов.Результат = ЗНАЧЕНИЕ(Перечисление.АукРезультатыВыполненияКоманд.ПустаяСсылка)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отборы", стрОтборы);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);  
	
КонецФункции

Функция ДанныеКомандПоКлючам(пМасКлючиКоманд) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = ДанныеКомандДляВыполнения_БазовыйФрагментЗапроса();
	
	стрОтборы =
	"	АукИсторияКомандАукционов.КлючКоманды В(&КлючиКоманд)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отборы", стрОтборы);
	
	Запрос.УстановитьПараметр("КлючиКоманд", пМасКлючиКоманд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ТипЗнч(пМасКлючиКоманд) = Тип("Массив") Тогда
		Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	Иначе
		Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);	
	КонецЕсли;	
	
КонецФункции

Процедура ЗафиксироватьРезультатВыполненияКомандыПоКлючу(пСткДанные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукИсторияКомандАукционов.Период КАК Период,
	|	АукИсторияКомандАукционов.КлючКоманды КАК КлючКоманды,
	|	&Результат КАК Результат,
	|	&Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|ГДЕ
	|	АукИсторияКомандАукционов.КлючКоманды = &КлючКоманды";
	
	Запрос.УстановитьПараметр("КлючКоманды",	пСткДанные.КлючКоманды);
	Запрос.УстановитьПараметр("Результат",		пСткДанные.Результат);
	Запрос.УстановитьПараметр("Комментарий",	пСткДанные.Комментарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	сткСтруктураЗаписи = ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса); 
		
	ОбновитьЗапись(сткСтруктураЗаписи);
	
КонецПроцедуры

Процедура ЗафиксироватьКомандуДляВыполнения_(пСтруктураЗаписи) Экспорт
	
	сткРез = ДобавитьЗапись(пСтруктураЗаписи);
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;
	
КонецПроцедуры

Функция БазовыеПараметрыДляСозданияКоманд() Экспорт

	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Период",			ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	сткРезультат.Вставить("КлючКоманды",	Справочники.КлючиУникальности.ПолучитьНовуюСсылку());
	
	сткРезультат.Вставить("КлючРодителя",	Неопределено);
	
	сткРезультат.Вставить("Аукцион");
	сткРезультат.Вставить("Автоматическая");
	
	сткРезультат.Вставить("Команда");
		
	Возврат сткРезультат;
	
КонецФункции	

Функция ДанныеДочернихКоманд(пМасКлючРодительскихКоманд) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = ДанныеКомандДляВыполнения_БазовыйФрагментЗапроса();
	
	стрОтборы =
	"	АукИсторияКомандАукционов.КлючРодителя В(&КлючиРодителей)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Отборы", стрОтборы);
	
	Запрос.УстановитьПараметр("КлючиРодителей", пМасКлючРодительскихКоманд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
		
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеКомандДляВыполнения_БазовыйФрагментЗапроса()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	АукИсторияКомандАукционов.Период КАК Период,
	|	АукИсторияКомандАукционов.КлючКоманды КАК КлючКоманды,
	|	АукИсторияКомандАукционов.Данные КАК Данные,
	|	АукИсторияКомандАукционов.Участник КАК Участник,
	|	АукИсторияКомандАукционов.КонтактноеЛицо КАК КонтактноеЛицо,
	|	АукИсторияКомандАукционов.Автоматическая КАК Автоматическая
	|ИЗ
	|	РегистрСведений.АукИсторияКомандАукционов КАК АукИсторияКомандАукционов
	|ГДЕ
	|	&Отборы";
	
	Возврат ТекстЗапроса;
	
КонецФункции	

#КонецОбласти


