
// Параметры:
//   Отбор - Отбор - произвольный отбор.
//   КлючЭлемента - Строка - имя элемента отбора.
//   ЗначениеЭлемента - Произвольный - значение элемента отбора.
// 
Процедура УстановитьЗначениеЭлементаОтбора(Отбор, КлючЭлемента, ЗначениеЭлемента) Экспорт

	ЭлементОтбора = Отбор.Найти(КлючЭлемента);
	Если ЭлементОтбора <> Неопределено Тогда
		ЭлементОтбора.Установить(ЗначениеЭлемента);
	КонецЕсли;

КонецПроцедуры

#Область РаботаСРегистрамиСведений

// Добавляет одну запись в регистр сведений по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура, по значениям которой необходимо создать набор записей и заполнить этот
//                                набор.
//  ИмяРегистра     - Строка - имя регистра сведений, в который необходимо добавить запись.
// 
Функция ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, Знач ИмяРегистра, Загрузка = Ложь) Экспорт

	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра);
	
	// Добавляем только одну запись в новый набор записей.
	НоваяЗапись = НаборЗаписей.Добавить();
	
	// Заполняем значения свойств записи из переданной структуры.
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);

	НаборЗаписей.ОбменДанными.Загрузка = Загрузка;
	
	// записываем набор записей
	Возврат ОбщегоНазначения.ЗаписатьОбъектВБазу(НаборЗаписей);

КонецФункции

Функция ДобавитьЗаписиВРегистрСведений(МассивСтруктур, Знач ИмяРегистра, Загрузка = Ложь) Экспорт
	
	МассивНаборов = Новый Массив;
	
	Для Каждого СткЗапись Из МассивСтруктур Цикл
		
		НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СткЗапись, ИмяРегистра);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СткЗапись);
		
		НаборЗаписей.ОбменДанными.Загрузка = Загрузка;
		
		МассивНаборов.Добавить(НаборЗаписей);
		
	КонецЦикла;	
	
	Возврат ОбщегоНазначения.ЗаписатьОбъектВБазу(МассивНаборов);
	
КонецФункции

// Обновляет запись в регистр сведений по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура, по значениям которой необходимо создать менеджер записи и обновить запись.
//  ИмяРегистра     - Строка - имя регистра сведений, в котором необходимо обновить запись.
// 
Функция ОбновитьЗаписьВРегистрСведений(СтруктураЗаписи, Знач ИмяРегистра) Экспорт

	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра]; // ОбъектМетаданныхРегистрСведений
	
	// Создаем менеджер записи регистра.
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	
	// Если регистр периодический добавим отбор по периоду
	Если МетаданныеРегистра.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда	
		МенеджерЗаписи.Период = СтруктураЗаписи.Период;	
	КонецЕсли;	
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл

		ИмяИзмерения = Измерение.Имя;
		
		// Если задано значение в структуре, то отбор устанавливаем.
		Если СтруктураЗаписи.Свойство(ИмяИзмерения) Тогда

			МенеджерЗаписи[ИмяИзмерения] = СтруктураЗаписи[ИмяИзмерения];

		КонецЕсли;

	КонецЦикла;
	
	// Считываем запись из базы данных.
	МенеджерЗаписи.Прочитать();
	
	// Заполняем значения свойств записи из переданной структуры.
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	
	// записываем менеджер записи
	Возврат ОбщегоНазначения.ЗаписатьОбъектВБазу(МенеджерЗаписи);

КонецФункции

// Удаляет набор записей в регистре по переданным значениям структуры.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура, по значениям которой необходимо удалить набор записей.
//  ИмяРегистра     - Строка - имя регистра сведений, в котором необходимо удалить набор записей.
// 
Функция УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, ИмяРегистра, Загрузка = Ложь) Экспорт

	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра);

	НаборЗаписей.ОбменДанными.Загрузка = Загрузка;
	
	// записываем набор записей
	Возврат ОбщегоНазначения.ЗаписатьОбъектВБазу(НаборЗаписей);

КонецФункции

// Создает набор записей регистра сведений по переданным значениям структуры. Добавляет одну запись в набор.
//
// Параметры:
//  СтруктураЗаписи - Структура - структура по значениям которой необходимо создать набор записей и заполнить этот
//                                набор.
//  ИмяРегистра     - Строка - имя регистра сведений.
//  
// Возвращаемое значение:
//   РегистрСведенийНаборЗаписей - набор записей регистра по указанному отбору.
// 
Функция СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра) Экспорт

	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрСведенийНаборЗаписей
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого КлючЗначение Из СтруктураЗаписи Цикл
		УстановитьЗначениеЭлементаОтбора(НаборЗаписей.Отбор, КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;

	Возврат НаборЗаписей;

КонецФункции

#КонецОбласти

#Область РаботаСФормулами

Функция ПроверитьФормулуРасчетаИСписокПеременных(пСткПараметры) Экспорт
	масОшибки = Новый Массив;
	
	// 1. Все переменные, входящие в формулу, вынесены в ТЧ Переменные и имеют значения 
	масПеременные = АукОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(пСткПараметры.Формула,
																	АукОбщийКлиентСервер.Шаблон_ОперандФормулыРасчетаИтоговБезСкобок(),,, Истина);
	
	масПеремБезЗначений = Новый Массив;																		
	Для Каждого ЭлПерем Из масПеременные Цикл
		Если пСткПараметры.Переменные.Найти(ЭлПерем) = Неопределено Тогда
			масПеремБезЗначений.Добавить(ЭлПерем);
		Иначе
			Если пСткПараметры.ЗначенияПеременных.Найти(ЭлПерем) = Неопределено Тогда
				масПеремБезЗначений.Добавить(ЭлПерем);	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(масПеремБезЗначений) Тогда
		масОшибки.Добавить(СтрШаблон(НСтр("ru = 'Не заданы значения для переменных: %1.'"), СтрСоединить(масПеремБезЗначений, "")));	
	КонецЕсли;
	
	// 2. Некорректные имена переменных
	масНекорректныеИмена = Новый Массив;																		
	Для Каждого ЭлПерем Из масПеременные Цикл
		Если Не АукОбщийВызовСервера.СтрокаПодобнаРегулярномуВыражению(ЭлПерем, АукОбщийКлиентСервер.Шаблон_КорректноеИмяОперанда()) Тогда
			масНекорректныеИмена.Добавить(ЭлПерем);	
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(масНекорректныеИмена) Тогда
		масОшибки.Добавить(СтрШаблон(НСтр("ru = 'Имена некорректны для переменных: %1.'"), СтрСоединить(масНекорректныеИмена, "")));	
	КонецЕсли;
	
	// 3. Дубли переменных
	масЭталонный = ОбщегоНазначенияКлиентСервер.СвернутьМассив(пСткПараметры.Переменные);
	
	Если пСткПараметры.Переменные.Количество() <> масЭталонный.Количество() Тогда
		масОшибки.Добавить(НСтр("ru = 'Есть дубли в таблице ""Переменные""'"));	
	КонецЕсли;	
		
	// 4. Проверить формулу на предмет посторонних компонентов
	ГотовоеВыражение = АукОбщийВызовСервера.СтрокаЗаменитьПоРегулярномуВыражению(пСткПараметры.Формула, АукОбщийКлиентСервер.Шаблон_ОперандФормулаРасчетаИтогов(), "1");
	
	Попытка	
		чслРезультат = ОбщегоНазначения.ВычислитьВБезопасномРежиме(ГотовоеВыражение);	
	Исключение	
		масОшибки.Добавить(СтрШаблон(НСтр("ru = 'Ошибка при вычислении выражения с тестовыми данными. Выражение: %1'"), ГотовоеВыражение));		
	КонецПопытки;
	
	Если масОшибки.Количество() = 0 Тогда
		Возврат ЭдоОбщий._Успех();	
	Иначе
		Возврат ЭдоОбщий._Ошибка(СтрСоединить(масОшибки, Символы.ПС));	
	КонецЕсли;	
КонецФункции	

Функция НормализоватьСтрокуФормулы(пСтрФормулаРасчета) Экспорт
	масЭлементыФормулы = АукОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(пСтрФормулаРасчета,
													АукОбщийКлиентСервер.Шаблон_ОперандыИАрифметическиеЗнакиВФормулеРасчетаИтогов());

	Возврат СтрСоединить(масЭлементыФормулы, " ");												
КонецФункции

#КонецОбласти

#Область РаботаСОбъектамиБД

Функция СоздатьКопиюСуществующегоЭлементаСправочника(пТекОбъект) Экспорт
	
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(пТекОбъект));
	
	Если МетаданныеОбъекта = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Метаданные не найдены. Копирование невозможно'");	
	Иначе	
		
		Возврат СоздатьКопиюОбъектаМетаданных(МетаданныеОбъекта, пТекОбъект);
		
	КонецЕсли;
	
КонецФункции	

// Ссылка объекта по УИД и типу
//
// Параметры:
//  пТип - 	 Тип 
//  пУИД - 	 Строка - УИД в формате "00000000-0000-0000-0000-000000000000" 
// 
// Возвращаемое значение:
//   Ссылка - может быть пустая 
//
Функция СсылкаОбъектаПоУИД(пТип, пУИД) Экспорт
	ИмяТаблицы = Метаданные.НайтиПоТипу(пТип).ПолноеИмя();
	
	Попытка
		СсылкаНаОбъект = XMLЗначение(пТип, пУИД);
	Исключение
		Возврат ПредопределенноеЗначение(ИмяТаблицы + ".ПустаяСсылка");	
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат СсылкаНаОбъект;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Таблица", ИмяТаблицы); 
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПредопределенноеЗначение(ИмяТаблицы + ".ПустаяСсылка");
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область РаботаСоСтатусамиАукционов

Процедура ЗафиксироватьИзменениеСтатусаАукциона_(пСсАукцион) Экспорт
	
	сткДанныеЭтапаАукциона = Справочники.АукАукционы.СведенияПоЭтапуАукциона(пСсАукцион, 1);
	
	Если Не ЗначениеЗаполнено(сткДанныеЭтапаАукциона.Этап) Тогда
		
		ВызватьИсключение НСтр("ru = 'Не заполнено наименование первого этапа.'");
		
	КонецЕсли;
	
	масУчастники = Справочники.АукАукционы.УчастникиАукциона(пСсАукцион);
	
	Если масУчастники.Количество() = 0 Тогда
		
		ВызватьИсключение НСтр("ru = 'Не заполнены участники'");
	
	КонецЕсли;
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Период",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	сткПараметры.Вставить("Аукцион",	пСсАукцион);
	сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап")); 
	сткПараметры.Вставить("Этап",		сткДанныеЭтапаАукциона.Этап);
	сткПараметры.Вставить("НомерЭтапа",	1);
	
	РегистрыСведений.АукИсторияСтатусовАукционов.ДобавитьЗапись(сткПараметры);	
	
КонецПроцедуры

Процедура ЗафиксироватьСтатусНовогоАукциона_(пСсАукцион) Экспорт
		
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Период",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	сткПараметры.Вставить("Аукцион",	пСсАукцион);
	сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Новый")); 
	
	РегистрыСведений.АукИсторияСтатусовАукционов.ДобавитьЗапись(сткПараметры);
	
КонецПроцедуры

Процедура ПеревестиНовыйАукционВРаботу_(пСсАукцион) Экспорт
	
	сткДанныеЭтапаАукциона = Справочники.АукАукционы.СведенияПоЭтапуАукциона(пСсАукцион, 1);
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Период",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	сткПараметры.Вставить("Аукцион",	пСсАукцион);
	сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап")); 
	сткПараметры.Вставить("Этап",		сткДанныеЭтапаАукциона.Этап);
	сткПараметры.Вставить("НомерЭтапа",	1);
	
	РегистрыСведений.АукИсторияСтатусовАукционов.ДобавитьЗапись(сткПараметры);
	
КонецПроцедуры

Процедура ПеревестиАукционНаНовыйЭтап_(пСсАукцион) Экспорт
	
	ТекСостояние = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСсАукцион);
	
	КолЭтапов = Справочники.АукАукционы.КоличествоЭтаповАукциона(пСсАукцион);
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Период",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	сткПараметры.Вставить("Аукцион",	пСсАукцион);
	
	Если ТекСостояние.НомерЭтапа < КолЭтапов Тогда
		Если ТекСостояние.Статус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап") Тогда	
			сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов"));
			сткПараметры.Вставить("Этап",		ТекСостояние.Этап);
			сткПараметры.Вставить("НомерЭтапа",	ТекСостояние.НомерЭтапа);
		Иначе
			сткДанныеЭтапаАукциона = Справочники.АукАукционы.СведенияПоЭтапуАукциона(пСсАукцион, ТекСостояние.НомерЭтапа + 1);
			
			сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап"));
			сткПараметры.Вставить("Этап",		сткДанныеЭтапаАукциона.Этап);
			сткПараметры.Вставить("НомерЭтапа",	ТекСостояние.НомерЭтапа + 1);	
		КонецЕсли;	
	Иначе
		сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеИтогов"));
		сткПараметры.Вставить("Этап",		ТекСостояние.Этап);
		сткПараметры.Вставить("НомерЭтапа",	ТекСостояние.НомерЭтапа);
	КонецЕсли;
	
	РегистрыСведений.АукИсторияСтатусовАукционов.ДобавитьЗапись(сткПараметры);

КонецПроцедуры

Процедура ПеревестиАукционНаНовыйЭтапБезИтогов_(пСсАукцион) Экспорт
	
	ТекСостояние = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСсАукцион);
	
	КолЭтапов = Справочники.АукАукционы.КоличествоЭтаповАукциона(пСсАукцион);
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Период",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	сткПараметры.Вставить("Аукцион",	пСсАукцион);
	
	Если ТекСостояние.НомерЭтапа < КолЭтапов Тогда
		сткДанныеЭтапаАукциона = Справочники.АукАукционы.СведенияПоЭтапуАукциона(пСсАукцион, ТекСостояние.НомерЭтапа + 1);
		
		сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап"));
		сткПараметры.Вставить("Этап",		сткДанныеЭтапаАукциона.Этап);
		сткПараметры.Вставить("НомерЭтапа",	ТекСостояние.НомерЭтапа + 1);	
	Иначе
		сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Завершен"));	
	КонецЕсли;
	
	РегистрыСведений.АукИсторияСтатусовАукционов.ДобавитьЗапись(сткПараметры);
		
КонецПроцедуры

Процедура ПеревестиАукционВЗавершенные_(пСсАукцион) Экспорт
		
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Период",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	сткПараметры.Вставить("Аукцион",	пСсАукцион);
	сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Завершен"));
	
	РегистрыСведений.АукИсторияСтатусовАукционов.ДобавитьЗапись(сткПараметры);
	
КонецПроцедуры

Процедура ПоместитьАукционВАрхив_(пСсАукцион) Экспорт
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Период",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	сткПараметры.Вставить("Аукцион",	пСсАукцион);
	сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Архив"));
	
	РегистрыСведений.АукИсторияСтатусовАукционов.ДобавитьЗапись(сткПараметры);
		
КонецПроцедуры

Процедура ОтменитьАукцион_(пСсАукцион) Экспорт
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("Период",		ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_());
	сткПараметры.Вставить("Аукцион",	пСсАукцион);
	сткПараметры.Вставить("Статус",		ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Отменен"));
	
	РегистрыСведений.АукИсторияСтатусовАукционов.ДобавитьЗапись(сткПараметры);
		
КонецПроцедуры

#КонецОбласти

#Область РаботаСИтогами

#Область СтарыйВариант

///////ПРОМЕЖУТОЧНЫЕ ИТОГИ
Функция ПромежуточныеИтогиРасчетПоУмолчанию(пАукцион, пВидАукциона = Неопределено, пМасСтруктураСтавки = Неопределено) Экспорт
	
	Если пВидАукциона = Неопределено Тогда
		пВидАукциона = Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион).ВидАукциона;
	КонецЕсли;
	
	тзТекДанныеСтавок = РегистрыСведений.АукИсторияДанныхАукционов.ТекущиеДанныеСтавокУчастниковАукционаВСтроке(пАукцион, пВидАукциона);
	
	тзТекДанныеСтавок.Колонки.Добавить("РезультатРасчета", Новый ОписаниеТипов("Число"));
	тзТекДанныеСтавок.Колонки.Добавить("ПредставлениеРезультатаРасчета", Новый ОписаниеТипов("Строка"));
	
	Если тзТекДанныеСтавок.Количество() > 0 Тогда 
		
		сткДанныеДляРасчета = Справочники.АукВидыАукционов.ОписаниеРасчетаПромежуточныхИтоговПоВидуАукциона(пВидАукциона);
		
		Если пМасСтруктураСтавки = Неопределено Тогда
			пМасСтруктураСтавки = Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона);
		КонецЕсли;
		
		Для Каждого СтрокаТз Из тзТекДанныеСтавок Цикл
			
			СтрокаТз.РезультатРасчета	= РасчитатьПромежуточныйИтогПоФормуле(сткДанныеДляРасчета.ПромежуточныйИтогФормула, пМасСтруктураСтавки, СтрокаТз);
			
			СтрокаТз.ПредставлениеРезультатаРасчета			= РасчитатьИтоговоеЗначениеПоШаблону(сткДанныеДляРасчета.ПромежуточныйИтогШаблонРезультата, пМасСтруктураСтавки, СтрокаТз);
			
		КонецЦикла;
		
		тзТекДанныеСтавок.Сортировать(СтрШаблон("РезультатРасчета %1", ?(сткДанныеДляРасчета.ПромежуточныйИтогВариантВыбора = 0, "ВОЗР", "УБЫВ")));
		
	КонецЕсли;
	
	Возврат тзТекДанныеСтавок;
	
КонецФункции

Процедура ПромежуточныйИтогДанныеЛидирующейСтавки(пАукцион) Экспорт	
	ВидАукциона = Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион).ВидАукциона;
	
	масСтруктураСтавки = Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(ВидАукциона);
	
	тзПромежуточныеИтогиТемп = ПромежуточныеИтогиРасчетПоУмолчанию(пАукцион, ВидАукциона, масСтруктураСтавки);
	
	Если тзПромежуточныеИтогиТемп.Количество() <> 0 Тогда
		сткДанныеДляЗаписи = АукОбщийКлиентСервер.ДанныеПобедителяЭтапаИзТаблицыРезультатовЭтапа(
							пАукцион, РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион).НомерЭтапа, тзПромежуточныеИтогиТемп[0]);
		
		АукОбщийВызовСервера.СохранитьДанныеПромежуточногоЛидераЭтапа(сткДанныеДляЗаписи);	
	КонецЕсли;
КонецПроцедуры

///////ОКОНЧАТЕЛЬНЫЕ ИТОГИ
Функция НачальныеУсловияАукциона(пАукцион) Экспорт
	
	сткРезультат = Новый Структура("ОбщаяСумма, ОбщийСрок");
	
	сткТекДанныеШапкиАукциона = РегистрыСведений.АукДанныеШапокПодведенияИтогов.ТекущиеДанныеШапкиПодведенияИтоговАукциона(пАукцион);
	
	Если сткТекДанныеШапкиАукциона <> Неопределено Тогда	
		ЗаполнитьЗначенияСвойств(сткРезультат, сткТекДанныеШапкиАукциона, "ОбщаяСумма,ОбщийСрок");	
	Иначе	
		сткВводныеДанныеАукциона		= Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион);
		
		сткРезультат.ОбщаяСумма			= сткВводныеДанныеАукциона.Сумма;
		сткРезультат.ОбщийСрок			= сткВводныеДанныеАукциона.Срок;	
	КонецЕсли;
	
	Возврат сткРезультат;
	
КонецФункции	

Процедура ОкончательныеИтоги_ДополнительныеПараметры(пСткПараметры) Экспорт

	пСткПараметры.Вставить("СтруктураСтавки",			Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(пСткПараметры.ВидАукциона));
	пСткПараметры.Вставить("СтруктураНачальныхДанных",	Справочники.АукВидыАукционов.ОписаниеСтруктурыНачальныхДанныхПоВидуАукциона(пСткПараметры.ВидАукциона));
	
	пСткПараметры.Вставить("Участники",					РегистрыСведений.АукИсторияДанныхАукционов.СведенияОбАктивностиУчастниковАукциона(пСткПараметры.Аукцион));
	
	пСткПараметры.Вставить("НачальныеДанные",			Справочники.АукАукционы.ЗначенияНачальныхДанных(пСткПараметры.Аукцион, пСткПараметры.ВидАукциона));
	пСткПараметры.Вставить("НачальныеУсловия",			АукОбщийСервер.НачальныеУсловияАукциона(пСткПараметры.Аукцион));
	
	пСткПараметры.Вставить("ДанныеСтавок",			РегистрыСведений.АукИсторияДанныхАукционов.ТекущиеДанныеСтавокУчастниковАукционаВСтроке(пСткПараметры.Аукцион,
																							пСткПараметры.ВидАукциона, "Участник,СтрокаДанных"));
																							
	пСткПараметры.Вставить("ТекущиеДанныеИтогов",	РегистрыСведений.АукДанныеТаблицПодведенияИтогов.ТекущиеДанныеТаблицПодведенияИтогов(пСткПараметры.Аукцион));																						
	
	Если пСткПараметры.СРаспределениемСуммы Тогда	
		пСткПараметры.Вставить("НастройкиРасчетаИтога", Справочники.АукВидыАукционов.ОписаниеРасчетаОкончательныхИтоговПоВидуАукциона(пСткПараметры.ВидАукциона));
		
		ОкончательныеИтоги_ДанныеСтавокУчастников_ПодготовкаПараметров_ДанныеДляРасчета(пСткПараметры);	
	КонецЕсли;
	
КонецПроцедуры

Функция ОкончательныеИтогиАукциона(пСткПараметры) Экспорт 

	тзИтогиТемп = ОкончательныеИтоги_ДанныеСтавокУчастников(пСткПараметры);
		
	Возврат АукОбщийКлиентСервер.ДанныеИтоговИзТаблицыИтогов(тзИтогиТемп);
		
КонецФункции

// Окончательные итоги данные ставок участников
//
// Параметры:
//  пСткПараметры
// 	 Обязательно
//		*Аукцион			- СправочникСсылка.АукАукционы
//		*ВидАукциона		- СправочникСсылка.АукВидыАукционов
//		*СтруктураСтавки	- Массив - Описание элементов ставки
//		*СтруктураНачальныхДанных - Массив - Описание элементов начальных данныъ
//		*Участники - Массив структур
//			**Участник - СправочникСсылка.АукУчастникиАукционов 
//			**СтатусУчастия - Число - 2 - Отказался, 1 - Не делал ставки, 0 - Делал ставки
//		*НачальныеДанные - Массив
//		*НачальныеУсловия - Структура
//			**ОбщаяСумма	- Число
//			**ОбщийСрок		- Число
//   Опционально:
//		*НастройкиРасчетаИтога - Структура
//			**Формула - Строка
//			**РаспределяемаяСуммаОсновная - Строка
//			**РаспределяемаяСуммаДополнительная - Строка
//		*ОперандыВТехНаименования - Соответствие
//			**Ключ - Строка - в формате "[" + Наименование + "]"
//			**Значение - Строка - Техническое наименование
// 
// Возвращаемое значение:
//   Таблица значений 
//
Функция ОкончательныеИтоги_ДанныеСтавокУчастников(пСткПараметры) Экспорт
	
	тзИтогиТемп = ОкончательныеИтоги_ДанныеСтавокУчастников_ТемпТаблица(пСткПараметры);
	
	Для Каждого ЭлМас Из пСткПараметры.Участники Цикл
		
		Если ЭлМас.СтатусУчастия = 0 Тогда	
			масСтрокиТзДанныеСтавки = пСткПараметры.ДанныеСтавок.НайтиСтроки(Новый Структура("Участник", ЭлМас.Участник));
			
			Для Каждого СтрокаТзТекДанныеСтавки Из масСтрокиТзДанныеСтавки Цикл
				НовСтрока = тзИтогиТемп.Добавить();
		
				НовСтрока.Участник		= ЭлМас.Участник;
				НовСтрока.СтатусУчастия = ЭлМас.СтатусУчастия;
				
				// Строка данных
				НовСтрока.СтрокаДанных	= СтрокаТзТекДанныеСтавки.СтрокаДанных;
				
				// Элементы ставки
				Для Каждого ЭлементСтавки Из пСткПараметры.СтруктураСтавки Цикл
					НовСтрока[ЭлементСтавки.ТехническоеНаименование] = СтрокаТзТекДанныеСтавки[ЭлементСтавки.ТехническоеНаименование];	
				КонецЦикла;	
				
				Если пСткПараметры.СРаспределениемСуммы Тогда		
					Если пСткПараметры.ТекущиеДанныеИтогов <> Неопределено Тогда	
						ОкончательныеИтоги_ДанныеСтавокУчастников_ЗаполнитьТекущиеИтоги(НовСтрока, пСткПараметры.ТекущиеДанныеИтогов);			
					Иначе	
						ОкончательныеИтоги_ДанныеСтавокУчастников_РаспределяемаяСумма(НовСтрока, пСткПараметры);
					КонецЕсли; 
					
					ОкончательныеИтоги_ДанныеСтавокУчастников_РасчетнаяСуммаПоФормуле(НовСтрока, пСткПараметры);
					
				Иначе		
					Если пСткПараметры.ТекущиеДанныеИтогов <> Неопределено Тогда	
						ОкончательныеИтоги_ДанныеСтавокУчастников_ЗаполнитьТекущиеИтоги(НовСтрока, пСткПараметры.ТекущиеДанныеИтогов);	
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЦикла;
			
		Иначе
			НовСтрока = тзИтогиТемп.Добавить();
		
			НовСтрока.Участник		= ЭлМас.Участник;
			НовСтрока.СтатусУчастия = ЭлМас.СтатусУчастия;
		
			Если пСткПараметры.ТекущиеДанныеИтогов <> Неопределено Тогда	
				ОкончательныеИтоги_ДанныеСтавокУчастников_ЗаполнитьТекущиеИтоги(НовСтрока, пСткПараметры.ТекущиеДанныеИтогов);		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	тзИтогиТемп.Сортировать("РасчетнаяСумма Убыв");
	
	// Предварительное распределение. Только для случая, когда в РС АукДанныеТаблицПодведенияИтогов
	// нет записей по текущему аукциону (т.е. пСткПараметры.ТекущиеДанныеИтогов = Неопределено)
	// Если записи есть (т.е. пСткПараметры.ТекущиеДанныеИтогов <> Неопределено),
	// то принимаем, что пользователь ранее уже произвел нужные вычисления. Менять в этом случае не нужно
	Если пСткПараметры.ТекущиеДанныеИтогов = Неопределено Тогда	
		ОкончательныеИтоги_РаспределитьСуммыАвтоматически(тзИтогиТемп, пСткПараметры);		
	КонецЕсли; 
	
	Возврат тзИтогиТемп;
	
КонецФункции

Процедура ОкончательныеИтоги_РаспределитьСуммыАвтоматически(пТзИтогиТемп, пСткПараметры)
	чслОбщаяСумма = пСткПараметры.НачальныеУсловия.ОбщаяСумма;	
	
	чслЛокальныйИтог = 0;
	Для Каждого СтрокаТз Из пТзИтогиТемп Цикл
		
		Если СтрокаТз.СтатусУчастия <> 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		Если СтрокаТз.РасчетнаяСумма = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		Если (чслЛокальныйИтог + СтрокаТз.РаспределяемаяСумма) > чслОбщаяСумма Тогда
			Продолжить;	
		Иначе	
			чслЛокальныйИтог = чслЛокальныйИтог + СтрокаТз.РаспределяемаяСумма;	
			
			СтрокаТз.ПобедительФактический		= Истина;
			СтрокаТз.ПобедительПредполагаемый	= Истина;
		КонецЕсли;	
					
	КонецЦикла;
КонецПроцедуры

Процедура ОкончательныеИтоги_ДанныеСтавокУчастников_РаспределяемаяСумма(пНоваяСтрока, пСткПараметры)
	чслРаспределяемаяСуммаВычисленная = 0;
	
	// 1. Считаем по основной
	Если ЗначениеЗаполнено(пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаОсновная) Тогда	
		ЧислоСтрокой = пНоваяСтрока[пСткПараметры.ОперандыВТехНаименования[пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаОсновная]];
		
		стрВыражение = АукОбщийКлиентСервер.ПреобразоватьЧислоКСтрокеДляВычисления(ЧислоСтрокой);
		
		Попытка
			чслРаспределяемаяСуммаВычисленная = ОбщегоНазначения.ВычислитьВБезопасномРежиме(стрВыражение);
		Исключение
			чслРаспределяемаяСуммаВычисленная = 0;	
		КонецПопытки;
	КонецЕсли;	
	
	// 2. Считаем по дополнительной
	Если чслРаспределяемаяСуммаВычисленная = 0 И ЗначениеЗаполнено(пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаДополнительная) Тогда	
		масСтрокиТз_ = пСткПараметры.НачальныеДанные.НайтиСтроки(Новый Структура("Участник", пНоваяСтрока.Участник));
		
		Если масСтрокиТз_.Количество() <> 0 Тогда
			ИмяКолонки = пСткПараметры.ОперандыВТехНаименования[пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаДополнительная]; 
			
			чслРаспределяемаяСуммаВычисленная = масСтрокиТз_[0][ИмяКолонки];	
		КонецЕсли;	
	КонецЕсли;
	
	пНоваяСтрока.РаспределяемаяСумма = чслРаспределяемаяСуммаВычисленная;
КонецПроцедуры

Процедура ОкончательныеИтоги_ДанныеСтавокУчастников_РасчетнаяСуммаПоФормуле(пНоваяСтрока, пСткПараметры)
	
	ИтоговоеВыражение = пСткПараметры.НастройкиРасчетаИтога.Формула;
	
	Для Каждого ЭлСоо Из пСткПараметры.ОперандыВТехНаименования Цикл
		
		Если СтрНайти(ИтоговоеВыражение, ЭлСоо.Ключ) <> 0 Тогда 
			
			ИтоговоеВыражение = СтрЗаменить(ИтоговоеВыражение, ЭлСоо.Ключ, АукОбщийКлиентСервер.ПреобразоватьЧислоКСтрокеДляВычисления(пНоваяСтрока[ЭлСоо.Значение]));  
			
			ИтоговоеВыражение = СтрЗаменить(ИтоговоеВыражение,
											ЭлСоо.Ключ,
											АукОбщийКлиентСервер.ПреобразоватьЧислоКСтрокеДляВычисления(пНоваяСтрока[ЭлСоо.Значение]));
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИтоговоеВыражение_ = АукОбщийКлиентСервер.ЗаменитьРаспределяемуюСуммуВФормуле(ИтоговоеВыражение, пНоваяСтрока.РаспределяемаяСумма);
	
	пНоваяСтрока.ФормулаРасчетнойСуммы = ИтоговоеВыражение;
	
	Попытка
		пНоваяСтрока.РасчетнаяСумма = Вычислить(ИтоговоеВыражение_);
	Исключение
		пНоваяСтрока.РасчетнаяСумма = 0;
	КонецПопытки;
	
КонецПроцедуры	

Процедура ОкончательныеИтоги_ДанныеСтавокУчастников_ЗаполнитьТекущиеИтоги(пНовСтрока, пТзТекущиеДанныеИтогов)
	
	масСтрокиТз = пТзТекущиеДанныеИтогов.НайтиСтроки(Новый Структура("Участник, СтрокаДанных", пНовСтрока.Участник, пНовСтрока.СтрокаДанных));
	
	Если масСтрокиТз.Количество() <> 0 Тогда	
		пНовСтрока.РаспределяемаяСумма		= масСтрокиТз[0].РаспределяемаяСумма;
		пНовСтрока.ПобедительФактический	= масСтрокиТз[0].ЭтоПобедитель;
		пНовСтрока.ПобедительПредполагаемый	= пНовСтрока.ПобедительФактический;	
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОкончательныеИтоги_ДанныеСтавокУчастников_ПодготовкаПараметров_ДанныеДляРасчета(пСткПараметры)
	
	масОперанды = ОкончательныеИтоги_ДанныеСтавокУчастников_ПодготовкаПараметров_ДанныеДляРасчета_Операнды(пСткПараметры);
	
	сооЭлСтавки = ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.СоответствиеОперандовТехническимНаименованиям(масОперанды);
	
	пСткПараметры.Вставить("ОперандыВТехНаименования", сооЭлСтавки);
	
	Если Не ЗначениеЗаполнено(пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаОсновная)
		И ЗначениеЗаполнено(пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаДополнительная)
	Тогда
		
		пСткПараметры.НачальныеДанные.Сортировать(пСткПараметры.ОперандыВТехНаименования[пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаДополнительная] + " УБЫВ");	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОкончательныеИтоги_ДанныеСтавокУчастников_ПодготовкаПараметров_ДанныеДляРасчета_Операнды(пСткПараметры) 
	
	масНаименованияЭлементов = Новый Массив;
	
	Если ЗначениеЗаполнено(пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаОсновная) Тогда	
		масНаименованияЭлементов.Добавить(пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаОсновная);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаДополнительная) Тогда		
		масНаименованияЭлементов.Добавить(пСткПараметры.НастройкиРасчетаИтога.РаспределяемаяСуммаДополнительная);
	КонецЕсли;
	
	масВхождения = ОперандыВФормуле(пСткПараметры);
		
	Для Каждого ЭлВхождение Из масВхождения Цикл		
		масНаименованияЭлементов.Добавить(ЭлВхождение.Значение);		
	КонецЦикла;
	
	Возврат масНаименованияЭлементов;
	
КонецФункции

Функция ОперандыВФормуле(Знач пСткПараметры)

	сооЗамена = ЗначенияПредопределенныхОперандов(пСткПараметры.Аукцион);								
	
	Для Каждого ЭлСооЗамена Из сооЗамена Цикл	
		пСткПараметры.НастройкиРасчетаИтога.Формула = СтрЗаменить(пСткПараметры.НастройкиРасчетаИтога.Формула, ЭлСооЗамена.Ключ, ЭлСооЗамена.Значение);	
	КонецЦикла;
	
	Возврат СтрНайтиВсеПоРегулярномуВыражению(пСткПараметры.НастройкиРасчетаИтога.Формула, АукОбщийКлиентСервер.Шаблон_ОперандФормулаРасчетаИтогов());
	
КонецФункции

Функция ЗначенияПредопределенныхОперандов(пАукцион)

	сооРезультат = Новый Соответствие;
	
	сооРезультат.Вставить("[Дней в году]",	АукОбщийКлиентСервер.ПреобразоватьЧислоКСтрокеДляВычисления(АукОбщийКлиентСервер.ДнейВГоду()));
	сооРезультат.Вставить("[Срок]",			АукОбщийКлиентСервер.ПреобразоватьЧислоКСтрокеДляВычисления(Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион).Срок));
	
	Возврат сооРезультат;
	
КонецФункции

Функция ОкончательныеИтоги_ДанныеСтавокУчастников_ТемпТаблица(пСткПараметры)

	тзИтогиТемп = Новый ТаблицаЗначений;
	
	тзИтогиТемп.Колонки.Добавить("Участник",				Новый ОписаниеТипов("СправочникСсылка.АукУчастникиАукционов"));
	тзИтогиТемп.Колонки.Добавить("СтрокаДанных",			Новый ОписаниеТипов("Число"));
	тзИтогиТемп.Колонки.Добавить("СтатусУчастия",			Новый ОписаниеТипов("Число"));
	тзИтогиТемп.Колонки.Добавить("ПобедительФактический",	Новый ОписаниеТипов("Булево"));
	тзИтогиТемп.Колонки.Добавить("ПобедительПредполагаемый",	Новый ОписаниеТипов("Булево"));
	тзИтогиТемп.Колонки.Добавить("РаспределяемаяСумма",		Новый ОписаниеТипов("Число"));
	тзИтогиТемп.Колонки.Добавить("РасчетнаяСумма",			Новый ОписаниеТипов("Число"));
	тзИтогиТемп.Колонки.Добавить("ФормулаРасчетнойСуммы",	Новый ОписаниеТипов("Строка"));
	
	Для Каждого КолонкаИмя Из пСткПараметры.СтруктураСтавки Цикл	
		тзИтогиТемп.Колонки.Добавить(КолонкаИмя.ТехническоеНаименование, КолонкаИмя.ТипЗначения);		
	КонецЦикла;
	
	Возврат тзИтогиТемп; 
	
КонецФункции

#КонецОбласти

#Область НовыйВариант

Процедура ОкончательныеИтоги_ДополнительныеПараметры_(пСткДанные) Экспорт	
	пСткДанные.Вставить("СтруктураСтавки",			Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(пСткДанные.ВидАукциона));
	пСткДанные.Вставить("СтруктураНачальныхДанных",	Справочники.АукВидыАукционов.ОписаниеСтруктурыНачальныхДанныхПоВидуАукциона(пСткДанные.ВидАукциона));
	
	пСткДанные.Вставить("Участники",				РегистрыСведений.АукИсторияДанныхАукционов.СведенияОбАктивностиУчастниковАукциона(пСткДанные.Аукцион));
	
	пСткДанные.Вставить("НачальныеДанные",			Справочники.АукАукционы.ЗначенияНачальныхДанных(пСткДанные.Аукцион, пСткДанные.ВидАукциона));
	
	пСткДанные.Вставить("ДанныеСтавок",				РегистрыСведений.АукИсторияДанныхАукционов.ТекущиеДанныеСтавокУчастниковАукционаВСтроке(пСткДанные.Аукцион,
															пСткДанные.ВидАукциона, "Участник,СтрокаДанных"));
	
	пСткДанные.Вставить("ПараметрыАукциона",		Справочники.АукАукционы.ПараметрыАукциона(пСткДанные.Аукцион));		
	
	сткСвойстваВидаАукциона = Справочники.АукВидыАукционов.КлючевыеДанныеВидаАукциона(пСткДанные.ВидАукциона);
	
	Если пСткДанные.ЭтоПромежуточныеИтоги Тогда
		пСткДанные.Вставить("НастройкаРасчетаИтогов",		
			Справочники.АукНастройкиРасчетовИтогов.ДанныеНастройкиРасчетаИтоговАукциона(сткСвойстваВидаАукциона.НастройкаРасчетаПромежуточныхИтогов)); 
	Иначе	
		пСткДанные.Вставить("НастройкаРасчетаИтогов",
			Справочники.АукНастройкиРасчетовИтогов.ДанныеНастройкиРасчетаИтоговАукциона(сткСвойстваВидаАукциона.НастройкаРасчетаОкончательныхИтогов));
	КонецЕсли;
	
	пСткДанные.Вставить("ТекущиеДанныеРасчетаИтогов",	ТекущиеДанныеРасчетаИтогов(пСткДанные));
КонецПроцедуры

Функция ТекущиеДанныеРасчетаИтогов(пСткДанные)
    сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("ПеременныеФормулы",		РегистрыСведений.АукРасчетИтоговПеременные.СохраненныеЗначенияПеременныхРасчетаИтоговАукционаПоЭтапу(
								пСткДанные.Аукцион, пСткДанные.НомерЭтапа, пСткДанные.НастройкаРасчетаИтогов.НастройкаРасчетаИтогов));
	сткРезультат.Вставить("РезультатыАукциона",		РегистрыСведений.АукРасчетИтоговРезультаты.СохраненныеДанныеРезультатовРасчетаИтоговАукционаПоЭтапу(
								пСткДанные.Аукцион, пСткДанные.НомерЭтапа));
								
	сткРезультат.Вставить("ТребуетсяРасчет",		сткРезультат.ПеременныеФормулы = Неопределено И сткРезультат.РезультатыАукциона = Неопределено);							
	
	Возврат сткРезультат;
КонецФункции

Процедура РассчитатьИЗафиксироватьДанныеИтоговАукционов(пСткДанные) Экспорт	
	сткРез = ОкончательныеИтоги_ДанныеСтавокУчастников_(пСткДанные);
	
	Если сткРез.тзИтогиАукциона.Количество() <> 0 Тогда
		сткРез.Вставить("Аукцион",		пСткДанные.Аукцион);
		сткРез.Вставить("НомерЭтапа",	пСткДанные.НомерЭтапа);
		сткРез.Вставить("Переменные",	ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(пСткДанные.НастройкаРасчетаИтогов.Переменные, "Переменная"));
		
		сткДанныеДляЗаписи = АукОбщийКлиентСервер.ДанныеПобедителейИзТаблицРезультатов(сткРез);
		
		АукОбщийВызовСервера.СохранитьДанныеПобедителейЭтапов(сткДанныеДляЗаписи);	
	КонецЕсли;
КонецПроцедуры

Функция ОкончательныеИтоги_ДанныеСтавокУчастников_(пСткДанные) Экспорт	
	тзИтогиТемп = ОкончательныеИтоги_ДанныеСтавокУчастников_ТемпТаблица_(пСткДанные);
	
	тзПараметрыАукционаТемп = ОкончательныеИтоги_ПараметрыАукциона_ТемпТаблица_(пСткДанные);
	
	Для Каждого ЭлМас Из пСткДанные.Участники Цикл
		
		Если ЭлМас.СтатусУчастия = 0 Тогда	
			масСтрокиТзДанныеСтавки = пСткДанные.ДанныеСтавок.НайтиСтроки(Новый Структура("Участник", ЭлМас.Участник));
			
			Для Каждого СтрокаТзТекДанныеСтавки Из масСтрокиТзДанныеСтавки Цикл
				НовСтрока = тзИтогиТемп.Добавить();
		
				НовСтрока.Участник		= ЭлМас.Участник;
				НовСтрока.СтатусУчастия = ЭлМас.СтатусУчастия;
				
				// Строка данных
				НовСтрока.СтрокаДанных	= СтрокаТзТекДанныеСтавки.СтрокаДанных;
				
				// Элементы ставки
				Для Каждого ЭлементСтавки Из пСткДанные.СтруктураСтавки Цикл
					НовСтрока[ЭлементСтавки.ТехническоеНаименование] = СтрокаТзТекДанныеСтавки[ЭлементСтавки.ТехническоеНаименование];	
				КонецЦикла;
				
				// Формула
				НовСтрока.ФормулаРасчетаРезультата = пСткДанные.НастройкаРасчетаИтогов.Формула;
				
				
				Если пСткДанные.ТекущиеДанныеРасчетаИтогов.ТребуетсяРасчет Тогда 
					Итоги_ЗаполнитьЗначенияПеременныхПоНастройкам(НовСтрока, пСткДанные); // Значения переменных
					
					Итоги_РасчетИтогаПоСтроке(НовСтрока, пСткДанные.НастройкаРасчетаИтогов); // Результат
				Иначе
					Итоги_ЗаполнитьЗначенияПеременныхПоСохраненнымДанным(НовСтрока, пСткДанные.ТекущиеДанныеРасчетаИтогов.ПеременныеФормулы); // Значения переменных
					
					Итоги_ЗаполнитьИтогиПоСохраненнымДанным(НовСтрока, пСткДанные.ТекущиеДанныеРасчетаИтогов.РезультатыАукциона); // Результат
				КонецЕсли;		
			КонецЦикла;
			
		Иначе
			НовСтрока = тзИтогиТемп.Добавить();
		
			НовСтрока.Участник		= ЭлМас.Участник;
			НовСтрока.СтатусУчастия = ЭлМас.СтатусУчастия;
		
			Если пСткДанные.ТекущиеДанныеРасчетаИтогов.ТребуетсяРасчет Тогда
				Итоги_ЗаполнитьЗначенияПеременныхПоНастройкам(НовСтрока, пСткДанные);
				
				Итоги_РасчетИтогаПоСтроке(НовСтрока, пСткДанные.НастройкаРасчетаИтогов);
			Иначе
				Итоги_ЗаполнитьЗначенияПеременныхПоСохраненнымДанным(НовСтрока, пСткДанные.ТекущиеДанныеРасчетаИтогов.ПеременныеФормулы);
				
				Итоги_ЗаполнитьИтогиПоСохраненнымДанным(НовСтрока, пСткДанные.ТекущиеДанныеРасчетаИтогов.РезультатыАукциона);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Итоги_ОтсортироватьТаблицуСогласноНастройкам(тзИтогиТемп, пСткДанные.НастройкаРасчетаИтогов);
	
	Итоги_ОпределитьПобедителейАвтоматически(тзИтогиТемп, тзПараметрыАукционаТемп, пСткДанные);
	
	Возврат Новый Структура("тзИтогиАукциона, тзПараметрыАукциона", тзИтогиТемп, тзПараметрыАукционаТемп);	
КонецФункции

// Распределение только в случае если отсутствуют записи в АукРасчетИтоговПеременные, АукРасчетИтоговРезультаты
// то есть ранее расчеты не производились. Если записи есть, то расчеты производились, значит менять ничего не нужно
//
Процедура Итоги_ОпределитьПобедителейАвтоматически(пТзИтогиТемп, пТзПараметрыАукционаТемп, пСткДанные)
	Если пСткДанные.ТекущиеДанныеРасчетаИтогов.ТребуетсяРасчет Тогда	
		
		Если пСткДанные.ЭтоПромежуточныеИтоги Тогда
			Итоги_ОпределитьПобедителейАвтоматически_ПромежуточныеИтоги(пТзИтогиТемп);	
		Иначе
			Итоги_ОпределитьПобедителейАвтоматически_ОкончательныеИтоги(пТзИтогиТемп, пТзПараметрыАукционаТемп, пСткДанные);	
		КонецЕсли;
	Иначе	
		Если Не пСткДанные.ЭтоПромежуточныеИтоги Тогда
			// Обновить остатки по параметрам
			Итоги_ОбновитьОстаткиПараметров(пТзИтогиТемп, пТзПараметрыАукционаТемп, пСткДанные);	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура Итоги_ОбновитьОстаткиПараметров(пТзИтогиТемп, пТзПараметрыАукционаТемп, пСткДанные) 
	Для Каждого СтрокаТзПараметр Из пТзПараметрыАукционаТемп Цикл		
		СтрокаТзПараметр.Остаток = СтрокаТзПараметр.ТекущееЗначение - ИтогПоПараметруСписываемомуПоПеременной(СтрокаТзПараметр.Параметр, пТзИтогиТемп, пСткДанные); 
	КонецЦикла;	
КонецПроцедуры 

Функция ИтогПоПараметруСписываемомуПоПеременной(пПараметр, пТзИтогиТемп, пСткДанные)
	чслИтогТемп = 0;
	
	масСтрокиПеременные = пСткДанные.НастройкаРасчетаИтогов.НастройкаСписания.НайтиСтроки(Новый Структура("Параметр", пПараметр));
	
	Если масСтрокиПеременные.Количество() <> 0 Тогда
		Для Каждого СтрокаТзПеременные Из масСтрокиПеременные Цикл
			чслИтогТемп = чслИтогТемп + ИтогиАукционаИтогПоКолонкеПоПризнакуОтбора(СтрокаТзПеременные.СписыватьПоПеременной, пТзИтогиТемп);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат чслИтогТемп;
КонецФункции

Функция ИтогиАукционаИтогПоКолонкеПоПризнакуОтбора(пИмяКолонки, пТзИтогиТемп)	
	чслРез = 0;
	
	Для Каждого СтрокаТз Из пТзИтогиТемп Цикл
		Если СтрокаТз.УчастникВыбран Тогда
			чслРез = чслРез + СтрокаТз[пИмяКолонки];
		КонецЕсли;
	КонецЦикла;
	
	Возврат чслРез;
КонецФункции

Процедура Итоги_ОпределитьПобедителейАвтоматически_ОкончательныеИтоги(пТзИтогиТемп, пТзПараметрыАукционаТемп, пСткДанные)
    тзНастройкаСписания = Итоги_ПодготовитьТаблицуНастроекСписания(пСткДанные.НастройкаРасчетаИтогов.НастройкаСписания);
	
	булВыполнитьРасчет = Истина;
	
	Пока булВыполнитьРасчет Цикл
		Итоги_ОпределитьПобедителейАвтоматически_ОкончательныеИтоги_ВыполнитьРасчет(
							булВыполнитьРасчет, пТзИтогиТемп, пТзПараметрыАукционаТемп, пСткДанные, тзНастройкаСписания);	
	КонецЦикла;
КонецПроцедуры

Функция Итоги_ПодготовитьТаблицуНастроекСписания(пТзНастройкаСписания)
	тзНастр = пТзНастройкаСписания.СкопироватьКолонки("Параметр");
	
	тзНастр.Колонки.Добавить("ВсеПеременные", Новый ОписаниеТипов("Массив")); 
	тзНастр.Колонки.Добавить("ПеременныеБезЧастничногоСписания", Новый ОписаниеТипов("Массив"));
	тзНастр.Колонки.Добавить("ПеременныеСЧастничнымСписанием", Новый ОписаниеТипов("Массив"));
	тзНастр.Колонки.Добавить("ЕстьЧастичноеСписание", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаТз Из пТзНастройкаСписания Цикл
		масНайденныеСтроки = тзНастр.НайтиСтроки(Новый Структура("Параметр", СтрокаТз.Параметр));
		
		Если масНайденныеСтроки.Количество() <> 0 Тогда
			СтрокаТаб = масНайденныеСтроки[0];	
		Иначе
			СтрокаТаб = тзНастр.Добавить();
			СтрокаТаб.Параметр = СтрокаТз.Параметр;
		КонецЕсли;	
		
		СтрокаТаб.ВсеПеременные.Добавить(СтрокаТз.СписыватьПоПеременной);
		
		Если СтрокаТз.МожноСписыватьЧастично Тогда
			СтрокаТаб.ПеременныеСЧастничнымСписанием.Добавить(СтрокаТз.СписыватьПоПеременной);
			
			СтрокаТаб.ЕстьЧастичноеСписание = Истина;
		Иначе
			СтрокаТаб.ПеременныеБезЧастничногоСписания.Добавить(СтрокаТз.СписыватьПоПеременной);	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат тзНастр;
КонецФункции	

Процедура Итоги_ОпределитьПобедителейАвтоматически_ОкончательныеИтоги_ВыполнитьРасчет(
							пБулВыполнитьРасчет, пТзИтогиТемп, пТзПараметрыАукционаТемп, пСткДанные, пТзНастройкаСписания)	
	булВыполненоЧастичноеСписание = Ложь;
	
	Для Каждого СтрокаТзИтоги Из пТзИтогиТемп Цикл
		Если СтрокаТзИтоги.СтатусУчастия <> 0
			 Или СтрокаТзИтоги.УчастникВыбран
			 Или пТзИтогиТемп.НайтиСтроки(Новый Структура("Участник, УчастникВыбран", СтрокаТзИтоги.Участник, Истина)).Количество() <> 0
		Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Не РасчетИтога_ЕстьДоступныйОстатокДляСписания(пТзПараметрыАукционаТемп, пТзНастройкаСписания) Тогда
			пБулВыполнитьРасчет = Ложь;
			
			Прервать;
		КонецЕсли;	
		
		сооТемпОстатки = РасчетИтога_СуммыСписанияПоСтрокеВРазрезеПараметров(СтрокаТзИтоги, пТзНастройкаСписания);
		
		Если РасчетИтога_СуммыСписанияПоСтрокеВРазрезеПараметровНеПревышаютОстаток(сооТемпОстатки, пТзПараметрыАукционаТемп) Тогда
			
			РасчетИтога_СписатьОстатокПоСтроке(сооТемпОстатки, пТзПараметрыАукционаТемп);
			
			СтрокаТзИтоги.УчастникВыбран	= Истина;
			СтрокаТзИтоги.ЭтоПобедитель		= Истина;
		Иначе
			булВыполненоЧастичноеСписание = РасчетИтога_ВыполнитьЧастичноеСписывание(СтрокаТзИтоги, пТзНастройкаСписания, пТзПараметрыАукционаТемп);
			
			Если булВыполненоЧастичноеСписание Тогда
				Прервать;	
			КонецЕсли;	
				
		КонецЕсли;	
	КонецЦикла;
	
	Если булВыполненоЧастичноеСписание Тогда
		Итоги_ОтсортироватьТаблицуСогласноНастройкам(пТзИтогиТемп, пСткДанные.НастройкаРасчетаИтогов);
	Иначе
		пБулВыполнитьРасчет = Ложь;	
	КонецЕсли;
КонецПроцедуры

// 1. Определим все параметры по которым возможно списание	
// 2. Получим сумму по всем переменным для каждого параметра, которые НЕЛЬЗЯ списывать частично
// Остаток - Сумма(Переменные, по которым не разрешено частичное списание) 
// 3. Получившуюся разность разделим на сумму значений переменных по которым разрешено частичное списание
// 4. Получится коэффициент уменьшения (больше всего актуально для множества переменных) для каждого параметра
// 5. Перемножим значения переменных на этот коэффициент. Причем последний мы найдем как разность Остаток - Сумма(значения переменных умноженных на коэфф)
// 6. Отсортируем таблицу и заново запустим распределение
//
Функция РасчетИтога_ВыполнитьЧастичноеСписывание(СтрокаТзИтоги, пТзНастройкаСписания, пПараметрыАукциона)
	// Проверка того, что несписываемые параметры в сумме меньше остатка
	// иначе списывать будет нечего
	Для Каждого ЭлНастройкаСписания Из пТзНастройкаСписания Цикл
		СуммаИт = 0;
		Для Каждого ЭлМас Из ЭлНастройкаСписания.ПеременныеБезЧастничногоСписания Цикл
			СуммаИт = СуммаИт + СтрокаТзИтоги[ЭлМас];	
		КонецЦикла;
		
		масСтрокиТзПараметры = пПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", ЭлНастройкаСписания.Параметр));
		
		Если СуммаИт > масСтрокиТзПараметры[0].Остаток Тогда
			Возврат Ложь;
		КонецЕсли;	
	КонецЦикла;	
	
	// разрешено ли в принципе частичное списание хоть для какого параметра
	Если пТзНастройкаСписания.НайтиСтроки(Новый Структура("ЕстьЧастичноеСписание", Истина)).Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	масСтрокиТз = пТзНастройкаСписания.НайтиСтроки(Новый Структура("ЕстьЧастичноеСписание", Истина));
	 
	пТзНастройкаСписания.Колонки.Добавить("СуммаПоПеременнымБезЧастничногоСписания", Новый ОписаниеТипов("Число")); 
	пТзНастройкаСписания.Колонки.Добавить("СуммаПоПеременнымСЧастничнымСписанием", Новый ОписаниеТипов("Число"));
	пТзНастройкаСписания.Колонки.Добавить("КоффициентУменьшения", Новый ОписаниеТипов("Число"));
	
	булРез = Истина;
	Для Каждого СтрокаТзНастр Из масСтрокиТз Цикл
		Для Каждого ЭлМасПерем Из СтрокаТзНастр.ПеременныеБезЧастничногоСписания Цикл
			СтрокаТзНастр.СуммаПоПеременнымБезЧастничногоСписания
			= СтрокаТзНастр.СуммаПоПеременнымБезЧастничногоСписания + СтрокаТзИтоги[ЭлМасПерем];	
		КонецЦикла;
			
		Для Каждого ЭлМасПерем Из СтрокаТзНастр.ПеременныеСЧастничнымСписанием Цикл
			СтрокаТзНастр.СуммаПоПеременнымСЧастничнымСписанием
			= СтрокаТзНастр.СуммаПоПеременнымСЧастничнымСписанием + СтрокаТзИтоги[ЭлМасПерем];	
		КонецЦикла;
		
		масСтрокиТзПараметры = пПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", СтрокаТзНастр.Параметр));
		
		// Добавить проверки
		Если СтрокаТзНастр.СуммаПоПеременнымСЧастничнымСписанием = 0
			 Или СтрокаТзНастр.СуммаПоПеременнымБезЧастничногоСписания > масСтрокиТзПараметры[0].Остаток
		Тогда
			булРез = Ложь;
			
			Прервать;
		КонецЕсли;
		
		СтрокаТзНастр.КоффициентУменьшения
			= Окр((масСтрокиТзПараметры[0].Остаток - СтрокаТзНастр.СуммаПоПеременнымБезЧастничногоСписания) / СтрокаТзНастр.СуммаПоПеременнымСЧастничнымСписанием, 1); 
			
		//Если СтрокаТзНастр.КоффициентУменьшения > 1 Тогда
		//	булРез = Ложь;
		//	
		//	Прервать;		
		//КонецЕсли;	
			
		КолМас = СтрокаТзНастр.ПеременныеСЧастничнымСписанием.Количество();
		СуммаНов = 0;
		Для Сч = 0 По КолМас - 1 Цикл
			Если Сч < КолМас - 1 Тогда 
				СтрокаТзИтоги[СтрокаТзНастр.ПеременныеСЧастничнымСписанием[Сч]]
				= СтрокаТзИтоги[СтрокаТзНастр.ПеременныеСЧастничнымСписанием[Сч]] * СтрокаТзНастр.КоффициентУменьшения;
				
				СуммаНов = СуммаНов + СтрокаТзИтоги[СтрокаТзНастр.ПеременныеСЧастничнымСписанием[Сч]];
			Иначе
				СтрокаТзИтоги[СтрокаТзНастр.ПеременныеСЧастничнымСписанием[Сч]]
				= масСтрокиТзПараметры[0].Остаток - СтрокаТзНастр.СуммаПоПеременнымБезЧастничногоСписания - СуммаНов;
			КонецЕсли;
		КонецЦикла;	
		
	КонецЦикла;
	
	пТзНастройкаСписания.Колонки.Удалить("СуммаПоПеременнымБезЧастничногоСписания"); 
	пТзНастройкаСписания.Колонки.Удалить("СуммаПоПеременнымСЧастничнымСписанием");
	пТзНастройкаСписания.Колонки.Удалить("КоффициентУменьшения");
	
	Возврат булРез;
КонецФункции	

Функция РасчетИтога_ЕстьДоступныйОстатокДляСписания(пПараметрыАукциона, пТзНастр)
	булРез = Истина;
	
	Для Каждого СтрокаТз Из пТзНастр Цикл
		масСтрокиТзПараметры = пПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", СтрокаТз.Параметр));
		
		Если масСтрокиТзПараметры[0].Остаток <= 0 Тогда
			булРез = Ложь;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат булРез;
КонецФункции	

Процедура РасчетИтога_СписатьОстатокПоСтроке(пСооТемпОстатки, пПараметрыАукциона)
	Для Каждого ЭлСоот Из пСооТемпОстатки Цикл
		масСтрокиТзПараметры = пПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", ЭлСоот.Ключ));
		
		масСтрокиТзПараметры[0].Остаток = масСтрокиТзПараметры[0].Остаток - ЭлСоот.Значение;	
	КонецЦикла;	
КонецПроцедуры	

// Проверить по всем параметам, что то что насчитали не превышает остаток
//
Функция РасчетИтога_СуммыСписанияПоСтрокеВРазрезеПараметровНеПревышаютОстаток(пСооТемпОстатки, пПараметрыАукциона)
	булРез = Истина;
	Для Каждого ЭлСоот Из пСооТемпОстатки Цикл
		масСтрокиТзПараметры = пПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", ЭлСоот.Ключ));
		
		Если масСтрокиТзПараметры[0].Остаток < ЭлСоот.Значение Тогда
			булРез = Ложь;
			
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат булРез;
КонецФункции	

// Может быть такая ситуация кода один параметр списывается по более чем одной переменной
// для это соберем итоги в разрезе параметров
//
// Пример:
// Сумма			Переменная_1
// Сумма			Переменная_2
// Процент			Переменная_3
//
// Сумма = Переменная_1 + Переменная_2
// Процент = Переменная_3
//
// Нормальной считается ситуация когда мы СРАЗУ ПО ДВУМ параметрам не вылезли за лимит
//
Функция РасчетИтога_СуммыСписанияПоСтрокеВРазрезеПараметров(пСтрокаТз, пТзНастр)
	сооТемпОстатки = Новый Соответствие;
	
	Для Каждого СписПараметр Из пТзНастр Цикл	
		чслСуммаПоСтроке = 0;
		
		Для Каждого СтрокаТзПеремСписания Из СписПараметр.ВсеПеременные Цикл	
			чслСуммаПоСтроке = чслСуммаПоСтроке + пСтрокаТз[СтрокаТзПеремСписания];		
		КонецЦикла;
		
		сооТемпОстатки.Вставить(СписПараметр.Параметр, чслСуммаПоСтроке);
	КонецЦикла;
	
	Возврат сооТемпОстатки;
КонецФункции	

Процедура Итоги_ОпределитьПобедителейАвтоматически_ПромежуточныеИтоги(пТзИтогиТемп)
	Если пТзИтогиТемп.Количество() <> 0 Тогда
		пТзИтогиТемп[0].УчастникВыбран	= Истина;
		пТзИтогиТемп[0].ЭтоПобедитель	= Истина;
	КонецЕсли;	
КонецПроцедуры

Процедура Итоги_ОтсортироватьТаблицуСогласноНастройкам(пТзИтогиТемп, пНастройкаРасчетаИтогов)
	стрСортировка = ?(пНастройкаРасчетаИтогов.ВидРезультата = ПредопределенноеЗначение("Перечисление.АукВидыРезультатовРасчетаИтогов.Максимальный"), "УБЫВ", "ВОЗР");
	
	пТзИтогиТемп.Сортировать(СтрШаблон("РезультатРасчета %1", стрСортировка));	
КонецПроцедуры	

Функция ОкончательныеИтоги_ДанныеСтавокУчастников_ТемпТаблица_(пСткДанные)

	тзИтогиТемп = Новый ТаблицаЗначений;
	
	тзИтогиТемп.Колонки.Добавить("Участник",				Новый ОписаниеТипов("СправочникСсылка.АукУчастникиАукционов"));
	тзИтогиТемп.Колонки.Добавить("РезультатРасчета",		Новый ОписаниеТипов("Число"));
	тзИтогиТемп.Колонки.Добавить("ЭтоПобедитель",			Новый ОписаниеТипов("Булево"));
	тзИтогиТемп.Колонки.Добавить("УчастникВыбран",			Новый ОписаниеТипов("Булево"));
	тзИтогиТемп.Колонки.Добавить("СтрокаДанных",			Новый ОписаниеТипов("Число"));
	тзИтогиТемп.Колонки.Добавить("СтатусУчастия",			Новый ОписаниеТипов("Число"));
	тзИтогиТемп.Колонки.Добавить("ФормулаРасчетаРезультата",	Новый ОписаниеТипов("Строка"));
	тзИтогиТемп.Колонки.Добавить("ПредставлениеРезультата",	Новый ОписаниеТипов("Строка"));	
	
	Для Каждого КолонкаИмя Из пСткДанные.СтруктураСтавки Цикл	
		тзИтогиТемп.Колонки.Добавить(КолонкаИмя.ТехническоеНаименование, КолонкаИмя.ТипЗначения);		
	КонецЦикла;
	
	Для Каждого ДанныеКолонки Из пСткДанные.НастройкаРасчетаИтогов.Переменные Цикл	
		тзИтогиТемп.Колонки.Добавить(ДанныеКолонки.Переменная, Метаданные.ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.Тип);
		тзИтогиТемп.Колонки.Добавить(ДанныеКолонки.Переменная + "_Тип", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АукЭлементыДанныхАукционов"));
	КонецЦикла;
	
	Возврат тзИтогиТемп; 
	
КонецФункции

Функция ОкончательныеИтоги_ПараметрыАукциона_ТемпТаблица_(пСткДанные)
	тзРезультат = пСткДанные.ПараметрыАукциона.СкопироватьКолонки("Параметр");
	
	тзРезультат.Колонки.Добавить("НачальноеЗначение", Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("ТекущееЗначение", Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("Остаток", Новый ОписаниеТипов("Число"));
	
	сооСохрПараметры = РегистрыСведений.АукРасчетИтоговПараметры.СохраненныеЗначенияПараметровИтоговАукционаПоЭтапу(пСткДанные.Аукцион, пСткДанные.НомерЭтапа);
		
	Для Каждого СтрокаТз Из пСткДанные.ПараметрыАукциона Цикл 
		НовСтрока			= тзРезультат.Добавить();
		
		НовСтрока.Параметр	= СтрокаТз.Параметр;
		НовСтрока.НачальноеЗначение = СтрокаТз.ЗначениеПараметра;
		
		ТекЗначение = сооСохрПараметры.Получить(СтрокаТз.Параметр);
		
		Если ТекЗначение = Неопределено Тогда
			НовСтрока.ТекущееЗначение = СтрокаТз.ЗначениеПараметра;	
			НовСтрока.Остаток = СтрокаТз.ЗначениеПараметра;
		Иначе
			НовСтрока.ТекущееЗначение =	ТекЗначение;
		КонецЕсли;	
	КонецЦикла;	
		
	Возврат тзРезультат;
КонецФункции

Процедура Итоги_ЗаполнитьИтогиПоСохраненнымДанным(пНовСтрока, пТзРезультатыАукциона)
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("Участник",		пНовСтрока.Участник);
	сткОтбор.Вставить("СтрокаДанных",	пНовСтрока.СтрокаДанных);
	
	масСтрокиТз = пТзРезультатыАукциона.НайтиСтроки(сткОтбор); // по идее здесь одна строка
	
	Если масСтрокиТз.Количество() <> 0 Тогда
		пНовСтрока.РезультатРасчета = масСтрокиТз[0].РезультатРасчета;
		пНовСтрока.УчастникВыбран = масСтрокиТз[0].УчастникВыбран;
		пНовСтрока.ЭтоПобедитель = масСтрокиТз[0].ЭтоПобедитель;
	КонецЕсли;
КонецПроцедуры

Процедура Итоги_РасчетИтогаПоСтроке(пНовСтрока, пНастройкаРасчетаИтогов)
	чслРезультат = 0;
	
	Если пНовСтрока.СтатусУчастия = 0 Тогда
		Выражение = пНастройкаРасчетаИтогов.Формула;
		
		Для Каждого ЭлПеременная Из пНастройкаРасчетаИтогов.Переменные Цикл
			Выражение = СтрЗаменить(Выражение, "[" + ЭлПеременная.Переменная + "]", АукОбщийКлиентСервер.ПреобразоватьЧислоКСтрокеДляВычисления(пНовСтрока[ЭлПеременная.Переменная]));	
		КонецЦикла;
		
		Попытка
			чслРезультат = ОбщегоНазначения.ВычислитьВБезопасномРежиме(Выражение);
		Исключение
			чслРезультат = 0;	
		КонецПопытки;
	КонецЕсли;
	
	пНовСтрока.РезультатРасчета = чслРезультат;
КонецПроцедуры	

Процедура Итоги_ЗаполнитьЗначенияПеременныхПоСохраненнымДанным(пНовСтрока, пТзПеременныеФормулы)
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("Участник",		пНовСтрока.Участник);
	сткОтбор.Вставить("СтрокаДанных",	пНовСтрока.СтрокаДанных);
	
	масСтрокиТз = пТзПеременныеФормулы.НайтиСтроки(сткОтбор);
	
	Для Каждого СтрокаТз Из масСтрокиТз Цикл
		пНовСтрока[СтрокаТз.Переменная] = СтрокаТз.ЗначениеПеременной;
		пНовСтрока[СтрокаТз.Переменная + "_Тип"] = СтрокаТз.ТипПеременной; 
	КонецЦикла;	
КонецПроцедуры

Процедура Итоги_ЗаполнитьЗначенияПеременныхПоНастройкам(пНовСтрока, пСткПараметры)
	Для Каждого ЭлПеременная Из пСткПараметры.НастройкаРасчетаИтогов.Переменные Цикл
		масПриоритетЗначенийПерем = пСткПараметры.НастройкаРасчетаИтогов.ЗначенияПеременных.Получить(ЭлПеременная.Переменная);
		
		ЗначениеПеременнойЧислом = 0;
		ЗначениеТипаПеременной = ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.ПустаяСсылка();
		
		Если пНовСтрока.СтатусУчастия = 0 Тогда 
			Для Каждого ЭлЗначПеременной Из масПриоритетЗначенийПерем Цикл
				Если ЭлЗначПеременной.ИсточникДанных = ПредопределенноеЗначение("Перечисление.АукИсточникиЗначенийПеременных.Ставка") Тогда
					Если ЗначениеЗаполнено(пНовСтрока[ЭлЗначПеременной.ТехническоеНаименование]) Тогда
						ЗначениеПеременнойЧислом = пНовСтрока[ЭлЗначПеременной.ТехническоеНаименование];
						
						Прервать;	
					КонецЕсли;
				ИначеЕсли ЭлЗначПеременной.ИсточникДанных = ПредопределенноеЗначение("Перечисление.АукИсточникиЗначенийПеременных.НачальныеДанные") Тогда
					масСтрокиТз = пСткПараметры.НачальныеДанные.НайтиСтроки(Новый Структура("Участник", пНовСтрока.Участник));
					
					СтрокаТз = масСтрокиТз[0];
					
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТз, ЭлЗначПеременной.ТехническоеНаименование) Тогда	
						Если ЗначениеЗаполнено(СтрокаТз[ЭлЗначПеременной.ТехническоеНаименование]) Тогда
							ЗначениеПеременнойЧислом = СтрокаТз[ЭлЗначПеременной.ТехническоеНаименование];
							
							Прервать;	
						КонецЕсли;	
					КонецЕсли;		
				ИначеЕсли ЭлЗначПеременной.ИсточникДанных = ПредопределенноеЗначение("Перечисление.АукИсточникиЗначенийПеременных.ПараметрАукциона") Тогда
					масСтрокиТз = пСткПараметры.ПараметрыАукциона.НайтиСтроки(Новый Структура("Параметр", ЭлЗначПеременной.ЗначениеДанных));
					
					Если масСтрокиТз.Количество() <> 0 И ЗначениеЗаполнено(масСтрокиТз[0].ЗначениеПараметра) Тогда
						ЗначениеПеременнойЧислом = масСтрокиТз[0].ЗначениеПараметра;
						
						Прервать;	
					КонецЕсли;	
				ИначеЕсли ЭлЗначПеременной.ИсточникДанных = ПредопределенноеЗначение("Перечисление.АукИсточникиЗначенийПеременных.ПредопределенныеДанные") Тогда
					ЗначениеКонстанты = ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.ЗначениеКонстантыПоТехническомуНаименованию(ЭлЗначПеременной.ТехническоеНаименование);
					
					Если ЗначениеЗаполнено(ЗначениеКонстанты) Тогда
						ЗначениеПеременнойЧислом = ЗначениеКонстанты;
						
						Прервать;	
					КонецЕсли;	
				КонецЕсли;		
			КонецЦикла;
			
			ЗначениеТипаПеременной = ЭлЗначПеременной.ЗначениеДанных;
		КонецЕсли;
		
		пНовСтрока[ЭлПеременная.Переменная] = ЗначениеПеременнойЧислом;
		
		пНовСтрока[ЭлПеременная.Переменная + "_Тип"] = ЗначениеТипаПеременной;
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#Область РаботаСФормами

Процедура ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(пФорма, пВидАукциона, пИмяТаблицы, пРодитель = Неопределено, пМасСтруктураДанных = Неопределено, пБулПомечатьОбязательные = Истина) Экспорт
	
	Если пМасСтруктураДанных = Неопределено Тогда
		пМасСтруктураДанных	= Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона);
	КонецЕсли;
	
	ДобавитьКолонкиДанных(пФорма, пМасСтруктураДанных, пИмяТаблицы, пРодитель,, пБулПомечатьОбязательные);
	
КонецПроцедуры

Процедура ДобавитьКолонкиНачальныхДанныхПоАукциону(пФорма, пВидАукциона, пИмяТаблицы, пРодитель = Неопределено, пМасСтруктураДанных = Неопределено, пБулИспользоватьПостфикс = Ложь) Экспорт
	
	Если пМасСтруктураДанных = Неопределено Тогда
		пМасСтруктураДанных	= Справочники.АукВидыАукционов.ОписаниеСтруктурыНачальныхДанныхПоВидуАукциона(пВидАукциона);
	КонецЕсли;
	
	Постфикс = ?(пБулИспользоватьПостфикс, АукОбщийКлиентСервер.ПостфиксПовторяющихсяИменРеквизитов(), "");
	
	ДобавитьКолонкиДанных(пФорма, пМасСтруктураДанных, пИмяТаблицы, пРодитель, Постфикс);
	
КонецПроцедуры

Процедура УдалитьКолонкиНачальныхДанныхПоАукциону(пФорма, пВидАукциона, пИмяТаблицы, пМасСтруктураДанных = Неопределено, пБулИспользоватьПостфикс = Ложь) Экспорт
	
	Если пМасСтруктураДанных = Неопределено Тогда
		пМасСтруктураДанных	= Справочники.АукВидыАукционов.ОписаниеСтруктурыНачальныхДанныхПоВидуАукциона(пВидАукциона);
	КонецЕсли;
	
	Постфикс = ?(пБулИспользоватьПостфикс, АукОбщийКлиентСервер.ПостфиксПовторяющихсяИменРеквизитов(), "");
	
	УдалитьКолонкиДанных(пФорма, пМасСтруктураДанных, пИмяТаблицы, Постфикс);
	
КонецПроцедуры

Процедура ДобавитьКолонкиПеременныхРасчетаИтога(пФорма, пИмяТаблицы, пРодитель, пТзПеременные, пИмяОбработчикаПриИзменении = "") Экспорт	
	масНельзяРедактировать = Новый Массив;
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ОписаниеТиповПВХ = Метаданные.ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.Тип;
	
	Для Сч = 0 По пТзПеременные.Количество() - 1 Цикл
		// Реквизит для хранения значения 
		НовыйРеквизит = Новый РеквизитФормы(пТзПеременные[Сч].Переменная, ОписаниеТиповПВХ);
		НовыйРеквизит.Путь			= пИмяТаблицы;
		НовыйРеквизит.Заголовок		= пТзПеременные[Сч].Переменная;
		
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		Если Не пТзПеременные[Сч].Редактируется Тогда
			масНельзяРедактировать.Добавить(НовыйРеквизит.Имя);	
		КонецЕсли;
		
		// Реквизит для хранения ссылки на элемент ПВХ 
		НовыйРеквизит = Новый РеквизитФормы(пТзПеременные[Сч].Переменная + "_Тип", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АукЭлементыДанныхАукционов"));
		НовыйРеквизит.Путь			= пИмяТаблицы;
		
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	пФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);	
	
	Для Каждого ЭлРеквизит Из ДобавляемыеРеквизиты Цикл
		Если СтрЗаканчиваетсяНа(ЭлРеквизит.Имя, "_Тип") Тогда
			Продолжить;
		КонецЕсли;	
		
		// Создание элемента формы
		НовыйЭлемент = пФорма.Элементы.Добавить(пИмяТаблицы + ЭлРеквизит.Имя, Тип("ПолеФормы"), пРодитель);
		НовыйЭлемент.ПутьКДанным	= пИмяТаблицы + "." + ЭлРеквизит.Имя;
		НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", пИмяОбработчикаПриИзменении);
		
		// Создать связь по типу
		Реквизит = СтрШаблон("Элементы.%1.ТекущиеДанные.%2", пИмяТаблицы, ЭлРеквизит.Имя + "_Тип");
		
		НовыйЭлемент.СвязьПоТипу = Новый СвязьПоТипу(Реквизит);
				
		Если масНельзяРедактировать.Найти(ЭлРеквизит.Имя) <> Неопределено Тогда
			НовыйЭлемент.ТолькоПросмотр = Истина;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры	

Процедура ЗаполнитьДанныеДляОтборовНаФорме(пФорма) Экспорт
	тзКонтактныеЛицаУчастников = Справочники.АукАукционы.КонтактныеЛицаСПривязкойКУчастникам(пФорма.Аукцион);
	
	пФорма.СписокКонтактныхЛиц	= Новый ФиксированныйМассив(тзКонтактныеЛицаУчастников.ВыгрузитьКолонку("КонтактноеЛицо"));
	
	тзКонтактныеЛицаУчастников.Свернуть("Участник");
	
	пФорма.СписокУчастников		= Новый ФиксированныйМассив(тзКонтактныеЛицаУчастников.ВыгрузитьКолонку("Участник"));
	
	СписокВыбораУчастников = пФорма.Элементы.Участник.СписокВыбора;
	
	СписокВыбораУчастников.Очистить();
	
	Для Каждого ЭлУчастник Из пФорма.СписокУчастников Цикл
		
		СписокВыбораУчастников.Добавить(ЭлУчастник);
		
	КонецЦикла;	
КонецПроцедуры	

Процедура ОбработкаПередЗаписьюФормЭлементовПВХ(пТекущийОбъект, пПараметрыЗаписи, пОтказ) Экспорт
	
	ИмяОбъектаМд = Метаданные.НайтиПоТипу(ТипЗнч(пТекущийОбъект)).Имя;
	
	Если пПараметрыЗаписи.НаименованиеБылоИзменено Тогда
		
		сткРез = АукОбщийВызовСервера.НаименованиеСоответствуетТребованиям(пТекущийОбъект, ИмяОбъектаМд);
		
		Если Не сткРез.Успех Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(сткРез.Результат,,, "Объект.Наименование", пОтказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если пПараметрыЗаписи.ТехническоеНаименованиеБылоИзменено Тогда
		
		сткРез = АукОбщийВызовСервера.ТехническоеНаименованиеСоответствуетТребованиям(пТекущийОбъект, ИмяОбъектаМд);
		
		Если Не сткРез.Успех Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(сткРез.Результат,,, "Объект.ТехническоеНаименование", пОтказ);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры	

Функция СписокПодчиненныхПолейВводаЭлементаФормы(пЭлементФормы, пБулУчитыватьПодчиненных = Истина) Экспорт
	
	масПоля = Новый Массив;
	
	СписокПодчиненныхПолейВводаЭлементаФормыРекурсивно(пЭлементФормы, пБулУчитыватьПодчиненных, масПоля);
	
	Возврат масПоля;
	
КонецФункции	

#КонецОбласти

#Область РезультатЗапросаИзДереваВТаблицу

Функция СоздатьТаблицуПоСоставуКолонок(пКолонки, пСтрИсключаяКолонки = "", пМасДопКолонки = Неопределено) Экспорт
	масИсключение = СтрРазделить(пСтрИсключаяКолонки, ",");
	
	тзРезультат = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из пКолонки Цикл
		Если масИсключение.Найти(Колонка.Псевдоним) = Неопределено Тогда  
			тзРезультат.Колонки.Добавить(Колонка.Псевдоним, Колонка.ТипЗначения);
		КонецЕсли;
	КонецЦикла;
	
	Если пМасДопКолонки <> Неопределено Тогда 
		Для Каждого ЭлСтк Из пМасДопКолонки Цикл	
			тзРезультат.Колонки.Добавить(ЭлСтк.ТехническоеНаименование, ЭлСтк.ТипЗначения);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат тзРезультат;
КонецФункции

Функция СвойстваПоследнегоПакетаЗапроса(пСтрТекстЗапроса) Экспорт
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(пСтрТекстЗапроса);
	
	КоличествоПакетов = СхемаЗапроса.ПакетЗапросов.Количество();
	
	Возврат СхемаЗапроса.ПакетЗапросов.Получить(КоличествоПакетов - 1);
КонецФункции	

Процедура ЗаполнитьДанныеУчастниковПоРезультатуЗапроса(пТзРезультат, пРезультатЗапроса, пКоличествоГруппировок = 2, пПолеЭлемент, пПолеЗначение) Экспорт
	
	дзРезультат = пРезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаДз Из дзРезультат.Строки Цикл
		
		ЗаполнитьДанныеУчастниковПоРезультатуЗапросаРекурсивно(пТзРезультат, СтрокаДз, пКоличествоГруппировок, пПолеЭлемент, пПолеЗначение);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеУчастниковПоРезультатуЗапросаРекурсивно(пТзРезультат, пСтрокаДз, пКоличествоГруппировок, пПолеЭлемент, пПолеЗначение, пНоваяСтрока = Неопределено)
	
	Если пСтрокаДз.Уровень() = (пКоличествоГруппировок - 1) Тогда
		
		Для Каждого СтрокаДз Из пСтрокаДз.Строки Цикл
			
			пНоваяСтрока[СтрокаДз[пПолеЭлемент]] = СтрокаДз[пПолеЗначение];
				
			ЗаполнитьЗначенияСвойств(пНоваяСтрока, СтрокаДз);
			
		КонецЦикла;
		
	ИначеЕсли пСтрокаДз.Уровень() = (пКоличествоГруппировок - 2) Тогда 
		
		Для Каждого СтрокаДз Из пСтрокаДз.Строки Цикл
			
			НоваяСтрока = пТзРезультат.Добавить();
		
			ЗаполнитьЗначенияСвойств(НоваяСтрока, пСтрокаДз);
			
			ЗаполнитьДанныеУчастниковПоРезультатуЗапросаРекурсивно(пТзРезультат, СтрокаДз, пКоличествоГруппировок, пПолеЭлемент, пПолеЗначение, НоваяСтрока);
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаДз Из пСтрокаДз.Строки Цикл
			
			ЗаполнитьДанныеУчастниковПоРезультатуЗапросаРекурсивно(пТзРезультат, СтрокаДз, пКоличествоГруппировок, пПолеЭлемент, пПолеЗначение);
			
		КонецЦикла;
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область КонтрольДанныхАукционаДляАвтоматическихРежимов

// Выполнить контроль данных аукциона
//
// Параметры:
//  пДанныеАукциона	 - 	Структура 
//		*ДатаНачала - Дата
//		*Участники - Массив
//		*Этапы - Массив структур
//			**НомерСтроки - Число
//			**Этап - Строка
//			**ДлительностьДни - Число
//			**ДлительностьЧасы - Дата
//		*ВидАукциона - СправочникСсылка.АукВидыАукционов
//		*Сумма - Число
//		*Срок - Число
// Возвращаемое значение:
//   Структура
//		*Успех - Булево - Проверка успешна пройдена
//		*Результат - Булево - Описание ошибки в случае неуспешной проверки
//
Функция ВыполнитьКонтрольДанныхАукциона(пДанныеАукциона) Экспорт	
	// 1. Дата начала (заполненность), Наличие участников
	сткРез = ВыполнитьКонтрольДанныхАукциона_СтартовыеДанные(пДанныеАукциона);
	
	Если Не сткРез.Успех Тогда
		Возврат сткРез; 	
	КонецЕсли;	
		
	// 2. Этапы: количество, длительность, наименование
	сткРез = ВыполнитьКонтрольДанныхАукциона_ПереходПоЭтапам(пДанныеАукциона);
	
	Если Не сткРез.Успех Тогда
		Возврат сткРез; 	
	КонецЕсли;
		
	// 5. Наличие шаблонов оповещения
	сткРез = ВыполнитьКонтрольДанныхАукциона_ШаблоныОповещений(пДанныеАукциона);
	
	Если Не сткРез.Успех Тогда
		Возврат сткРез; 	
	КонецЕсли;
	
	// 6.1 Заполненность исходных данных
	//		Сумма, Срок
	сткРез = ВыполнитьКонтрольДанныхАукциона_ИсходныеДанные(пДанныеАукциона);
	
	// 6.2 Параметры аукциона
	сткРез = ВыполнитьКонтрольДанныхАукциона_Параметры(пДанныеАукциона);
	
	Если Не сткРез.Успех Тогда
		Возврат сткРез; 	
	КонецЕсли;
			
	Возврат ЭдоОбщий._Успех();	
КонецФункции	

#КонецОбласти

#Область Рассылка

Функция АккаунтРассылкиКотировки() Экспорт
	Возврат "Аккаунт";
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьКонтрольДанныхАукциона_Параметры(пДанныеАукциона)
	Если АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		Если пДанныеАукциона.Параметры.Количество() = 0 Тогда
			Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Не заполнены параметры аукциона'"));	
		КонецЕсли;
		
		масОшибки = Новый Массив;
		Для Каждого ЭлПараметр Из пДанныеАукциона.Параметры Цикл
			Если Не ЗначениеЗаполнено(ЭлПараметр.ЗначениеПараметра) Тогда
				масОшибки.Добавить(СтрШаблон(НСтр("ru = 'Для параметра <%1> не задано значение'"), ЭлПараметр.Параметр));	
			КонецЕсли;	
		КонецЦикла;
		
		Если масОшибки.Количество() <> 0 Тогда
			Возврат ЭдоОбщий._Ошибка(СтрСоединить(масОшибки, Символы.ПС));	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();		
КонецФункции

Функция ВыполнитьКонтрольДанныхАукциона_ИсходныеДанные(пДанныеАукциона)
	Если Не АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		Если пДанныеАукциона.НастройкиАвтоматики.АвтоматическоеПодведениеОкончательныхИтогов Тогда	
			Если Не ЗначениеЗаполнено(пДанныеАукциона.Сумма) Тогда
				Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Не заполнена сумма'"));	
			КонецЕсли;	
		Иначе
			Если Справочники.АукВидыАукционов.КлючевыеДанныеВидаАукциона(пДанныеАукциона.ВидАукциона).СРаспределениемСуммы Тогда
				Если Не ЗначениеЗаполнено(пДанныеАукциона.Сумма) Тогда
					Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Не заполнена сумма'"));	
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();		
КонецФункции

Функция ВыполнитьКонтрольДанныхАукциона_ШаблоныОповещений(пДанныеАукциона)
	масВидыСообщенийДляОповещения = АукОбщийКлиентСервер.ВидыСообщенийДляУведомленияУчастников();
	
	сткРез = РегистрыСведений.АукШаблоныСообщений.ОтсутствующиеДанныеОповещенийПоВидамСообщений(масВидыСообщенийДляОповещения);	
	
	Если сткРез.ОтсутствующиеШаблоны.Количество() <> 0 Тогда
		Возврат ЭдоОбщий._Ошибка(СтрШаблон(НСтр("ru = 'Отсутсвуют шаблоны для видов сообщений: %1'"), СтрСоединить(сткРез.ОтсутствующиеШаблоны, ", ")));	
	КонецЕсли;
	
	Если сткРез.ОтсутствующиеЗаголовки.Количество() <> 0 Тогда
		Возврат ЭдоОбщий._Ошибка(СтрШаблон(НСтр("ru = 'Отсутсвуют заголовки для видов сообщений: %1'"), СтрСоединить(сткРез.ОтсутствующиеЗаголовки, ", ")));	
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();		
КонецФункции

Функция ВыполнитьКонтрольДанныхАукциона_СтартовыеДанные(пДанныеАукциона)
	// Начало аукциона
	Если Не ЗначениеЗаполнено(пДанныеАукциона.ДатаНачала) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Не заполнена дата начала аукциона'"));	
	КонецЕсли;
		
	// Участники
	Если пДанныеАукциона.Участники.Количество() = 0 Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Не заполнены участники'"));	
	КонецЕсли;	
		
	Возврат ЭдоОбщий._Успех();		
КонецФункции

Функция ВыполнитьКонтрольДанныхАукциона_ПереходПоЭтапам(пДанныеАукциона)
	// Этапы: количество, длительность, наименование
	Если пДанныеАукциона.Этапы.Количество() = 0 Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Не добавлен ни один этап аукциона'")); 	
	Иначе
		масОшибки = Новый Массив;
		Для Каждого СтрокаЭтап Из пДанныеАукциона.Этапы Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаЭтап.Этап) Тогда	
				масОшибки.Добавить(СтрШаблон(НСтр("ru = 'Не заполнено имя этапа аукциона (номер строки: %1)'"), СтрокаЭтап.НомерСтроки));	
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(масОшибки) Тогда
			Возврат ЭдоОбщий._Ошибка(СтрСоединить(масОшибки, Символы.ПС));		
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
КонецФункции

Процедура СписокПодчиненныхПолейВводаЭлементаФормыРекурсивно(пЭлементФормы, пБулУчитыватьПодчиненных, пМасПоля)
	
	Для Каждого ПодчиненныеЭл Из пЭлементФормы.ПодчиненныеЭлементы Цикл
		Если пБулУчитыватьПодчиненных И ТипЗнч(ПодчиненныеЭл) = Тип("ГруппаФормы") Тогда
			
			СписокПодчиненныхПолейВводаЭлементаФормыРекурсивно(ПодчиненныеЭл, пБулУчитыватьПодчиненных, пМасПоля); 
			
		ИначеЕсли ТипЗнч(ПодчиненныеЭл) = Тип("ПолеФормы") Тогда
			пМасПоля.Добавить(ПодчиненныеЭл.Имя);	
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры

Функция РасчитатьПромежуточныйИтогПоФормуле(пФормула, пМасСтруктураСтавки, пСтрокаТзИсточник)	
	чслРезультат = 0;
	
	Если ЗначениеЗаполнено(пФормула) Тогда
		
		ПромежуточныйИтогВыражение = пФормула;
		
		Для Каждого сткЭлемент Из пМасСтруктураСтавки Цикл
			
			Если СтрНайти(ПромежуточныйИтогВыражение, "[" + сткЭлемент.Наименование + "]") <> 0 Тогда
				
				ПромежуточныйИтогВыражение = СтрЗаменить(ПромежуточныйИтогВыражение, "[" + сткЭлемент.Наименование + "]", ЧисловоеЗначениеСтрокой(пСтрокаТзИсточник, сткЭлемент));
				
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			чслРезультат = ОбщегоНазначения.ВычислитьВБезопасномРежиме(ПромежуточныйИтогВыражение);
		Исключение
			чслРезультат = 0;	
		КонецПопытки;
	КонецЕсли;
	
	Возврат чслРезультат;	
КонецФункции

// Нужно заменить в числах "," на ".", а то при вычислении будет ошибка
//
Функция ЧисловоеЗначениеСтрокой(пСтрокаТзИсточник, пСткЭлемент)
	
	Возврат Формат(пСтрокаТзИсточник[пСткЭлемент.ТехническоеНаименование], "ЧРД=.; ЧН=0; ЧГ=0");
	
КонецФункции	

Функция РасчитатьИтоговоеЗначениеПоШаблону(пШаблон, пМасСтруктураСтавки, пСтрокаТзИсточник)
	
	Если ЗначениеЗаполнено(пШаблон) Тогда
		
		ШаблонРезультатаВыражение = пШаблон;
		
		Для Каждого сткЭлемент Из пМасСтруктураСтавки Цикл
			
			Если СтрНайти(ШаблонРезультатаВыражение, "[" + сткЭлемент.Наименование + "]") <> 0 Тогда
				
				ШаблонРезультатаВыражение = СтрЗаменить(ШаблонРезультатаВыражение, "[" + сткЭлемент.Наименование + "]", XMLСтрока(пСтрокаТзИсточник[сткЭлемент.ТехническоеНаименование]));
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ШаблонРезультатаВыражение;
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;	
	
КонецФункции

Процедура УдалитьКолонкиДанных(пФорма, пМасСтруктураДанных, пИмяТаблицы, пПостфикс = "")
		
	// 1. Удаление элементов формы
	Для Каждого ЭлСтк Из пМасСтруктураДанных Цикл
		
		НайденныйЭлемент = пФорма.Элементы.Найти(пИмяТаблицы + "Характеристика" + ЭлСтк.ТехническоеНаименование + пПостфикс);
		
		Если Не НайденныйЭлемент = Неопределено Тогда
			пФорма.Элементы.Удалить(НайденныйЭлемент);
		КонецЕсли;
		
		НайденныйЭлемент = пФорма.Элементы.Найти(пИмяТаблицы + ЭлСтк.ТехническоеНаименование + пПостфикс);
		
		Если Не НайденныйЭлемент = Неопределено Тогда
			пФорма.Элементы.Удалить(НайденныйЭлемент);
		КонецЕсли;
		
	КонецЦикла;
	
	// 2. Удаление реквизитов формы
	УдаляемыеРеквизиты = Новый Массив;
	
	Для Каждого ЭлСтк Из пМасСтруктураДанных Цикл		
		УдаляемыеРеквизиты.Добавить(пИмяТаблицы + "." + "Характеристика" + ЭлСтк.ТехническоеНаименование + пПостфикс);
		
		УдаляемыеРеквизиты.Добавить(пИмяТаблицы + "." +  ЭлСтк.ТехническоеНаименование + пПостфикс);
	КонецЦикла;
	
	пФорма.ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
КонецПроцедуры

Процедура ДобавитьКолонкиДанных(пФорма, пМасСтруктураДанных, пИмяТаблицы, пРодитель, пПостфикс = "", пБулПомечатьОбязательные = Истина)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	масОбязательные = Новый Массив;
	
	Для Каждого ЭлСтк Из пМасСтруктураДанных Цикл
		ТипЭлементаСтавки = ТипЗнч(ЭлСтк.Элемент);
		
		// 1. Колонка, отвечающая за вид характеристики (ПВХ)
		мас = Новый Массив;
		мас.Добавить(ТипЭлементаСтавки);
		
		НовыйРеквизит = Новый РеквизитФормы("Характеристика" + ЭлСтк.ТехническоеНаименование + пПостфикс, Новый ОписаниеТипов(мас));
		НовыйРеквизит.Путь			= пИмяТаблицы;
		
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			
		// 2. Колонка, отвечающая за значение характеристики (Характеристику)
		НовыйРеквизит = Новый РеквизитФормы(ЭлСтк.ТехническоеНаименование + пПостфикс, ЭлСтк.ТипЗначения);
		НовыйРеквизит.Путь			= пИмяТаблицы;
		НовыйРеквизит.Заголовок		= ЭлСтк.ЭлементПредставление;
		
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		Если пБулПомечатьОбязательные И ЭлСтк.Свойство("НеОбязательный") И Не ЭлСтк.НеОбязательный Тогда 
			масОбязательные.Добавить(НовыйРеквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	пФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Можно указать родителя явно либо указать таблицу формы в качестве родителя
	Если пРодитель = Неопределено Тогда
		пРодитель = пФорма.Элементы[пИмяТаблицы];	
	КонецЕсли;	
	
	Для Каждого ЭлРеквизит Из ДобавляемыеРеквизиты Цикл
		// Создание элемента формы
		НовыйЭлемент = пФорма.Элементы.Добавить(пИмяТаблицы + ЭлРеквизит.Имя, Тип("ПолеФормы"), пРодитель);
		НовыйЭлемент.ПутьКДанным	= пИмяТаблицы + "." + ЭлРеквизит.Имя;
		НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
		
		Если СтрНачинаетсяС(ЭлРеквизит.Имя, "Характеристика") Тогда
			НовыйЭлемент.Видимость	= Ложь;	
		Иначе	
			// 1. Создать связи параметров выбора
			Реквизит = СтрШаблон("Элементы.%1.ТекущиеДанные.%2", пИмяТаблицы, "Характеристика" + ЭлРеквизит.Имя);
				
			масСвязиПараметровВыбора = Новый Массив;
			масСвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", Реквизит, РежимИзмененияСвязанногоЗначения.Очищать));
			
			НовыйЭлемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(масСвязиПараметровВыбора);
			
			// 2. Создать связь по типу
			НовыйЭлемент.СвязьПоТипу = Новый СвязьПоТипу(Реквизит);
			
			Если масОбязательные.Найти(ЭлРеквизит.Имя) <> Неопределено Тогда
				НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;	
			КонецЕсли;	
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьКопиюОбъектаМетаданных(пМетаданныеОбъекта, пОбъектИсточник)
	
	обНовыйЭлемент = Справочники[пМетаданныеОбъекта.Имя].СоздатьЭлемент();
	
	СкопироватьЗначенияРеквизитов(пМетаданныеОбъекта.Реквизиты, обНовыйЭлемент, пОбъектИсточник);
	
	СкопироватьЗначенияРеквизитовТабличныхЧастей(пМетаданныеОбъекта.ТабличныеЧасти, обНовыйЭлемент, пОбъектИсточник);
	
	обНовыйЭлемент.ДополнительныеСвойства.Вставить("ЭтоСнимок");
	
	Возврат обНовыйЭлемент;
	
КонецФункции

Процедура СкопироватьЗначенияРеквизитовТабличныхЧастей(пТабличныеЧасти, пОбъектПриемник, пОбъектИсточник)

	Для Каждого ЭлТабЧасть Из пТабличныеЧасти Цикл
		
		Для Каждого СтрокаТч Из пОбъектИсточник[ЭлТабЧасть.Имя] Цикл 
			
			СкопироватьЗначенияРеквизитов(ЭлТабЧасть.Реквизиты, пОбъектПриемник[ЭлТабЧасть.Имя].Добавить(), СтрокаТч);
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьЗначенияРеквизитов(пРеквизиты, пОбъектПриемник, пОбъектИсточник)

	Для Каждого ЭлРеквизит Из пРеквизиты Цикл
		
		пОбъектПриемник[ЭлРеквизит.Имя] = пОбъектИсточник[ЭлРеквизит.Имя];
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗначенияПараметровШаблонов

Функция ЗначенияПараметровШаблонов_Общие(пМасПараметрыШаблона, Знач пСткДанные) Экспорт
	сооРезультат = Новый Соответствие;
	
	Для Каждого ПараметрИмя Из пМасПараметрыШаблона Цикл
		Если ПараметрИмя = "АУКЦИОН_НАИМЕНОВАНИЕ" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_НАИМЕНОВАНИЕ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_КОД" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_КОД(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_ЭТАПЫ" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_ЭТАПЫ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_ПЛАНИРУЕМОЕ_ВРЕМЯ_ЗАВЕРШЕНИЯ" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_ПЛАНИРУЕМОЕ_ВРЕМЯ_ЗАВЕРШЕНИЯ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_СТРУКТУРА_СТАВКИ" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_СТРУКТУРА_СТАВКИ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_ТЕКУЩИЙ_ЭТАП" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_ТЕКУЩИЙ_ЭТАП(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_ВСЕГО_ЭТАПОВ" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_ВСЕГО_ЭТАПОВ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_ДАННЫЕ_ПРОМЕЖУТОЧНОГО_ПОБЕДИТЕЛЯ" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_ДАННЫЕ_ПРОМЕЖУТОЧНОГО_ПОБЕДИТЕЛЯ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_НАЧАЛЬНЫЕ_ДАННЫЕ_ВСЕХ_УЧАСТНИКОВ" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_НАЧАЛЬНЫЕ_ДАННЫЕ_ВСЕХ_УЧАСТНИКОВ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_ВРЕМЯ_ОТКАЗА_ОТ_ПРОДОЛЖЕНИЯ" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_ВРЕМЯ_ОТКАЗА_ОТ_ПРОДОЛЖЕНИЯ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_ССЫЛКА" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_ССЫЛКА(сооРезультат, ПараметрИмя, пСткДанные);	
			
		КонецЕсли;
	КонецЦикла;	
	
	Возврат сооРезультат;	
КонецФункции

Функция ЗначенияПараметровШаблонов_Индивидуальные(пМасПараметрыШаблона, Знач пСткДанные) Экспорт
	сооРезультат = Новый Соответствие;
	
	Для Каждого ПараметрИмя Из пМасПараметрыШаблона Цикл
		Если ПараметрИмя = "СТАВКА_ВРЕМЯ_ПРИНЯТИЯ" Тогда
			
			ДобавитьЗначениеПараметра_СТАВКА_ВРЕМЯ_ПРИНЯТИЯ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "СТАВКА_ДАННЫЕ_СТАВКИ" Тогда
			
			ДобавитьЗначениеПараметра_СТАВКА_ДАННЫЕ_СТАВКИ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "ОТКАЗ_ВРЕМЯ_ПРИНЯТИЯ" Тогда
			
			ДобавитьЗначениеПараметра_ОТКАЗ_ВРЕМЯ_ПРИНЯТИЯ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "СТАВКА_ДАННЫЕ_ПОБЕДНОЙ_СТАВКИ" Тогда
			
			ДобавитьЗначениеПараметра_СТАВКА_ДАННЫЕ_ПОБЕДНОЙ_СТАВКИ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "АУКЦИОН_НАЧАЛЬНЫЕ_ДАННЫЕ_УЧАСТНИКА" Тогда
			
			ДобавитьЗначениеПараметра_АУКЦИОН_НАЧАЛЬНЫЕ_ДАННЫЕ_УЧАСТНИКА(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "УЧАСТНИК_НАИМЕНОВАНИЕ" Тогда
			
			ДобавитьЗначениеПараметра_УЧАСТНИК_НАИМЕНОВАНИЕ(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ФИО" Тогда
			
			ДобавитьЗначениеПараметра_УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ФИО(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ФАМИЛИЯ_ИО" Тогда
			
			ДобавитьЗначениеПараметра_УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ФАМИЛИЯ_ИО(сооРезультат, ПараметрИмя, пСткДанные);
			
		ИначеЕсли ПараметрИмя = "УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ИМЯ" Тогда
			
			ДобавитьЗначениеПараметра_УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ИМЯ(сооРезультат, ПараметрИмя, пСткДанные);	
			
		КонецЕсли;
	КонецЦикла;	
	
	Возврат сооРезультат;	
КонецФункции

Процедура ДобавитьЗначениеПараметра_АУКЦИОН_ССЫЛКА(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	пСооРезультат.Вставить(пСтрПараметрИмя, ПолучитьВнешнююНавигационнуюСсылку(ПолучитьНавигационнуюСсылкуИнформационнойБазы(), ПолучитьНавигационнуюСсылку(пСткДанные.Аукцион)));
КонецПроцедуры

// По сути это время изменения статуса на "Отменено" (Период записи в РС АукИсторияСтатусовАукционов)
//
Процедура ДобавитьЗначениеПараметра_АУКЦИОН_ВРЕМЯ_ОТКАЗА_ОТ_ПРОДОЛЖЕНИЯ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	ВремяОтказа = РегистрыСведений.АукИсторияСтатусовАукционов.ВремяОтказаОтПродолженияАукциона(пСткДанные.Аукцион);
	
	Если ВремяОтказа = Неопределено Тогда
		стрВремяОтказа = "Аукцион не был завершен";	
	Иначе
		стрВремяОтказа = СтрШаблон(НСтр("ru = '%1 (GMT+10, Владивосток)'"), Формат(ВремяОтказа, "ДФ=dd.MM.yyyy HH:mm; ДЛФ=DT"));	
	КонецЕсли;	
	
	пСооРезультат.Вставить(пСтрПараметрИмя, стрВремяОтказа);
КонецПроцедуры

Процедура ДобавитьЗначениеПараметра_АУКЦИОН_НАЧАЛЬНЫЕ_ДАННЫЕ_ВСЕХ_УЧАСТНИКОВ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	Если Не пСткДанные.Свойство("КлючевыеДанные") Тогда
		пСткДанные.Вставить("КлючевыеДанные", Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанные.Аукцион));			
	КонецЕсли;	
	
	пСооРезультат.Вставить(пСтрПараметрИмя, ОписаниеНачальныхДанных(пСткДанные.Аукцион, пСткДанные.КлючевыеДанные.ВидАукциона));	
КонецПроцедуры

Функция ОписаниеНачальныхДанных(пАукцион, пВидАукциона, пУчастник = Неопределено)
	РезультатЗапроса = Справочники.АукАукционы.ЗначенияНачальныхДанныхСГруппировками(пАукцион, пВидАукциона, пУчастник);
	
	ВыборкаУчастник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	булОдинУчастник = (ВыборкаУчастник.Количество() = 1);
	
	масИтог = Новый Массив;
	СчУчастник = 1;
	Пока ВыборкаУчастник.Следующий() Цикл
		масНачДанныеУчастника = Новый Массив;
		
		Если Не булОдинУчастник Тогда
			масНачДанныеУчастника.Добавить(СтрШаблон(НСтр("ru = '%1.	%2'"), СчУчастник, ВыборкаУчастник.Участник));	
		КонецЕсли;
		
		ВыборкаСтрокаДанных = ВыборкаУчастник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		булОднаСтрокаДанных = (ВыборкаСтрокаДанных.Количество() = 0);
		
		Пока ВыборкаСтрокаДанных.Следующий() Цикл
			
			ВыборкаДетальныеЗаписи = ВыборкаСтрокаДанных.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗначениеЭлементаДанных) Тогда
					стрЗначение = Формат(ВыборкаДетальныеЗаписи.ЗначениеЭлементаДанных, "ЧРГ=.; ЧГ=3,0");	
				Иначе
					стрЗначение = НСтр("ru = '<Не задано>'");	
				КонецЕсли;	 
				
				масНачДанныеУчастника.Добавить(СтрШаблон(НСтр("ru = '    ""%1"" = %2'"), ВыборкаДетальныеЗаписи.ЭлементДанныхПредставление, стрЗначение));	
			КонецЦикла;	
			
		КонецЦикла;	
		
		СчУчастник = СчУчастник + 1;
		
		масИтог.Добавить(СтрСоединить(масНачДанныеУчастника, Символы.ПС));
	КонецЦикла;
	
	Возврат СтрСоединить(масИтог, Символы.ПС + Символы.ПС);
КонецФункции

Процедура ДобавитьЗначениеПараметра_АУКЦИОН_ДАННЫЕ_ПРОМЕЖУТОЧНОГО_ПОБЕДИТЕЛЯ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	Если Не пСткДанные.Свойство("КлючевыеДанные") Тогда
		пСткДанные.Вставить("КлючевыеДанные", Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанные.Аукцион));			
	КонецЕсли;
	
	Если Не пСткДанные.Свойство("КлючевыеДанныеВидаАукциона") Тогда 	
		пСткДанные.Вставить("КлючевыеДанныеВидаАукциона", Справочники.АукВидыАукционов.КлючевыеДанныеВидаАукциона(пСткДанные.КлючевыеДанные.ВидАукциона));			
	КонецЕсли;
	
	ЗначениеПараметра = пСооРезультат.Получить(пСтрПараметрИмя);
	
	Если ЗначениеПараметра = Неопределено Тогда
		Если Не пСткДанные.Свойство("ТекущееСостояниеАукциона") Тогда
			пСткДанные.Вставить("ТекущееСостояниеАукциона", РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанные.Аукцион));			
		КонецЕсли;
		
		сткПараметры = Новый Структура;
		сткПараметры.Вставить("Аукцион",	пСткДанные.Аукцион);
		сткПараметры.Вставить("НомерЭтапа",	пСткДанные.ТекущееСостояниеАукциона.НомерЭтапа);
		
		Если Не АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
			пСооРезультат.Вставить(пСтрПараметрИмя, РегистрыСведений.АукИтогиЗавершенияЭтапов.ИтоговоеЗначениеЛидирующейСтавки(сткПараметры));
		Иначе
			чслРезультат = РегистрыСведений.АукРасчетИтоговРезультаты.РезультатПромежуточногоПобедителя(пСткДанные.Аукцион, пСткДанные.ТекущееСостояниеАукциона.НомерЭтапа);
			
			пСооРезультат.Вставить(пСтрПараметрИмя, Справочники.АукНастройкиРасчетовИтогов.ПредставлениеРезультатаПоШаблонуВНастройке(
											пСткДанные.КлючевыеДанныеВидаАукциона.НастройкаРасчетаПромежуточныхИтогов, Формат(чслРезультат, "ЧГ=0")));	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьЗначениеПараметра_АУКЦИОН_СТРУКТУРА_СТАВКИ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	ЗначениеПараметра = пСооРезультат.Получить(пСтрПараметрИмя);
	
	Если ЗначениеПараметра = Неопределено Тогда
		Если Не пСткДанные.Свойство("СтруктураСтавки") Тогда
			Если Не пСткДанные.Свойство("КлючевыеДанные") Тогда
				пСткДанные.Вставить("КлючевыеДанные", Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанные.Аукцион));			
			КонецЕсли; 
			
			пСткДанные.Вставить("СтруктураСтавки", Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(пСткДанные.КлючевыеДанные.ВидАукциона));			
		КонецЕсли;
		
		// Структура ставки состоит из двух блоков: обязательные поля и необязательные поля
		сооДетальнаяСтруктура = Новый Соответствие;
			
		сооДетальнаяСтруктура.Вставить("АУКЦИОН_СТРУКТУРА_СТАВКИ_ОБЯЗАТЕЛЬНЫЕ_ПОЛЯ", ОписаниеЭлементовСтавки(пСткДанные.СтруктураСтавки, Истина));
		
		сооДетальнаяСтруктура.Вставить("АУКЦИОН_СТРУКТУРА_СТАВКИ_НЕ_ОБЯЗАТЕЛЬНЫЕ_ПОЛЯ", ОписаниеЭлементовСтавки(пСткДанные.СтруктураСтавки, Ложь));
			
		пСооРезультат.Вставить(пСтрПараметрИмя, сооДетальнаяСтруктура);
	КонецЕсли;
КонецПроцедуры

Функция ОписаниеЭлементовСтавки(пМасСтруктураСтавки, пБулОбязательныеПоля)
	масПоля = Новый Массив;
	
	масПоля.Добавить(СтрШаблон(НСтр("ru = '%1:'"), ?(пБулОбязательныеПоля, "Обязательные поля ставки", "Необязательные поля ставки")));
	
	НПП = 1;
	Для Каждого ЭлементСтавки Из пМасСтруктураСтавки Цикл
		Если пБулОбязательныеПоля И ЭлементСтавки.НеОбязательный Тогда
			Продолжить;	
		ИначеЕсли Не пБулОбязательныеПоля И Не ЭлементСтавки.НеОбязательный Тогда	
			Продолжить;	
		КонецЕсли;
		
		ТипЗначенияЭлементаСтавки = ЭлементСтавки.ТипЗначения.Типы()[0];
		
		Если ОбщегоНазначения.ЭтоСсылка(ТипЗначенияЭлементаСтавки) Тогда
			масЗначения = Справочники.АукДопЭлементыДанныхАукционов.ЗначенияЭлементовДанныхПоКоличеству(ЭлементСтавки.Элемент);
			
			стрОкончание = СтрШаблон(НСтр("ru = 'Значение из списка: %1'"), СтрСоединить(масЗначения, ", "));	
		Иначе	
			стрОкончание = ТипЗначенияЭлементаСтавки;	
		КонецЕсли;
		
		масПоля.Добавить(СтрШаблон(НСтр("ru = '%1. ""%2"". %3.'"), НПП, ЭлементСтавки.ЭлементПредставление, стрОкончание));
		
		НПП = НПП + 1;
	КонецЦикла;
	
	Возврат СтрСоединить(масПоля, Символы.ПС);
КонецФункции

Процедура ДобавитьЗначениеПараметра_АУКЦИОН_ПЛАНИРУЕМОЕ_ВРЕМЯ_ЗАВЕРШЕНИЯ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	ЗначениеПараметра = пСооРезультат.Получить(пСтрПараметрИмя);
	
	Если ЗначениеПараметра = Неопределено Тогда
		ПланируемоеВремяЗавершения = Справочники.АукАукционы.ПланируемоеВремяЗавершения(пСткДанные.Аукцион);
		
		пСооРезультат.Вставить(пСтрПараметрИмя, СтрШаблон(НСтр("ru = '%1 (GMT+10, Владивосток)'"), Формат(ПланируемоеВремяЗавершения, "ДФ=dd.MM.yyyy HH:mm; ДЛФ=DT")));
	КонецЕсли;
КонецПроцедуры

// [АУКЦИОН_ЭТАПЫ]
// Состоит из трёх переменных:
//	[АУКЦИОН_ТЕКУЩИЙ_ЭТАП] + [АУКЦИОН_ВСЕГО_ЭТАПОВ] + [ПРОДОЛЖИТЕЛЬНОСТЬ_ЭТАПА]
// Детально:
//	[АУКЦИОН_ТЕКУЩИЙ_ЭТАП] - данные РС АукИсторияСтатусовАукционов
//	[АУКЦИОН_ВСЕГО_ЭТАПОВ] и [ПРОДОЛЖИТЕЛЬНОСТЬ_ЭТАПА] - данные ТЧ Этапы справочника АукАукционы
// Примеры:
//	Этап 1 из 3. Предполагаемая продолжительность: 25 мин.
//	Этап 2 из 3. Предполагаемая продолжительность: 1 час 05 мин.
//	Этап 3 из 3. Предполагаемая продолжительность: 1 день 2 часа 30 мин.
//
Процедура ДобавитьЗначениеПараметра_АУКЦИОН_ЭТАПЫ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	ДобавитьЗначениеПараметра_АУКЦИОН_ВСЕГО_ЭТАПОВ(пСооРезультат, "АУКЦИОН_ВСЕГО_ЭТАПОВ", пСткДанные);	
	
	ДобавитьЗначениеПараметра_АУКЦИОН_ТЕКУЩИЙ_ЭТАП(пСооРезультат, "АУКЦИОН_ТЕКУЩИЙ_ЭТАП", пСткДанные);	
	
	////////////
	масПродолжительностьЭтапов = Новый Массив;
	чслВсегоЭтапов = пСткДанные.Этапы.Количество();
	НомерЭтапа = 1;
	Для Каждого ЭлЭтап Из пСткДанные.Этапы Цикл	
		масВремяСтрокой = Новый Массив;
		
		Если ЭлЭтап.ДлительностьДни > 0 Тогда
			масВремяСтрокой.Добавить(СтрокаСЧислом(";%1 день;;%1 дня;%1 дней;%1 дня", ЭлЭтап.ДлительностьДни,
													ВидЧисловогоЗначения.Количественное, "Л=ru"));
		КонецЕсли;
		
		Если Час(ЭлЭтап.ДлительностьЧасы) > 0 Тогда
			масВремяСтрокой.Добавить(СтрокаСЧислом(";%1 час;;%1 часа;%1 часов;%1 часа", Час(ЭлЭтап.ДлительностьЧасы),
													ВидЧисловогоЗначения.Количественное, "Л=ru"));	
		КонецЕсли;
		
		масВремяСтрокой.Добавить(СтрокаСЧислом(";%1 минута;;%1 минуты;%1 минут;%1 минуты", Минута(ЭлЭтап.ДлительностьЧасы - Час(ЭлЭтап.ДлительностьЧасы) * 3600),
													ВидЧисловогоЗначения.Количественное, "Л=ru; ЧЦ=2; ЧН=0; ЧВН="));
																								
		стрПродолжительностьЭтапа = СтрШаблон(НСтр("ru = 'Этап %1 из %2. Предполагаемая продолжительность: %3.'"), НомерЭтапа, чслВсегоЭтапов, СтрСоединить(масВремяСтрокой, " "));											
		
		масПродолжительностьЭтапов.Добавить(стрПродолжительностьЭтапа);
		
		НомерЭтапа = НомерЭтапа + 1;											
	КонецЦикла;
	
	пСооРезультат.Вставить(пСтрПараметрИмя, СтрСоединить(масПродолжительностьЭтапов, Символы.ПС));
КонецПроцедуры

Процедура ДобавитьЗначениеПараметра_АУКЦИОН_ТЕКУЩИЙ_ЭТАП(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	ЗначениеПараметра = пСооРезультат.Получить(пСтрПараметрИмя);
	
	Если ЗначениеПараметра = Неопределено Тогда 
		Если Не пСткДанные.Свойство("ТекущееСостояниеАукциона") Тогда
			пСткДанные.Вставить("ТекущееСостояниеАукциона", РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанные.Аукцион));			
		КонецЕсли;
		
		пСооРезультат.Вставить(пСтрПараметрИмя, Формат(пСткДанные.ТекущееСостояниеАукциона.НомерЭтапа, "ЧГ=0"));
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьЗначениеПараметра_АУКЦИОН_ВСЕГО_ЭТАПОВ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	ЗначениеПараметра = пСооРезультат.Получить(пСтрПараметрИмя);
	
	Если ЗначениеПараметра = Неопределено Тогда
		Если Не пСткДанные.Свойство("Этапы") Тогда
			пСткДанные.Вставить("Этапы", Справочники.АукАукционы.ЭтапыАукциона(пСткДанные.Аукцион, Истина));			
		КонецЕсли;
		
		пСооРезультат.Вставить(пСтрПараметрИмя, Формат(пСткДанные.Этапы.Количество(), "ЧГ=0"));
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьЗначениеПараметра_АУКЦИОН_КОД(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	Если Не пСткДанные.Свойство("КлючевыеДанные") Тогда
		пСткДанные.Вставить("КлючевыеДанные", Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанные.Аукцион));			
	КонецЕсли;
	
	пСооРезультат.Вставить(пСтрПараметрИмя, пСткДанные.КлючевыеДанные.Код);	
КонецПроцедуры

Процедура ДобавитьЗначениеПараметра_АУКЦИОН_НАИМЕНОВАНИЕ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	Если Не пСткДанные.Свойство("КлючевыеДанные") Тогда
		пСткДанные.Вставить("КлючевыеДанные", Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанные.Аукцион));			
	КонецЕсли;
	
	пСооРезультат.Вставить(пСтрПараметрИмя, пСткДанные.КлючевыеДанные.Наименование);	
КонецПроцедуры	

// Индивидуальные

// Обязательно должен быть заполнен период (дата записи)
//
Процедура ДобавитьЗначениеПараметра_СТАВКА_ВРЕМЯ_ПРИНЯТИЯ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	ЗначениеПараметра = пСооРезультат.Получить(пСтрПараметрИмя);
	
	Если ЗначениеПараметра = Неопределено Тогда
		Если пСткДанные.Свойство("Период") Тогда 	
			пСооРезультат.Вставить(пСтрПараметрИмя, СтрШаблон(НСтр("ru = '%1 (GMT+10, Владивосток)'"), Формат(пСткДанные.Период, "ДФ=dd.MM.yyyy HH:mm; ДЛФ=DT")));
		Иначе
			пСооРезультат.Вставить(пСтрПараметрИмя, "---");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Обязательно должен быть заполнен Период, Участник, КонтактноеЛицо
//
Процедура ДобавитьЗначениеПараметра_СТАВКА_ДАННЫЕ_СТАВКИ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	ЗначениеПараметра = пСооРезультат.Получить(пСтрПараметрИмя);
	
	Если ЗначениеПараметра = Неопределено Тогда
		масДанныеСтавки = РегистрыСведений.АукИсторияДанныхАукционов.ДанныеСтавкиУчастника(пСткДанные);	
		
		чслКоличествоЗаписейСтавки = масДанныеСтавки.Количество(); 
		
		масИтог = Новый Массив;
		Для Сч = 0 По чслКоличествоЗаписейСтавки - 1 Цикл
			масСтрокаСтавки = Новый Массив;
			
			Если чслКоличествоЗаписейСтавки > 1 Тогда 
				масСтрокаСтавки.Добавить(СтрШаблон(НСтр("ru = 'Запись №%1'"), Сч + 1));
			КонецЕсли;
			
			сооСтрокаСтавки = масДанныеСтавки[Сч];
			
			НПП = 1;
			Для Каждого ЭлСоо Из сооСтрокаСтавки Цикл
				
				Если ЗначениеЗаполнено(ЭлСоо.Значение) Тогда
					стрЗначение = Формат(ЭлСоо.Значение, "ЧРГ=.; ЧГ=3,0");	
				Иначе
					стрЗначение = НСтр("ru = 'Значение не указано'");	
				КонецЕсли;	 
				
				масСтрокаСтавки.Добавить(СтрШаблон(НСтр("ru = '    %1. ""%2"" = %3.'"), НПП, ЭлСоо.Ключ, стрЗначение));
				
				НПП = НПП + 1;
			КонецЦикла;
			
			масИтог.Добавить(СтрСоединить(масСтрокаСтавки, Символы.ПС));
		КонецЦикла;
		
		пСооРезультат.Вставить(пСтрПараметрИмя, СтрСоединить(масИтог, Символы.ПС + Символы.ПС));
	КонецЕсли;
КонецПроцедуры

// Обязательно должен быть заполнен Период
//
Процедура ДобавитьЗначениеПараметра_ОТКАЗ_ВРЕМЯ_ПРИНЯТИЯ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	ЗначениеПараметра = пСооРезультат.Получить(пСтрПараметрИмя);
	
	Если ЗначениеПараметра = Неопределено Тогда
		Если пСткДанные.Свойство("Период") Тогда
			пСооРезультат.Вставить(пСтрПараметрИмя, СтрШаблон(НСтр("ru = '%1 (GMT+10, Владивосток)'"), Формат(пСткДанные.Период, "ДФ=dd.MM.yyyy HH:mm; ДЛФ=DT")));
		Иначе
			пСооРезультат.Вставить(пСтрПараметрИмя, "---");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Обязательно должен быть заполнен Участник и Строка данных
//
Процедура ДобавитьЗначениеПараметра_СТАВКА_ДАННЫЕ_ПОБЕДНОЙ_СТАВКИ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	Если Не пСткДанные.Свойство("КлючевыеДанные") Тогда
		пСткДанные.Вставить("КлючевыеДанные", Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанные.Аукцион));			
	КонецЕсли;
	
	ЗначениеПараметра = пСооРезультат.Получить(пСтрПараметрИмя);
	
	Если ЗначениеПараметра = Неопределено Тогда
		Если Не АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
			масДанныеПобеднойСтавки = РегистрыСведений.АукДанныеТаблицПодведенияИтогов.ДанныеСтавкиПобедителя(пСткДанные);
			
			масДанныеСтавкиСтрокой = Новый Массив;
			Для Сч = 0 По масДанныеПобеднойСтавки.ВГраница() Цикл
				Если ЗначениеЗаполнено(масДанныеПобеднойСтавки[Сч].ЗначениеЭлементаДанных) Тогда
					стрЗначение = Формат(масДанныеПобеднойСтавки[Сч].ЗначениеЭлементаДанных, "ЧРГ=.; ЧГ=3,0");	
				Иначе
					стрЗначение = НСтр("ru = 'Значение не указано'");	
				КонецЕсли;	 
				
				масДанныеСтавкиСтрокой.Добавить(СтрШаблон(НСтр("ru = '    %1. ""%2"" = %3.'"), Сч + 1, масДанныеПобеднойСтавки[Сч].ЭлементДанныхПредставление, стрЗначение));
				
			КонецЦикла;
			
			пСооРезультат.Вставить(пСтрПараметрИмя, СтрСоединить(масДанныеСтавкиСтрокой, Символы.ПС));
		Иначе			
			масДанныеПобеднойСтавки = РегистрыСведений.АукРасчетИтоговРезультаты.ДанныеСтавкиПобедителя(пСткДанные);
			
			масДанныеСтавкиСтрокой = Новый Массив;
			Для Сч = 0 По масДанныеПобеднойСтавки.ВГраница() Цикл
				Если ЗначениеЗаполнено(масДанныеПобеднойСтавки[Сч].ЗначениеЭлементаДанных) Тогда
					стрЗначение = Формат(масДанныеПобеднойСтавки[Сч].ЗначениеЭлементаДанных, "ЧРГ=.; ЧГ=3,0");	
				Иначе
					стрЗначение = НСтр("ru = 'Значение не указано'");	
				КонецЕсли;	 
				
				масДанныеСтавкиСтрокой.Добавить(СтрШаблон(НСтр("ru = '    %1. ""%2"" = %3.'"), Сч + 1, масДанныеПобеднойСтавки[Сч].ЭлементДанныхПредставление, стрЗначение));
				
			КонецЦикла;
			
			пСооРезультат.Вставить(пСтрПараметрИмя, СтрСоединить(масДанныеСтавкиСтрокой, Символы.ПС));	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Обязательно должен быть заполнен Участник
//
Процедура ДобавитьЗначениеПараметра_АУКЦИОН_НАЧАЛЬНЫЕ_ДАННЫЕ_УЧАСТНИКА(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	Если Не пСткДанные.Свойство("КлючевыеДанные") Тогда
		пСткДанные.Вставить("КлючевыеДанные", Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанные.Аукцион));			
	КонецЕсли; 
	
	Если пСткДанные.Свойство("Участник") Тогда 
		пСооРезультат.Вставить(пСтрПараметрИмя, ОписаниеНачальныхДанных(пСткДанные.Аукцион, пСткДанные.КлючевыеДанные.ВидАукциона, пСткДанные.Участник));
	Иначе
		пСооРезультат.Вставить(пСтрПараметрИмя, "---");	
	КонецЕсли;
КонецПроцедуры

// Обязательно должен быть заполнен Участник
//
Процедура ДобавитьЗначениеПараметра_УЧАСТНИК_НАИМЕНОВАНИЕ(пСооРезультат, пСтрПараметрИмя, пСткДанные)	
	Если пСткДанные.Свойство("Участник") Тогда
		пСооРезультат.Вставить(пСтрПараметрИмя, Справочники.АукУчастникиАукционов.ДанныеУчастникаПоСсылке(пСткДанные.Участник).Наименование);
	Иначе
		пСооРезультат.Вставить(пСтрПараметрИмя, "---");	
	КонецЕсли;
КонецПроцедуры

// Обязательно должно быть заполнено КонтактноеЛицо
//
Процедура ДобавитьЗначениеПараметра_УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ФИО(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	Если пСткДанные.Свойство("КонтактноеЛицо") Тогда
		пСооРезультат.Вставить(пСтрПараметрИмя, Справочники.АукКонтактныеЛицаУчастниковАукционов.ФамилияИмяОтчествоКонтактногоЛица(пСткДанные.КонтактноеЛицо));
	Иначе
		пСооРезультат.Вставить(пСтрПараметрИмя, "---");	
	КонецЕсли;
КонецПроцедуры

// Обязательно должно быть заполнено КонтактноеЛицо
//
Процедура ДобавитьЗначениеПараметра_УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ФАМИЛИЯ_ИО(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	Если пСткДанные.Свойство("КонтактноеЛицо") Тогда
		пСооРезультат.Вставить(пСтрПараметрИмя, Справочники.АукКонтактныеЛицаУчастниковАукционов.ФамилияИИнициалыКонтактногоЛица(пСткДанные.КонтактноеЛицо));
	Иначе
		пСооРезультат.Вставить(пСтрПараметрИмя, "---");	
	КонецЕсли;
КонецПроцедуры

// Обязательно должно быть заполнено КонтактноеЛицо
//
Процедура ДобавитьЗначениеПараметра_УЧАСТНИК_КОНТАКТНОЕ_ЛИЦО_ИМЯ(пСооРезультат, пСтрПараметрИмя, пСткДанные)
	Если пСткДанные.Свойство("КонтактноеЛицо") Тогда
		пСооРезультат.Вставить(пСтрПараметрИмя, Справочники.АукКонтактныеЛицаУчастниковАукционов.ДанныеКонтактногоЛица(пСткДанные.КонтактноеЛицо).Имя);
	Иначе
		пСооРезультат.Вставить(пСтрПараметрИмя, "---");	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

