
#Область ПрограммныйИнтерфейс

// Фоновое №1. По выполнению команд
Процедура КонтрольВыполненияКоманд() Экспорт
	
	ПроизвестиКонтрольДанныхИВыполнитьКоманды();
		
КонецПроцедуры	

// Фоновое №2. Контроллер событий 
Процедура КонтрольСостоянияАукционов() Экспорт
	
	ПроизвестиКонтрольСостоянияАукционов();	
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроизвестиКонтрольДанныхИВыполнитьКоманды()
	
	масКомандыОжидающиеВыполнения = РегистрыСведений.АукИсторияКомандАукционов.КомандыОжидающиеВыполненияВАвтоматическомРежиме();
	
	Для Каждого сткДанныеКоманды Из масКомандыОжидающиеВыполнения Цикл
		
		ПроизвестиКонтрольДанныхИВыполнитьКоманду(сткДанныеКоманды);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроизвестиКонтрольСостоянияАукционов()

	масАукционы = АукционыОжидающиеДействия();
	
	Для Каждого сткЭлАукцион Из масАукционы Цикл
		
		НачатьПодготовкуКВыполнениюДействийСАукционами(сткЭлАукцион);
		
	КонецЦикла;
	
КонецПроцедуры

Функция АукционыОжидающиеДействия()
	
	ТекДата = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_();
	
	масАукционы = Новый Массив;
	
	масРезультат = Справочники.АукАукционы.АукционыОжидающиеДействия_НачатьАукцион(ТекДата);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масАукционы, масРезультат);
	
	масРезультат = Справочники.АукАукционы.АукционыОжидающиеДействия_ПерейтиКПодведениюПромежуточныхИтогов(ТекДата);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масАукционы, масРезультат);
	
	масРезультат = Справочники.АукАукционы.АукционыОжидающиеДействия_ПодвестиПромежуточныеИтоги(ТекДата);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масАукционы, масРезультат);
	
	масРезультат = Справочники.АукАукционы.АукционыОжидающиеДействия_ПерейтиКПодведениюИтогов(ТекДата);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масАукционы, масРезультат);
	
	масРезультат = Справочники.АукАукционы.АукционыОжидающиеДействия_ПодвестиИтогиАукциона(ТекДата);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масАукционы, масРезультат);
	
	Возврат масАукционы;
	
КонецФункции	

Процедура НачатьПодготовкуКВыполнениюДействийСАукционами(пСткДанные)
	
	// Ошибка может возникнуть только с записью в БД. логируем в грейлог
	Попытка
		
		Если пСткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.АвтоПроверкаНачатьАукцион") Тогда
			
			АвтоПроверкаНачатьАукцион_СозданиеКоманды(пСткДанные);
			
		ИначеЕсли пСткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов") Тогда 
			
			АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_СозданиеКоманды(пСткДанные);
			
		ИначеЕсли пСткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.АвтоПроверкаПодвестиПромежуточныеИтоги") Тогда 
			
			АвтоПроверкаПодвестиПромежуточныеИтоги_СозданиеКоманды(пСткДанные);
			
		ИначеЕсли пСткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.АвтоПроверкаПерейтиКПодведениюИтогов") Тогда
			
			АвтоПроверкаПерейтиКПодведениюИтогов_СозданиеКоманды(пСткДанные);
			
		ИначеЕсли пСткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.АвтоПроверкаПодвестиИтогиАукциона") Тогда
			
			АвтоПроверкаПодвестиИтогиАукциона_СозданиеКоманды(пСткДанные);	
			
		КонецЕсли;	
		
	Исключение
		
		стрОшибка = ОписаниеОшибки();
		
		АукОбщийКлиентСервер.ОтправитьСообщениеВГрейлог(стрОшибка, "Фоновое.НачатьПодготовкуКВыполнениюДействийСАукционами");
		
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеКоманд

#Область АвтоПроверкаНачатьАукцион

// Создание команды "Проверить возможность начала аукциона". Эта команда только в автоматическом режиме!
//
// Параметры:
//  пСткПараметры
//	 Обзязательно:
//		*Аукцион				- Справочник.АукАукционы
//		*Команда 				- Перечисление.АукКоманды
//
Процедура АвтоПроверкаНачатьАукцион_СозданиеКоманды(пСткПараметры) Экспорт	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Автоматическая = Истина;
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",				пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",				пСткПараметры.Команда);
	
	сткДанные.Вставить("Данные",			АвтоПроверкаНачатьАукцион_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);		
КонецПроцедуры

Функция АвтоПроверкаНачатьАукцион_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

#КонецОбласти

#Область НачатьАукцион

// Создание команды "Начать аукцион" 
//
// Параметры:
//  пСткПараметры	
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//
Процедура НачатьАукцион_СозданиеКоманды(пСткПараметры) Экспорт	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.НачатьАукцион");
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",		пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",		сткДанные.Команда);
	
	сткДанные.Вставить("Данные",			НачатьАукцион_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецПроцедуры

Функция НачатьАукцион_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

#КонецОбласти

#Область АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов

// Создание команды "Проверка возможности выполнить переход к подведению промежуточных итогов текущего этапа аукциона". Эта команда только в автоматическом режиме! 
//
// Параметры:
//  пСткПараметры	
//	 Обзязательно:
//		*Аукцион			- Справочник.АукАукционы 
//		*Команда 			- Перечисление.АукКоманды
//		*НомерЭтапа 		- Число
//
Процедура АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_СозданиеКоманды(пСткПараметры) Экспорт	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Автоматическая = Истина;
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",			пСткПараметры.Команда);
	сткПараметрыДанныхJSON.Вставить("НомерЭтапа",		пСткПараметры.НомерЭтапа);
	
	сткДанные.Вставить("Данные",			АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);	
КонецПроцедуры

Функция АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	//сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	сткРезДанные.required_data = АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)

	сткРезультат = АукОбщийКлиентСервер.СтруктураПоМассивуИмен(АукУправлениеАукционамиКлиентСервер.АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.stage_number				= пСткПараметрыДанныхJSON.НомерЭтапа;
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти

#Область ПерейтиКПодведениюПромежуточныхИтогов

// Создание команды "Переход к подведению промежуточных итогов текущего этапа аукциона"
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки 
//		*НомерЭтапа 		- Число
//	  Опциональные:
//		*КлючРодителя		- Справочник.КлючиУникальности
// 
// Возвращаемое значение:
//   Структура
//		*Успех - Булево
//		*Результат - Произвольно. Если Успех = Ложь, то Результат - Строка - Описание ошибки
//								  Если Успех = Истина, то Результат - Справочник.КлючиУникальности  
//
Процедура ПерейтиКПодведениюПромежуточныхИтогов_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры); 
	
	сткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.ПерейтиКПодведениюПромежуточныхИтогов"); 	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",		пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",		сткДанные.Команда);
	сткПараметрыДанныхJSON.Вставить("НомерЭтапа",	пСткПараметры.НомерЭтапа);
	
	сткДанные.Вставить("Данные",			ПерейтиКПодведениюПромежуточныхИтогов_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецПроцедуры

Функция ПерейтиКПодведениюПромежуточныхИтогов_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	//сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	сткРезДанные.required_data = ПерейтиКПодведениюПромежуточныхИтогов_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция ПерейтиКПодведениюПромежуточныхИтогов_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)

	сткРезультат = АукОбщийКлиентСервер.СтруктураПоМассивуИмен(АукУправлениеАукционамиКлиентСервер.ПерейтиКПодведениюПромежуточныхИтогов_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.stage_number				= пСткПараметрыДанныхJSON.НомерЭтапа;
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти

#Область АвтоПроверкаПодвестиПромежуточныеИтоги

// Создание команды "Проверить возможность подведения промежуточных итогов". Эта команда только в автоматическом режиме! 
//
// Параметры:
//  пСткПараметры	
//	 Обзязательно:
//		*Аукцион				- Справочник.АукАукционы 
//		*Команда 				- Перечисление.АукКоманды
//
Процедура АвтоПроверкаПодвестиПромежуточныеИтоги_СозданиеКоманды(пСткПараметры) Экспорт	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Автоматическая = Истина;
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",				пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",				пСткПараметры.Команда);
	
	сткДанные.Вставить("Данные",			АвтоПроверкаПодвестиПромежуточныеИтоги_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);	
КонецПроцедуры

Функция АвтоПроверкаПодвестиПромежуточныеИтоги_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

#КонецОбласти

#Область РассчитатьПромежуточныеИтоги

// Создание команды "Рассчет промежуточных итогов и определение промежуточного победителя". Эта команда только для автоматического режима!
// Эта команда аналог выбора победителя пользователем на форме подведения промежуточных итогов
//
// Параметры:
//  пСткПараметры
//	  Обязательные: 
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//	  Опциональные:
//		*КлючРодителя		- Справочник.КлючиУникальности
//
Процедура РассчитатьПромежуточныеИтоги_СозданиеКоманды(пСткПараметры) Экспорт		
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.РассчитатьПромежуточныеИтоги");
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",				пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",				сткДанные.Команда);
	
	сткДанные.Вставить("Данные",			РассчитатьПромежуточныеИтоги_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
КонецПроцедуры

Функция РассчитатьПромежуточныеИтоги_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

#КонецОбласти

#Область ЗафиксироватьПромежуточныеИтоги
 
// Создание команды "Зафиксировать промежуточные итоги" 
//
// Параметры:
//  пСткПараметры
//	  Обязательные: 
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//	  Опциональные:
//		*КлючРодителя		- Справочник.КлючиУникальности
//
Процедура ЗафиксироватьПромежуточныеИтоги_СозданиеКоманды(пСткПараметры) Экспорт	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.АукКоманды.ЗафиксироватьПромежуточныеИтоги");	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Команда",			сткДанные.Команда);
	сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
	
	сткДанные.Вставить("Данные",			ЗафиксироватьПромежуточныеИтоги_ДанныеСтрокой(сткПараметрыДанныхJSON));
			
	// 2. Записать команды в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецПроцедуры	

Функция ЗафиксироватьПромежуточныеИтоги_ДанныеСтрокой(пСткПараметрыДанныхJSON)	
	сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);	
КонецФункции
 
#КонецОбласти
 
#Область АвтоПроверкаПерейтиКПодведениюИтогов

// Создание команды "Проверка возможности выполнить переход к подведению итогов аукциона". Эта команда только в автоматическом режиме! 
//
// Параметры:
//  пСткПараметры	
//	 Обзязательно:
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*Команда 			- Перечисление.АукКоманды
//		*НомерЭтапа 		- Число
//	 Опционально:
//		*ТребуетсяОповещение	- Булево
//
Процедура АвтоПроверкаПерейтиКПодведениюИтогов_СозданиеКоманды(пСткПараметры) Экспорт	
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Автоматическая = Истина;
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",			пСткПараметры.Команда);
	сткПараметрыДанныхJSON.Вставить("НомерЭтапа",		пСткПараметры.НомерЭтапа);
	
	сткДанные.Вставить("Данные",			АвтоПроверкаПерейтиКПодведениюИтогов_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);	
КонецПроцедуры

Функция АвтоПроверкаПерейтиКПодведениюИтогов_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	//сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	сткРезДанные.required_data = АвтоПроверкаПерейтиКПодведениюИтогов_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция АвтоПроверкаПерейтиКПодведениюИтогов_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)

	сткРезультат = АукОбщийКлиентСервер.СтруктураПоМассивуИмен(АукУправлениеАукционамиКлиентСервер.АвтоПроверкаПерейтиКПодведениюИтогов_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.stage_number				= пСткПараметрыДанныхJSON.НомерЭтапа;
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти

#Область ПерейтиКПодведениюИтогов

// Создание команды "Переход к подведению итогов аукциона"
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*НомерЭтапа 		- Число
//	  Опциональные:
//		*КлючРодителя		- Справочник.КлючиУникальности
// 
// Возвращаемое значение:
//   Структура
//		*Успех - Булево
//		*Результат - Произвольно. Если Успех = Ложь, то Результат - Строка - Описание ошибки
//								  Если Успех = Истина, то Результат - Справочник.КлючиУникальности  
//
Процедура ПерейтиКПодведениюИтогов_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры); 
	
	сткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.ПерейтиКПодведениюИтогов"); 	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",		пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",		сткДанные.Команда);
	сткПараметрыДанныхJSON.Вставить("НомерЭтапа",	пСткПараметры.НомерЭтапа);
	
	сткДанные.Вставить("Данные",			ПерейтиКПодведениюИтогов_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецПроцедуры

Функция ПерейтиКПодведениюИтогов_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	//сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	сткРезДанные.required_data = ПерейтиКПодведениюИтогов_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция ПерейтиКПодведениюИтогов_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)

	сткРезультат = АукОбщийКлиентСервер.СтруктураПоМассивуИмен(АукУправлениеАукционамиКлиентСервер.ПерейтиКПодведениюИтогов_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.stage_number				= пСткПараметрыДанныхJSON.НомерЭтапа;
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти

#Область АвтоПроверкаПодвестиИтогиАукциона

// Создание команды "Проверка возможности подведения итогов аукциона". Эта команда только в автоматическом режиме!
//
// Параметры:
//  пСткПараметры
//	 Обзязательно:
//		*Аукцион				- Справочник.АукАукционы
//		*Команда 				- Перечисление.АукКоманды
//
Функция АвтоПроверкаПодвестиИтогиАукциона_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Автоматическая = Истина;
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",			пСткПараметры.Команда);
	сткПараметрыДанныхJSON.Вставить("НомерЭтапа",		пСткПараметры.НомерЭтапа);
	
	сткДанные.Вставить("Данные",			АвтоПроверкаПодвестиИтогиАукциона_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
КонецФункции

Функция АвтоПроверкаПодвестиИтогиАукциона_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	//сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	сткРезДанные.required_data = АвтоПроверкаПодвестиИтогиАукциона_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция АвтоПроверкаПодвестиИтогиАукциона_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)

	сткРезультат = АукОбщийКлиентСервер.СтруктураПоМассивуИмен(АукУправлениеАукционамиКлиентСервер.АвтоПроверкаПодвестиИтогиАукциона_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.stage_number				= пСткПараметрыДанныхJSON.НомерЭтапа;
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти

#Область РассчитатьИтогиАукциона

// Создание команды "Рассчет промежуточных итогов и определение промежуточного победителя". Эта команда только для автоматического режима!
// Эта команда аналог выбора победителя пользователем на форме подведения промежуточных итогов
//
// Параметры:
//  пСткПараметры
//	  Обязательные: 
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//	  Опциональные:
//		*КлючРодителя		- Справочник.КлючиУникальности
//
Процедура РассчитатьИтогиАукциона_СозданиеКоманды(пСткПараметры) Экспорт		
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.РассчитатьИтогиАукциона");
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",				пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",				сткДанные.Команда);
	
	сткДанные.Вставить("Данные",			РассчитатьИтогиАукциона_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
КонецПроцедуры

Функция РассчитатьИтогиАукциона_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

#КонецОбласти

#Область ЗафиксироватьИтогиАукциона

// Создание команды "Подведение итогов аукциона"
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион				- Справочник.АукАукционы 
//		*Автоматическая 		- Булево - признак интеративной отправки
//	  Опциональные:
//		*КлючРодителя			- Справочник.КлючиУникальности
//
Функция ЗафиксироватьИтогиАукциона_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.АукКоманды.ЗафиксироватьИтогиАукциона");	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",			сткДанные.Команда);
		
	сткДанные.Вставить("Данные",			ЗафиксироватьИтогиАукциона_ДанныеСтрокой(сткПараметрыДанныхJSON));
		
	// 2. Записать команды в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецФункции

Функция ЗафиксироватьИтогиАукциона_ДанныеСтрокой(пСткПараметрыДанныхJSON, пБулЕстьПромежуточныеИтоги = Истина)
	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
		
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);	
КонецФункции

#КонецОбласти

#Область ПоместитьВАрхив

Функция ПоместитьВАрхив_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.АукКоманды.ПоместитьВАрхив"); 	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",			ПредопределенноеЗначение("Перечисление.АукКоманды.ПоместитьВАрхив"));
	
	сткДанные.Вставить("Данные",			ПоместитьВАрхив_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецФункции

Функция ПоместитьВАрхив_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

#КонецОбласти

#Область ОтменитьАукцион

// Создание команды "Отменить аукцион". Отказ от дальнейшего проведения аукциона
//
//  пСткПараметры
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//
Функция ОтменитьАукцион_СозданиеКоманды(пСткПараметры) Экспорт
	// 1. Заполнить параметры
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры); 
	
	сткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.ОтменитьАукцион"); 	
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",		пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",		сткДанные.Команда);
	
	сткДанные.Вставить("Данные",			ОтменитьАукцион_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команды в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.Вставить("КлючКоманды", сткДанные.КлючКоманды);
КонецФункции

Функция ОтменитьАукцион_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.БазоваяСтруктураДанныхДляКоманды();
	
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

#КонецОбласти

#Область ПолучитьДанныеОтУчастника

// Получение данных от участников (сообщения, ставки, отказы). Одиночная команда
//
// Параметры:
//  пСткПараметры
//	  Обязательные:
//		*Аукцион			- Справочник.АукАукционы 
//		*КонтактноеЛицо		- Справочник.АукКонтактныеЛицаУчастниковАукционов 
//		*Участник			- Справочник.АукУчастникиАукционов
//		*Данные 			- Произвольно. Может быть текст (отказ, сообщение) или массив структур (ставка)
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*ВидДанных 			- Перечисление.АукВидыДанных
//		*ТребуетсяПодтверждение 	- Булево - признак необходимости оповещать участника о приеме от него данных
//	  Опциональные:
//		*ВидСообщения		- Перечисление.АукВидыСообщений - вид сообщения, которое необходимо отправить участнику (обязательно если ТребуетсяПодтверждение = Истина)
// 
// Возвращаемое значение:
//   Массив - результаты создания команд по списку контактных лиц 
//
Процедура ПолучитьДанныеОтУчастника_СозданиеКоманды(пСткПараметры) Экспорт

	пСткПараметры.Вставить("КлючиКоманд", Новый Массив);
	
	// 1. Заполнение данных для создания команды	
	сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
	
	сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.АукКоманды.ПолучитьДанныеОтУчастника"); 	
	сткДанные.Вставить("Участник",			пСткПараметры.Участник);
	сткДанные.Вставить("КонтактноеЛицо",	пСткПараметры.КонтактноеЛицо);
	
	сткПараметрыДанныхJSON = Новый Структура;
	сткПараметрыДанныхJSON.Вставить("Аукцион",					пСткПараметры.Аукцион);
	сткПараметрыДанныхJSON.Вставить("Команда",					сткДанные.Команда);
	сткПараметрыДанныхJSON.Вставить("ВидДанных",				пСткПараметры.ВидДанных);
	сткПараметрыДанныхJSON.Вставить("Данные",					пСткПараметры.Данные);
	сткПараметрыДанныхJSON.Вставить("ТребуетсяПодтверждение",	?(пСткПараметры.Свойство("ТребуетсяПодтверждение"), пСткПараметры.ТребуетсяПодтверждение, Ложь));
	сткПараметрыДанныхJSON.Вставить("ВидСообщенияУчастнику",	?(пСткПараметры.Свойство("ВидСообщения"), пСткПараметры.ВидСообщения,
																	ПредопределенноеЗначение("Перечисление.АукВидыСообщений.ПростоеСообщение")));
	
	сткДанные.Вставить("Данные",			ПолучитьДанныеОтУчастника_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
	
	// 2. Записать команду в БД
	РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
	
	пСткПараметры.КлючиКоманд.Добавить(сткДанные.КлючКоманды);	
КонецПроцедуры

Функция ПолучитьДанныеОтУчастника_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	// "Начинка" команды
	сткРезДанные.required_data = ПолучитьДанныеОтУчастника_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция ПолучитьДанныеОтУчастника_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)

	сткРезультат = АукОбщийКлиентСервер.СтруктураПоМассивуИмен(АукУправлениеАукционамиКлиентСервер.ПолучениеДанныхОтУчастника_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.data_type				= XMLСтрока(пСткПараметрыДанныхJSON.ВидДанных);
	сткРезультат.data					= пСткПараметрыДанныхJSON.Данные;
	сткРезультат.confirmation_required	= пСткПараметрыДанныхJSON.ТребуетсяПодтверждение;
	сткРезультат.message_type			= XMLСтрока(пСткПараметрыДанныхJSON.ВидСообщенияУчастнику);
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти

#Область ОтправитьСообщениеУчастнику

// Отправка сообщений участникам. Создание команд по списку контаткных лиц.
//
// Параметры:
//  пСткПараметры
//	  Обязательные:	
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*НомерЭтапа 		- Число
//		*СообщенияУчастникам 	- Массив соответствий
//			**Участник			- Справочник.АукУчастникиАукционов
//			**КонтактноеЛицо	- Справочник.АукКонтактныеЛицаУчастниковАукционов
//			**ТекстСообщения	- Строка 
//			**ТемаСообщения		- Строка
//			**Канал				- Справочник.АукКаналыВзаимодействия
//			**НастройкиКанала	- Массив настроек
//	  Опциональные:
//		*КлючРодителя		- Справочник.КлючиУникальности
//		*СтрокаДанных		- Число
//
Процедура ОтправитьСообщенияУчастникам_СозданиеКоманд_(пСткПараметры) Экспорт
	
	пСткПараметры.Вставить("КлючиКоманд", Новый Массив);
	
	Для Каждого СткДанныеСообщения Из пСткПараметры.СообщенияУчастникам Цикл	
		сткДанные	= РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
		
		ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры); 
				
		сткДанные.Команда			= ПредопределенноеЗначение("Перечисление.АукКоманды.ОтправитьСообщениеУчастнику");
		сткДанные.Вставить("Участник",			СткДанныеСообщения.Участник);
		сткДанные.Вставить("КонтактноеЛицо",	СткДанныеСообщения.КонтактноеЛицо);
			
		сткПараметрыДанныхJSON = Новый Структура;
		сткПараметрыДанныхJSON.Вставить("Аукцион",			пСткПараметры.Аукцион);
		сткПараметрыДанныхJSON.Вставить("НомерЭтапа",		пСткПараметры.НомерЭтапа);
		сткПараметрыДанныхJSON.Вставить("Период",			сткДанные.Период);
		сткПараметрыДанныхJSON.Вставить("СтрокаДанных",		?(СткДанныеСообщения.Свойство("СтрокаДанных"), СткДанныеСообщения.СтрокаДанных, 0));
		сткПараметрыДанныхJSON.Вставить("Команда",			ПредопределенноеЗначение("Перечисление.АукКоманды.ОтправитьСообщениеУчастнику"));
		сткПараметрыДанныхJSON.Вставить("Канал",			XMLСтрока(СткДанныеСообщения.Канал));
		сткПараметрыДанныхJSON.Вставить("НастройкиКанала",	СткДанныеСообщения.НастройкиКанала);	
		сткПараметрыДанныхJSON.Вставить("ТекстСообщения",	СткДанныеСообщения.ТекстСообщения);
		сткПараметрыДанныхJSON.Вставить("ТемаСообщения",	СткДанныеСообщения.ТемаСообщения);
		сткПараметрыДанныхJSON.Вставить("ЗначенияПараметровШаблонов",	СткДанныеСообщения.ЗначенияПараметровШаблонов);
		
		сткДанные.Вставить("Данные",			ОтправитьСообщениеУчастнику_ДанныеСтрокой_(сткПараметрыДанныхJSON)); 
		
		// 2. Записать команду в БД
		РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);
		
		пСткПараметры.КлючиКоманд.Добавить(сткДанные.КлючКоманды);
	КонецЦикла;	
	
КонецПроцедуры

Функция ОтправитьСообщениеУчастнику_ДанныеСтрокой_(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	// "Начинка" команды, текст оповещения и адресаты (сотрудники).
	сткРезДанные.required_data = ОтправитьСообщениеУчастнику_ДанныеСтрокой_ОбязательныеДанные_(пСткПараметрыДанныхJSON);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция ОтправитьСообщениеУчастнику_ДанныеСтрокой_ОбязательныеДанные_(пСткПараметрыДанныхJSON)

	сткРезультат = АукОбщийКлиентСервер.СтруктураПоМассивуИмен(АукУправлениеАукционамиКлиентСервер.ОтправитьСообщениеУчастнику_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.channel			= пСткПараметрыДанныхJSON.Канал;
	сткРезультат.channel_settings	= пСткПараметрыДанныхJSON.НастройкиКанала;
	сткРезультат.message			= пСткПараметрыДанныхJSON.ТекстСообщения;
	сткРезультат.subject			= пСткПараметрыДанныхJSON.ТемаСообщения;
	сткРезультат.period				= пСткПараметрыДанныхJSON.Период;
	сткРезультат.data_element		= пСткПараметрыДанныхJSON.СтрокаДанных;
	сткРезультат.template_parameter_values		= пСткПараметрыДанныхJSON.ЗначенияПараметровШаблонов;
	сткРезультат.stage_number		= пСткПараметрыДанныхJSON.НомерЭтапа;
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти

#Область ОтправитьСообщениеАвтору

// Создание команды "Отправить сообщение автору аукциона". Список получателей рассылки определяется внутри этой функции
// т.к. он статичен (т.е. список один и тот же), а значит одна точка входа
//
// Параметры:
//  пСткПараметры	
//		*Аукцион			- Справочник.АукАукционы 
//		*Автоматическая 	- Булево - признак интеративной отправки
//		*СообщенияАвторам 	- Структура
//			**ТекстСообщения	- Строка
//			**ТемаСообщения		- Строка
//			**ЗначенияПараметровШаблонов	- Массив структур
//				***NameParam	- Имя параметра шаблона
//				***ValueParam	- Значение параметра шаблона
//
Процедура ОтправитьСообщениеАвтору_СозданиеКоманды(пСткПараметры) Экспорт
	// Пока канал для авторов будет почтовый неавтоматический.
	Канал_ = АукОбщийКлиентСервер.КаналВзаимодействия_ПочтовыйНеавтоматический();
	
	масТехНаименования = Справочники.АукКаналыВзаимодействия.ТехническиеНаименованияЭлементовНастройкиКаналаВзаимодействия(Канал_);
	
	сткНастройкиКанала = АукОбщийКлиентСервер.СтруктураПоМассивуИмен(масТехНаименования);
	//
	
	масОтветственные = Справочники.АукАукционы.ОтветственныеЛицаПоАукциону(пСткПараметры.Аукцион);
	
	тзЭлПочтаОтветственных = Справочники.Пользователи.ЭлПочтаПользователя(масОтветственные);
	
	Для Каждого ЭлОтветственный Из масОтветственные Цикл	
		СтрокаТз = тзЭлПочтаОтветственных.Найти(ЭлОтветственный, "Пользователь");
		
		Если СтрокаТз <> Неопределено Тогда
			сткНастройкиКанала.EMail = СтрокаТз.ЭлПочта;
			
			// 1. Заполнить параметры
			сткДанные = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
			
			ЗаполнитьЗначенияСвойств(сткДанные, пСткПараметры);
			
			сткДанные.Команда = ПредопределенноеЗначение("Перечисление.АукКоманды.ОтправитьСообщениеАвтору");
			
			сткПараметрыДанныхJSON = Новый Структура;
			сткПараметрыДанныхJSON.Вставить("Аукцион",				пСткПараметры.Аукцион);
			сткПараметрыДанныхJSON.Вставить("Команда",				сткДанные.Команда);
			
			сткПараметрыДанныхJSON.Вставить("Канал",				XMLСтрока(Канал_));	
			сткПараметрыДанныхJSON.Вставить("НастройкиКанала",		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(сткНастройкиКанала));
			
			сткПараметрыДанныхJSON.Вставить("ТекстСообщения",			пСткПараметры.СообщенияАвторам.ТекстСообщения);
			сткПараметрыДанныхJSON.Вставить("ТемаСообщения",			пСткПараметры.СообщенияАвторам.ТемаСообщения);
			сткПараметрыДанныхJSON.Вставить("ЗначенияПараметровШаблонов",	пСткПараметры.СообщенияАвторам.ЗначенияПараметровШаблонов);
						
			сткДанные.Вставить("Данные",			ОтправитьСообщениеАвтору_ДанныеСтрокой(сткПараметрыДанныхJSON)); 
			
			// 2. Записать команды в БД
			РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьКомандуДляВыполнения_(сткДанные);	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

Функция ОтправитьСообщениеАвтору_ДанныеСтрокой(пСткПараметрыДанныхJSON)

	сткРезДанные = АукУправлениеАукционамиКлиентСервер.РасширеннаяСтруктураДанныхДляКоманды();
	
	// Основные параметры
	сткРезДанные.command = Перечисления.АукКоманды.ИмяКомандыДляЗаписиВJSONПоСсылке(пСткПараметрыДанныхJSON.Команда);
	сткРезДанные.auction = XMLСтрока(пСткПараметрыДанныхJSON.Аукцион);
	
	// "Начинка" команды
	сткРезДанные.required_data = ОтправитьСообщениеАвтору_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON);
	
	Возврат АукОбщийКлиентСервер.СериализоватьВСтрокуJSON(сткРезДанные);
	
КонецФункции

Функция ОтправитьСообщениеАвтору_ДанныеСтрокой_ОбязательныеДанные(пСткПараметрыДанныхJSON)
	
	сткРезультат = АукОбщийКлиентСервер.СтруктураПоМассивуИмен(АукУправлениеАукционамиКлиентСервер.ОтправитьСообщениеАвтору_ОписаниеСтруктурыОбязательныхДанных());
	
	сткРезультат.channel					= пСткПараметрыДанныхJSON.Канал;
	сткРезультат.channel_settings			= пСткПараметрыДанныхJSON.НастройкиКанала;
	сткРезультат.template_parameter_values	= пСткПараметрыДанныхJSON.ЗначенияПараметровШаблонов;
	
	сткРезультат.subject					= пСткПараметрыДанныхJSON.ТемаСообщения;
	сткРезультат.message					= пСткПараметрыДанныхJSON.ТекстСообщения;
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВыполнениеКоманд

// Ошибка данных -> фиксируем ошибку
// Ошибка записи -> уходим на 2 круг, логируем в грейлог
//
Функция ПроизвестиКонтрольДанныхИВыполнитьКоманду(пСткДанныеКоманды) Экспорт
	
	сткВозврат = Новый Структура;
	
	сткВозврат.Вставить("Успех",		Истина);
	сткВозврат.Вставить("КлючКоманды",	пСткДанныеКоманды.КлючКоманды); 
	сткВозврат.Вставить("Результат",	ПредопределенноеЗначение("Перечисление.АукРезультатыВыполненияКоманд.ОбработанаУспешно"));
	сткВозврат.Вставить("Комментарий",	"");
	
	НачатьТранзакцию();
	Попытка
		ПроверитьДанныеКомандыПередВыполнением(пСткДанныеКоманды, сткВозврат); // Здесь может быть ошибка данных -> Фиксируем ошибку выполнения команды
		
		Если Не сткВозврат.Успех Тогда
			РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьРезультатВыполненияКомандыПоКлючу(сткВозврат);
			
			ЗафиксироватьТранзакцию();
			
			АукОбщийКлиентСервер.ОтправитьСообщениеВГрейлог(сткВозврат.Комментарий, "ПроизвестиКонтрольДанныхИВыполнитьКоманду");
			
			Возврат ЭдоОбщий._Ошибка(сткВозврат.Комментарий);
		Иначе			
			ПроизвестиВыполнениеКоманды(пСткДанныеКоманды, сткВозврат);
			
			РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьРезультатВыполненияКомандыПоКлючу(сткВозврат);
			
			ЗафиксироватьТранзакцию();
			
			Если Не сткВозврат.Успех Тогда
				АукОбщийКлиентСервер.ОтправитьСообщениеВГрейлог(сткВозврат.Комментарий, "ПроизвестиКонтрольДанныхИВыполнитьКоманду");
				
				Возврат ЭдоОбщий._Ошибка(сткВозврат.Комментарий);	
			Иначе
				Возврат ЭдоОбщий._Успех(пСткДанныеКоманды.КлючКоманды);	
			КонецЕсли;	
		
		КонецЕсли;
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		стрОшибка = ОписаниеОшибки();
		
		сткВозврат.Успех		= Ложь;
		сткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.АукРезультатыВыполненияКоманд.ОбработанаСОшибкой");
		сткВозврат.Комментарий	= стрОшибка;
		
		РегистрыСведений.АукИсторияКомандАукционов.ЗафиксироватьРезультатВыполненияКомандыПоКлючу(сткВозврат);
		
		АукОбщийКлиентСервер.ОтправитьСообщениеВГрейлог(стрОшибка, "ПроизвестиКонтрольДанныхИВыполнитьКоманду");
		
		Возврат ЭдоОбщий._Ошибка(стрОшибка);
	КонецПопытки;
	
КонецФункции

Процедура ПроверитьДанныеКомандыПередВыполнением(пСткДанныеКоманды, пСткВозврат)
	
	// 1. Валидация JSONа команды, проверка наличия необходимых данных
	сткРез = ВыполнитьПроверкуДанныхКомандыИзСтрокиJSON(пСткДанныеКоманды.Данные);
	
	Если Не сткРез.Успех Тогда	
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.КлючКоманды	= пСткДанныеКоманды.КлючКоманды;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.АукРезультатыВыполненияКоманд.ОшибкаВалидацииДанных");
		пСткВозврат.Комментарий	= сткРез.Результат;
		
		Возврат;
	КонецЕсли;	
	
	пСткДанныеКоманды.Вставить("ДанныеКоманды", сткРез.Результат);
	
	// 2. Соответствие данных команды с данными базы
	сткРез = ПроверитьСоответсвиеДанныхКомандыСДаннымиБазы(пСткДанныеКоманды.ДанныеКоманды);
	
	Если Не сткРез.Успех Тогда
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.КлючКоманды	= пСткДанныеКоманды.КлючКоманды;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.АукРезультатыВыполненияКоманд.ОшибкаСопоставленияДанных");
		пСткВозврат.Комментарий	= сткРез.Результат;
		
		Возврат;
	КонецЕсли;
	
	пСткДанныеКоманды.Вставить("Аукцион", пСткДанныеКоманды.ДанныеКоманды.auction);
	пСткДанныеКоманды.Вставить("Команда", пСткДанныеКоманды.ДанныеКоманды.command);
	
	// 3. Проверка возможности выполнения команды, допустимость применения в зависимости от команды
	сткРез = ПроверитьВозможностьВыполненияКомандыПоАукциону(пСткДанныеКоманды);
	
	Если Не сткРез.Успех Тогда
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.КлючКоманды	= пСткДанныеКоманды.КлючКоманды;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.АукРезультатыВыполненияКоманд.НеприменимоКТекущемуСостоянию");
		пСткВозврат.Комментарий	= сткРез.Результат;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроизвестиВыполнениеКоманды(пСткДанныеКоманды, пСткВозврат)
	
	Если пСткДанныеКоманды.Команда = "AutoCheckStartAuction" Тогда
		
		АвтоПроверкаНачатьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "StartAuction" Тогда	
		
		НачатьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "AutoCheckEnterInterimSummary" Тогда	
		
		АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "EnterInterimSummary" Тогда	
		
		ПерейтиКПодведениюПромежуточныхИтогов_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "AutoCheckSummarizeInterimResults" Тогда	
		
		АвтоПроверкаПодвестиПромежуточныеИтоги_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CalculateInterimResults" Тогда	
		
		РассчитатьПромежуточныеИтоги_Реализация(пСткДанныеКоманды, пСткВозврат);	
		
	ИначеЕсли пСткДанныеКоманды.Команда = "RecordInterimResults" Тогда	
		
		ЗафиксироватьПромежуточныеИтоги_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "AutoCheckEnterSummarizeTotalResults" Тогда	
		
		АвтоПроверкаПерейтиКПодведениюИтогов_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "EnterSummarizeTotalResults" Тогда	
		
		ПерейтиКПодведениюИтогов_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "AutoCheckSummarizeTotalResults" Тогда	
		
		АвтоПроверкаПодвестиИтогиАукциона_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CalculateTotalResults" Тогда	
		
		РассчитатьИтогиАукциона_Реализация(пСткДанныеКоманды, пСткВозврат);	
		
	ИначеЕсли пСткДанныеКоманды.Команда = "RecordTotalResults" Тогда	
		
		ЗафиксироватьИтогиАукциона_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "PutInArchive" Тогда	
		
		ПоместитьВАрхив_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CancelAuction" Тогда	
		
		ОтменитьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "GetDataFromParticipant" Тогда	
		
		ПолучитьДанныеОтУчастника_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "SendMessageToParticipant" Тогда	
		
		ОтправитьСообщениеУчастнику_Реализация(пСткДанныеКоманды, пСткВозврат);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "SendMessageToAuthor" Тогда
		
		ОтправитьСообщениеАвтору_Реализация(пСткДанныеКоманды, пСткВозврат);	
	
	Иначе	
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.АукРезультатыВыполненияКоманд.ОбработанаСОшибкой");
		пСткВозврат.Комментарий = СтрШаблон(НСтр("ru = 'Для команды <%1> не реализован обработчик'"), пСткДанныеКоманды.Команда);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

#Область АвтоПроверкаНачатьАукцион

Процедура АвтоПроверкаНачатьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	сткПараметры = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды;// создание дочерней команды
	
	// 1. Получение значения флага "Автоматический старт"
	сткНастройки = Справочники.АукАукционы.НастройкиАвтоматическогоВыполненияАукциона(пСткДанныеКоманды.Аукцион);
	
	Если сткНастройки.АвтоматическийСтарт Тогда // 2.1 Если автоматическй старт разрешен -> создаем команду "Начать аукцион"	
		НачатьАукцион_СозданиеКоманды(сткПараметры);
		
	Иначе // 2.2 Если автоматический старт запрещен -> информируем авторов
		сткПараметрыОповещения = Новый Структура;
		сткПараметрыОповещения.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
		сткПараметрыОповещения.Вставить("ВидСообщения",		ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПроверкеНачалаАукциона"));
		
		сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
		
		ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НачатьАукцион

Процедура НачатьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат)
	// Порядок важен!!!
	
	// 1. Создать команды оповещения участникам победителям
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",				пСткДанныеКоманды.Аукцион);
	сткПараметры.Вставить("Автоматическая", 		пСткДанныеКоманды.Автоматическая);
	сткПараметры.Вставить("КлючРодителя",			пСткДанныеКоманды.КлючКоманды);
	сткПараметры.Вставить("НомерЭтапа",				0);
	
	ВидСообщения = ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОНачалеАукциона");
	
	сткПараметры.Вставить("СообщенияУчастникам",	ДанныеРассылкиПоВсемУчастникам(пСткДанныеКоманды.Аукцион, ВидСообщения));
	
	ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
	
	// 2. Зафиксировать изменение статуса
	АукОбщийСервер.ПеревестиНовыйАукционВРаботу_(пСткДанныеКоманды.Аукцион);
	
	// 3. Если команда автоматическая то сделаем служебную рассылку сотрудникам
	Если пСткДанныеКоманды.Автоматическая Тогда
		сткПараметрыОповещения = Новый Структура;
		сткПараметрыОповещения.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
		сткПараметрыОповещения.Вставить("ВидСообщения",		ВидСообщения);
		
		сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
		
		ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов

Процедура АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	сткПараметры = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды; // создание дочерней команды
	
	сткПараметры.Вставить("НомерЭтапа", пСткДанныеКоманды.ДанныеКоманды.required_data.stage_number);
	
	// 1. Получение значения флага "Автоматический старт"
	сткНастройки = Справочники.АукАукционы.НастройкиАвтоматическогоВыполненияАукциона(пСткДанныеКоманды.Аукцион);
	
	Если сткНастройки.АвтоматическийПереходКПодведениюПромежуточныхИтогов Тогда
		// 2.1 Если автоматическй переход разрешен -> создаем команду "Переход к подведению промежуточных итогов текущего этапа аукциона"	
		ПерейтиКПодведениюПромежуточныхИтогов_СозданиеКоманды(сткПараметры);
		
	Иначе // 2.2 Если автоматический переход запрещен -> информируем авторов
		сткПараметрыОповещения = Новый Структура;
		сткПараметрыОповещения.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
		сткПараметрыОповещения.Вставить("ВидСообщения",
					ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПровереПереходаКПодведениюПромежуточныхИтогов"));
		
		сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
		
		ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПерейтиКПодведениюПромежуточныхИтогов

// Проверяем наличие ставок по аукциону
//    Ставки есть -> меняем статус на "ПодведениеПромежуточныхИтогов"
//    Ставок нет -> формируем команду 
//
Процедура ПерейтиКПодведениюПромежуточныхИтогов_Реализация(пСткДанныеКоманды, пСткВозврат)	
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
	сткПараметры.Вставить("Автоматическая", 	пСткДанныеКоманды.Автоматическая);
	сткПараметры.Вставить("КлючРодителя",		пСткДанныеКоманды.КлючКоманды);
	сткПараметры.Вставить("НомерЭтапа",			пСткДанныеКоманды.ДанныеКоманды.required_data.stage_number);
		
	Если РегистрыСведений.АукИсторияДанныхАукционов.ЕстьСтавкиПоАукциону(пСткДанныеКоманды.Аукцион) Тогда
		ВидСообщения = ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПереходеКПодведениюПромежуточныхИтогов");
		
		// 1. Создать команды оповещения участников		
		сткПараметры.Вставить("СообщенияУчастникам",	ДанныеРассылкиПоВсемУчастникам(пСткДанныеКоманды.Аукцион, ВидСообщения));
		
		ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
		
		// 2. Зафиксировать изменение статуса
		АукОбщийСервер.ПеревестиАукционНаНовыйЭтап_(пСткДанныеКоманды.Аукцион);
		
		// 3. Если команда автоматическая то сделаем служебную рассылку сотрудникам
		Если пСткДанныеКоманды.Автоматическая Тогда 
			сткПараметрыОповещения = Новый Структура;
			сткПараметрыОповещения.Вставить("Аукцион",		пСткДанныеКоманды.Аукцион);
			сткПараметрыОповещения.Вставить("ВидСообщения",	ВидСообщения);
			
			сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
			
			ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);
		КонецЕсли;	
	Иначе
		// 1. Зафиксировать изменение статуса
		АукОбщийСервер.ПеревестиАукционНаНовыйЭтапБезИтогов_(пСткДанныеКоманды.Аукцион);
		
		// 2. Если команда автоматическая то сделаем служебную рассылку сотрудникам
		Если пСткДанныеКоманды.Автоматическая Тогда 
			сткПараметрыОповещения = Новый Структура;
			сткПараметрыОповещения.Вставить("Аукцион",		пСткДанныеКоманды.Аукцион);
			сткПараметрыОповещения.Вставить("ВидСообщения",	ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПереходеНаНовыйЭтапБезПодведенияПромежуточныхИтогов"));
			
			сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
			
			ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область АвтоПроверкаПодвестиПромежуточныеИтоги

Процедура АвтоПроверкаПодвестиПромежуточныеИтоги_Реализация(пСткДанныеКоманды, пСткВозврат)
	сткПараметры = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды;// создание дочерней команды
	
	// 1. Получение значения флага "Автоматическое подведение промежуточных итогов"
	сткНастройки = Справочники.АукАукционы.НастройкиАвтоматическогоВыполненияАукциона(пСткДанныеКоманды.Аукцион);
	
	// 2.1 Если Истина -> создаем команду ПодвестиПромежуточныеИтоги
	// 2.2 Если Ложь -> информируем авторов
	Если сткНастройки.АвтоматическоеПодведениеПромежуточныхИтогов Тогда	
		РассчитатьПромежуточныеИтоги_СозданиеКоманды(сткПараметры);	
	Иначе
		сткПараметрыОповещения = Новый Структура;
		сткПараметрыОповещения.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
		сткПараметрыОповещения.Вставить("ВидСообщения",
									ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПроверкиПодведенияПромежуточныхИтогов"));
		
		сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
		
		ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);	
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти

#Область РассчитатьПромежуточныеИтоги

Процедура РассчитатьПромежуточныеИтоги_Реализация(пСткДанныеКоманды, пСткВозврат)
	Если Не АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		АукОбщийСервер.ПромежуточныйИтогДанныеЛидирующейСтавки(пСткДанныеКоманды.Аукцион);
	Иначе
		сткДанные = Новый Структура;
		
		сткДанные.Вставить("Аукцион",					пСткДанныеКоманды.Аукцион);
		сткДанные.Вставить("ВидАукциона",				Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.Аукцион).ВидАукциона);
		
		сткТекСостояниеАук = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанныеКоманды.Аукцион);
		
		сткДанные.Вставить("НомерЭтапа",			сткТекСостояниеАук.НомерЭтапа);
		сткДанные.Вставить("ЭтоПромежуточныеИтоги",	(сткТекСостояниеАук.Статус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов")));
		
		АукОбщийСервер.ОкончательныеИтоги_ДополнительныеПараметры_(сткДанные);
		
		АукОбщийСервер.РассчитатьИЗафиксироватьДанныеИтоговАукционов(сткДанные);	
	КонецЕсли;
	
	сткПараметры = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды; // создание дочерней команды
	
	ЗафиксироватьПромежуточныеИтоги_СозданиеКоманды(сткПараметры);	
КонецПроцедуры

#КонецОбласти

#Область ЗафиксироватьПромежуточныеИтоги

Процедура ЗафиксироватьПромежуточныеИтоги_Реализация(пСткДанныеКоманды, пСткВозврат)	
	ВидСообщения = ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПромежуточномПобедителе");
	
	// 1. Создать команды оповещения всем участникам	
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",				пСткДанныеКоманды.Аукцион);
	сткПараметры.Вставить("Автоматическая", 		пСткДанныеКоманды.Автоматическая);
	сткПараметры.Вставить("КлючРодителя",			пСткДанныеКоманды.КлючКоманды);
	сткПараметры.Вставить("НомерЭтапа",				РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанныеКоманды.Аукцион).НомерЭтапа);
	
	сткПараметры.Вставить("СообщенияУчастникам",	ДанныеРассылкиПоВсемУчастникам(пСткДанныеКоманды.Аукцион, ВидСообщения));
	
	ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
	
	// 2. Зафиксировать изменение статуса	
	АукОбщийСервер.ПеревестиАукционНаНовыйЭтап_(пСткДанныеКоманды.Аукцион);
	
	// 3. Если команда автоматическая то сделаем служебную рассылку сотрудникам
	Если пСткДанныеКоманды.Автоматическая Тогда
		сткПараметрыОповещения = Новый Структура;
		сткПараметрыОповещения.Вставить("Аукцион",		пСткДанныеКоманды.Аукцион);
		сткПараметрыОповещения.Вставить("ВидСообщения",	ВидСообщения);
		
		сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
		
		ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);
	КонецЕсли	
КонецПроцедуры

#КонецОбласти

#Область АвтоПроверкаПерейтиКПодведениюИтогов

Процедура АвтоПроверкаПерейтиКПодведениюИтогов_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	сткПараметры = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды;
	
	сткПараметры.Вставить("НомерЭтапа", пСткДанныеКоманды.ДанныеКоманды.required_data.stage_number);
	
	сткНастройки = Справочники.АукАукционы.НастройкиАвтоматическогоВыполненияАукциона(пСткДанныеКоманды.Аукцион);
	
	Если сткНастройки.АвтоматическийПереходКПодведениюОкончательныхИтогов Тогда
		
		ПерейтиКПодведениюИтогов_СозданиеКоманды(сткПараметры);
		
	Иначе // 2.2 Если автоматический старт запрещен -> информируем авторов
		сткПараметрыОповещения = Новый Структура;
		сткПараметрыОповещения.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
		сткПараметрыОповещения.Вставить("ВидСообщения",
									ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПровереПереходаКПодведениюИтогов"));
		
		сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
		
		ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПерейтиКПодведениюИтогов

// Проверяем наличие ставок по аукциону
//    Ставки есть -> меняем статус на "ПодведениеИтогов"
//    Ставок нет -> формируем команду 
//
Процедура ПерейтиКПодведениюИтогов_Реализация(пСткДанныеКоманды, пСткВозврат)	
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
	сткПараметры.Вставить("Автоматическая", 	пСткДанныеКоманды.Автоматическая);
	сткПараметры.Вставить("КлючРодителя",		пСткДанныеКоманды.КлючКоманды);
	сткПараметры.Вставить("НомерЭтапа",			пСткДанныеКоманды.ДанныеКоманды.required_data.stage_number);
		
	Если РегистрыСведений.АукИсторияДанныхАукционов.ЕстьСтавкиПоАукциону(пСткДанныеКоманды.Аукцион) Тогда
		ВидСообщения = ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПереходеКПодведениюИтогов");
		
		// 1. Создать команды оповещения участников		
		сткПараметры.Вставить("СообщенияУчастникам",	ДанныеРассылкиПоВсемУчастникам(пСткДанныеКоманды.Аукцион, ВидСообщения));
		
		ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
		
		// 2. Зафиксировать изменение статуса
		АукОбщийСервер.ПеревестиАукционНаНовыйЭтап_(пСткДанныеКоманды.Аукцион);
		
		// 3. Если команда автоматическая то сделаем служебную рассылку сотрудникам
		Если пСткДанныеКоманды.Автоматическая Тогда
			сткПараметрыОповещения = Новый Структура;
			сткПараметрыОповещения.Вставить("Аукцион",		пСткДанныеКоманды.Аукцион);
			сткПараметрыОповещения.Вставить("ВидСообщения",	ВидСообщения);
			
			сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
			
			ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);
		КонецЕсли;	
	Иначе
		// 1. Зафиксировать изменение статуса
		АукОбщийСервер.ПеревестиАукционНаНовыйЭтапБезИтогов_(пСткДанныеКоманды.Аукцион);
		
		// 2. Если команда автоматическая то сделаем служебную рассылку сотрудникам
		Если пСткДанныеКоманды.Автоматическая Тогда 
			сткПараметрыОповещения = Новый Структура;
			сткПараметрыОповещения.Вставить("Аукцион",		пСткДанныеКоманды.Аукцион);
			сткПараметрыОповещения.Вставить("ВидСообщения",	ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОЗавершенииАукционаБезПодведенияИтогов"));
			
			сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
			
			ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти 

#Область АвтоПроверкаПодвестиИтогиАукциона

Процедура АвтоПроверкаПодвестиИтогиАукциона_Реализация(пСткДанныеКоманды, пСткВозврат)
	сткПараметры = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды;// создание дочерней команды
	
	// 1. Получение значения флага "Автоматическое подведение промежуточных итогов"
	сткНастройки = Справочники.АукАукционы.НастройкиАвтоматическогоВыполненияАукциона(пСткДанныеКоманды.Аукцион);
	
	Если сткНастройки.АвтоматическоеПодведениеОкончательныхИтогов Тогда	
		РассчитатьИтогиАукциона_СозданиеКоманды(сткПараметры);	
	Иначе
		сткПараметрыОповещения = Новый Структура;
		сткПараметрыОповещения.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
		сткПараметрыОповещения.Вставить("ВидСообщения",
										ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПроверкеПодведенияИтогов"));
		
		сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
		
		ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область РассчитатьИтогиАукциона

Процедура РассчитатьИтогиАукциона_Реализация(пСткДанныеКоманды, пСткВозврат)
	Если Не АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		// сделать расчет
		сткПараметрыРасчета = Новый Структура;
		
		сткПараметрыРасчета.Вставить("Аукцион",					пСткДанныеКоманды.Аукцион);
		сткПараметрыРасчета.Вставить("ВидАукциона",				Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.Аукцион).ВидАукциона);
		сткПараметрыРасчета.Вставить("СРаспределениемСуммы",	Истина);  
		
		АукОбщийСервер.ОкончательныеИтоги_ДополнительныеПараметры(сткПараметрыРасчета); 
		
		сткДанные = Новый Структура;
		сткДанные.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
		сткДанные.Вставить("ИтогиАукциона",		АукОбщийСервер.ОкончательныеИтогиАукциона(сткПараметрыРасчета)); 
		сткДанные.Вставить("НачальныеУсловия",	АукОбщийСервер.НачальныеУсловияАукциона(пСткДанныеКоманды.Аукцион));
		
		АукОбщийВызовСервера.СохранитьДанныеОкончательныхИтогов(сткДанные);
	Иначе
		сткДанные = Новый Структура;
		
		сткДанные.Вставить("Аукцион",					пСткДанныеКоманды.Аукцион);
		сткДанные.Вставить("ВидАукциона",				Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.Аукцион).ВидАукциона);
		
		сткТекСостояниеАук = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанныеКоманды.Аукцион);
		
		сткДанные.Вставить("НомерЭтапа",			сткТекСостояниеАук.НомерЭтапа);
		сткДанные.Вставить("ЭтоПромежуточныеИтоги",	(сткТекСостояниеАук.Статус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов")));
		
		АукОбщийСервер.ОкончательныеИтоги_ДополнительныеПараметры_(сткДанные);
		
		АукОбщийСервер.РассчитатьИЗафиксироватьДанныеИтоговАукционов(сткДанные);
	КонецЕсли;
	
	сткПараметры = РегистрыСведений.АукИсторияКомандАукционов.БазовыеПараметрыДляСозданияКоманд();
	
	сткПараметры.Автоматическая	= пСткДанныеКоманды.Автоматическая;
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	сткПараметры.КлючРодителя	= пСткДанныеКоманды.КлючКоманды;
	
	ЗафиксироватьИтогиАукциона_СозданиеКоманды(сткПараметры);		
КонецПроцедуры

#КонецОбласти

#Область ЗафиксироватьИтогиАукциона

Процедура ЗафиксироватьИтогиАукциона_Реализация(пСткДанныеКоманды, пСткВозврат)	
	// 1. Зафиксировать данные шапки (условия аукциона)
	сткПараметры = РегистрыСведений.АукДанныеШапокПодведенияИтогов.СтруктураЗаписи();
	
	сткПараметры.Аукцион		= пСткДанныеКоманды.Аукцион;
	
	ВидСообщения = ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПобеде");
	
	// 2. Создать команды оповещения участникам победителям
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",				пСткДанныеКоманды.Аукцион);
	сткПараметры.Вставить("Автоматическая", 		пСткДанныеКоманды.Автоматическая);
	сткПараметры.Вставить("КлючРодителя",			пСткДанныеКоманды.КлючКоманды);
	сткПараметры.Вставить("НомерЭтапа",				РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанныеКоманды.Аукцион).НомерЭтапа);
	
	сткПараметры.Вставить("СообщенияУчастникам",	ДанныеРассылкиПоУчастникамПобедителям(сткПараметры, ВидСообщения));
	
	ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры); 
	
	// 3. Зафиксировать изменение статуса
	АукОбщийСервер.ПеревестиАукционВЗавершенные_(пСткДанныеКоманды.Аукцион);
	
	// 4. Если команда автоматическая то сделаем служебную рассылку сотрудникам
	Если пСткДанныеКоманды.Автоматическая Тогда
		сткПараметрыОповещения = Новый Структура;
		сткПараметрыОповещения.Вставить("Аукцион",		пСткДанныеКоманды.Аукцион);
		сткПараметрыОповещения.Вставить("ВидСообщения",	ВидСообщения);
		
		сткПараметры.Вставить("СообщенияАвторам", СообщенияАвторам_ДанныеРассылки(сткПараметрыОповещения));
		
		ОтправитьСообщениеАвтору_СозданиеКоманды(сткПараметры);
	КонецЕсли		
КонецПроцедуры

#КонецОбласти

#Область ПоместитьВАрхив

Процедура ПоместитьВАрхив_Реализация(пСткДанныеКоманды, пСткВозврат)	
	// 1. Зафиксировать изменение статуса
	АукОбщийСервер.ПоместитьАукционВАрхив_(пСткДанныеКоманды.Аукцион);	
КонецПроцедуры

#КонецОбласти

#Область ОтменитьАукцион

Функция ОтменитьАукцион_Реализация(пСткДанныеКоманды, пСткВозврат)
    // 1. Изменить статус на "Отменен"
	АукОбщийСервер.ОтменитьАукцион_(пСткДанныеКоманды.Аукцион);
	
	// 2. Создать команды оповещения всем участникам	
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
	сткПараметры.Вставить("Автоматическая", 	пСткДанныеКоманды.Автоматическая);
	сткПараметры.Вставить("КлючРодителя",		пСткДанныеКоманды.КлючКоманды);
	сткПараметры.Вставить("НомерЭтапа",			РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанныеКоманды.Аукцион).НомерЭтапа);
	
	ВидСообщения = ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОбОтменеАукциона");
	
	сткПараметры.Вставить("СообщенияУчастникам",	ДанныеРассылкиПоВсемУчастникам(пСткДанныеКоманды.Аукцион, ВидСообщения));
	
	ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
	
КонецФункции

#КонецОбласти

#Область ПолучитьДанныеОтУчастника

Процедура ПолучитьДанныеОтУчастника_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	// 1. Записать данные  в РС АукИсторияДанныхАукционов
	сткДопДанныеКоманды = пСткДанныеКоманды.ДанныеКоманды.required_data;
	
	// нужно получить тек. дату здесь, чтобы потом можно было включить в отбор, который в подтверждении
	ТекНомерЭтапа = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пСткДанныеКоманды.Аукцион).НомерЭтапа;
	ТекПериод = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_();
	ссНаправление = ПредопределенноеЗначение("Перечисление.АукНаправленияДанных.Входящие");
	
	Если сткДопДанныеКоманды.data_type = ПредопределенноеЗначение("Перечисление.АукВидыДанных.Ставка") Тогда	
		масЗаписи = РегистрыСведений.АукИсторияДанныхАукционов.СформироватьЗаписиДляДобавленияВИсторию_Ставка(пСткДанныеКоманды, сткДопДанныеКоманды.data, ТекНомерЭтапа, ТекПериод);
		
		РегистрыСведений.АукИсторияДанныхАукционов.ДобавитьЗаписи(масЗаписи);	
	ИначеЕсли сткДопДанныеКоманды.data_type = ПредопределенноеЗначение("Перечисление.АукВидыДанных.Отказ") Тогда		
		масЗаписи = РегистрыСведений.АукИсторияДанныхАукционов.СформироватьЗаписиДляДобавленияВИсторию_Отказ(пСткДанныеКоманды, сткДопДанныеКоманды.data, ТекНомерЭтапа, ТекПериод);
		
		РегистрыСведений.АукИсторияДанныхАукционов.ДобавитьЗаписи(масЗаписи);	
	ИначеЕсли сткДопДанныеКоманды.data_type = ПредопределенноеЗначение("Перечисление.АукВидыДанных.Сообщение") Тогда		
		масЗаписи = РегистрыСведений.АукИсторияДанныхАукционов.СформироватьЗаписиДляДобавленияВИсторию_Сообщение(пСткДанныеКоманды,
																												  сткДопДанныеКоманды.data,
																												  ссНаправление,
																												  ТекНомерЭтапа,
																												  ТекПериод);
		
		РегистрыСведений.АукИсторияДанныхАукционов.ДобавитьЗаписи(масЗаписи);		
	КонецЕсли;
	
	// 2. Оповестить участника о приеме данных. ВАЖНО: те данные которые мы записали в регистр
	Если сткДопДанныеКоманды.confirmation_required Тогда			
		сткПараметры = Новый Структура;
		
		сткПараметры.Вставить("Аукцион",			пСткДанныеКоманды.Аукцион);
		сткПараметры.Вставить("Период",				ТекПериод + 1);
		сткПараметры.Вставить("Автоматическая", 	пСткДанныеКоманды.Автоматическая);
		сткПараметры.Вставить("КлючРодителя",		пСткДанныеКоманды.КлючКоманды);
		сткПараметры.Вставить("НомерЭтапа",			ТекНомерЭтапа);
		
		сткПараметры.Вставить("СообщенияУчастникам",	ПолучитьДанныеОтУчастника_ДанныеРассылки(пСткДанныеКоманды, ТекПериод));
		
		ОтправитьСообщенияУчастникам_СозданиеКоманд_(сткПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтправитьСообщениеУчастнику

Процедура ОтправитьСообщениеУчастнику_Реализация(пСткДанныеКоманды, пСткВозврат)
	сткДопДанныеКоманды = пСткДанныеКоманды.ДанныеКоманды.required_data;
	
	// 1. Отправка сообщения в канал
	сткРез = Справочники.АукКаналыВзаимодействия.ОтправитьСообщениеВКанал(сткДопДанныеКоманды);
	
	Если Не сткРез.Успех Тогда
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.АукРезультатыВыполненияКоманд.ОбработанаСОшибкой");
		пСткВозврат.Комментарий	= сткРез.Результат;
	Иначе	
		// 2. Фиксируем в РС История данных аукционов
		ссНаправление = ПредопределенноеЗначение("Перечисление.АукНаправленияДанных.Исходящие");
		
		масЗаписи = РегистрыСведений.АукИсторияДанныхАукционов.СформироватьЗаписиДляДобавленияВИсторию_Сообщение(пСткДанныеКоманды,
																													сткДопДанныеКоманды.message,
																													ссНаправление,
																													сткДопДанныеКоманды.stage_number,
																													сткДопДанныеКоманды.period,
																													сткДопДанныеКоманды.data_element);
		
		РегистрыСведений.АукИсторияДанныхАукционов.ДобавитьЗаписи(масЗаписи);		
	КонецЕсли;
КонецПроцедуры

// Адаптер
//
Функция ОтправкаПростогоСообщенияУчастникам_ДанныеРассылки(пСткДанные) Экспорт
	ВидСообщения = ПредопределенноеЗначение("Перечисление.АукВидыСообщений.ПростоеСообщение");
	
	тзКонтактныеЛицаУчастников = Новый ТаблицаЗначений;
	тзКонтактныеЛицаУчастников.Колонки.Добавить("Участник",	Новый ОписаниеТипов("СправочникСсылка.АукУчастникиАукционов"));
	тзКонтактныеЛицаУчастников.Колонки.Добавить("КонтактноеЛицо",	Новый ОписаниеТипов("СправочникСсылка.АукКонтактныеЛицаУчастниковАукционов"));
	
	масУчастники = Новый Массив;
	Для Каждого ЭлМас Из пСткДанные.Адресаты Цикл
		ЗаполнитьЗначенияСвойств(тзКонтактныеЛицаУчастников.Добавить(), ЭлМас);
		
		масУчастники.Добавить(Новый Структура("Участник", ЭлМас.Участник));
	КонецЦикла;
	
	Возврат ДанныеРассылкиПоСпискуУчастников(масУчастники, пСткДанные.Аукцион, ВидСообщения, тзКонтактныеЛицаУчастников, пСткДанные.ТекстСообщения)	
КонецФункции	

#КонецОбласти

#Область ОтправитьСообщениеАвтору

Процедура ОтправитьСообщениеАвтору_Реализация(пСткДанныеКоманды, пСткВозврат)
	
	сткДопДанныеКоманды = пСткДанныеКоманды.ДанныеКоманды.required_data;
	
	сткРез = Справочники.АукКаналыВзаимодействия.ОтправитьСообщениеВКанал(сткДопДанныеКоманды);
	
	Если Не сткРез.Успех Тогда
		пСткВозврат.Успех		= Ложь;
		пСткВозврат.Результат	= ПредопределенноеЗначение("Перечисление.АукРезультатыВыполненияКоманд.ОбработанаСОшибкой");
		пСткВозврат.Комментарий	= сткРез.Результат;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ВыполнениеПроверокКорректностиКоманды

Функция ПроверитьВозможностьВыполненияКомандыПоАукциону(пСткДанныеКоманды)
	
	Если пСткДанныеКоманды.Команда = "AutoCheckStartAuction" Тогда
		
		Возврат АвтоПроверкаНачатьАукцион_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "StartAuction" Тогда		
		
		Возврат НачатьАукцион_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "AutoCheckEnterInterimSummary" Тогда		
		
		Возврат АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "EnterInterimSummary" Тогда	
		
		Возврат ПерейтиКПодведениюПромежуточныхИтогов_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "AutoCheckSummarizeInterimResults" Тогда		
		
		Возврат АвтоПроверкаПодвестиПромежуточныеИтоги_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CalculateInterimResults" Тогда		
		
		Возврат РассчитатьПромежуточныеИтоги_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "RecordInterimResults" Тогда		
		
		Возврат ЗафиксироватьПромежуточныеИтоги_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);	
		
	ИначеЕсли пСткДанныеКоманды.Команда = "AutoCheckEnterSummarizeTotalResults" Тогда		
		
		Возврат АвтоПроверкаПерейтиКПодведениюИтогов_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "EnterSummarizeTotalResults" Тогда		
		
		Возврат ПерейтиКПодведениюИтогов_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "AutoCheckSummarizeTotalResults" Тогда		
		
		Возврат АвтоПроверкаПодвестиИтогиАукциона_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CalculateTotalResults" Тогда		
		
		Возврат РассчитатьИтогиАукциона_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "RecordTotalResults" Тогда		
		
		Возврат ЗафиксироватьИтогиАукциона_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);
		
	ИначеЕсли пСткДанныеКоманды.Команда = "CancelAuction" Тогда		
		
		Возврат ОтменитьАукцион_ВыполнениеВозможно(пСткДанныеКоманды.Аукцион);	
			
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции	

Функция ПроверитьСоответсвиеДанныхКомандыСДаннымиБазы(пСткДанныеКоманды)
	
	// 1. Проверка наличия в базе аукциона по УИДу
	ссАукцион = АукОбщийСервер.СсылкаОбъектаПоУИД(Тип("СправочникСсылка.АукАукционы"), пСткДанныеКоманды.auction);
	
	Если Не ЗначениеЗаполнено(ссАукцион) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Ошибка получения ссылки на аукцион'"));	
	Иначе
		пСткДанныеКоманды.auction = ссАукцион;	
	КонецЕсли; 
	
	// 2. Проверка дополнительных данных на предмет наличия в базе (если ссылочные)
	Возврат ПроверитьДополнительныеДанныеКоманды(пСткДанныеКоманды);
	
КонецФункции

Функция ВыполнитьПроверкуДанныхКомандыИзСтрокиJSON(пСтрДанныеJSON)
	
	// 1. Пытаемся преобразовать JSON в значение	
	Попытка	
		сткДанные = АукОбщийКлиентСервер.JSONВЗначение(пСтрДанныеJSON,, "period,bid_date");	
	Исключение		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка преобразования JSON.%1Описание ошибки: %2.%1Строка JSON: %3'"),
									Символы.ПС, ОписаниеОшибки(), пСтрДанныеJSON);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);	
	КонецПопытки;
	
	// 2. Проверяем наличие и заполненность обязательных полей "command" и "auction"
	сткРез = АукУправлениеАукционамиКлиентСервер.ПроверкаОбязательныхСвойствВДанныхКоманды(сткДанные);
	
	Если Не сткРез.Успех Тогда	
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка данных команды.%1Описание ошибки: %2.%1Строка JSON: %3'"),
									Символы.ПС, сткРез.Результат, пСтрДанныеJSON);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);	
	КонецЕсли;
	
	// 3. Команда понятна.
	Если Не ЕстьТакаяКоманда(сткДанные.command) Тогда
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Нет такой команды.%1Строка JSON: %2'"), Символы.ПС, пСтрДанныеJSON);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);	
	КонецЕсли;	
	
	// 4. Проверяем структуру данных команды, наличие обязательных полей
	сткРез = ПроверитьСтруктуруДополнительныхДанныхКоманды(сткДанные);
	
	Если Не сткРез.Успех Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка данных команды.%1Описание ошибки: %2.%1Строка JSON: %3'"),
									Символы.ПС, сткРез.Результат, пСтрДанныеJSON);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);	
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех(сткДанные);
		
КонецФункции	

#КонецОбласти

#Область ПроверкиПолнотыДанных

Функция ЕстьТакаяКоманда(пСтрКоманда)

	масВсеКоманды = Перечисления.АукКоманды.ВсеКомандыВJSONПредставлении();
	
	Возврат масВсеКоманды.Найти(пСтрКоманда) <> Неопределено;
	
КонецФункции

Функция ПроверитьДополнительныеДанныеКоманды(пСткДанныеКоманды)	
	Если пСткДанныеКоманды.command = "SendMessageToParticipant" Тогда
		
		Возврат ПроверитьДополнительныеДанныеКоманды_ОтправитьСообщенияУчастникам(пСткДанныеКоманды);
		
	ИначеЕсли пСткДанныеКоманды.command = "SendMessageToAuthor" Тогда
		
		Возврат ПроверитьДополнительныеДанныеКоманды_ОтправитьСообщениеАвтору(пСткДанныеКоманды);
		
	ИначеЕсли пСткДанныеКоманды.command = "GetDataFromParticipant" Тогда	
		
		Возврат ПроверитьДополнительныеДанныеКоманды_ПолучитьДанныеОтУчастника(пСткДанныеКоманды);
		
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
КонецФункции

// ВАЖНО: структура ставки преобразуется в соответствие, чтобы ключом мог быть любой тип данных
//
Функция ПроверитьДополнительныеДанныеКоманды_ПолучитьДанныеОтУчастника(пСткДанныеКоманды)	
	сткОбязательныеДанные = пСткДанныеКоманды.required_data;
	
	ссВидДанных = XMLЗначение(Тип("ПеречислениеСсылка.АукВидыДанных"), сткОбязательныеДанные.data_type);
	
	Если ссВидДанных = Неопределено Тогда
		Возврат ЭдоОбщий._Ошибка(СтрШаблон(НСтр("ru = 'Неизвестный тип данных <%1>'"), сткОбязательныеДанные.data_type));	
	Иначе
		сткОбязательныеДанные.data_type = ссВидДанных;	
	КонецЕсли; 
	
	// Для вида данных Сообщение не требуется оповещение участника о приеме
	Если ссВидДанных <> ПредопределенноеЗначение("Перечисление.АукВидыДанных.Сообщение") Тогда
		
		ссВидСообщения = XMLЗначение(Тип("ПеречислениеСсылка.АукВидыСообщений"), сткОбязательныеДанные.message_type);
		
		Если ссВидСообщения = Неопределено Тогда
			Возврат ЭдоОбщий._Ошибка(СтрШаблон(НСтр("ru = 'Неизвестный тип данных <%1>'"), сткОбязательныеДанные.message_type));	
		Иначе
			сткОбязательныеДанные.message_type = ссВидСообщения;	
		КонецЕсли; 
		
	КонецЕсли;	
	
	Если ссВидДанных = ПредопределенноеЗначение("Перечисление.АукВидыДанных.Ставка") Тогда	
		// Преобразуем технические наименования элементов ставки в ссылки
		ссВидАукциона = Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткДанныеКоманды.auction).ВидАукциона;
		
		масНастройкиСтавки = Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(ссВидАукциона);
		
		масДанныеСтавкиТек = сткОбязательныеДанные.data;
		
		масОшибки = Новый Массив;
		масДанныеСтавкиНов = Новый Массив;
		Для Каждого ЭлементСтавки Из масДанныеСтавкиТек Цикл
			сооСтавка = Новый Соответствие;
			
			Для Каждого ЭлНастройка Из масНастройкиСтавки Цикл
				
				Если ЭлементСтавки.Свойство(ЭлНастройка.ТехническоеНаименование) Тогда
					ТипЗначенияЭлементаСтавки = ЭлНастройка.ТипЗначения.Типы()[0];
					
					Если ОбщегоНазначения.ЭтоСсылка(ТипЗначенияЭлементаСтавки) Тогда
						
						ЗначениеЭлементаСтавкиСсылка = АукОбщийСервер.СсылкаОбъектаПоУИД(ТипЗначенияЭлементаСтавки, ЭлементСтавки[ЭлНастройка.ТехническоеНаименование]);
						
						Если Не ЭлНастройка.НеОбязательный И Не ЗначениеЗаполнено(ЗначениеЭлементаСтавкиСсылка) Тогда
							стрТекстОшибки = СтрШаблон(НСтр("ru = 'Для обязательного элемента ставки <%1> не было получено значение из базы по УИДу <%2>'"),
																	ЭлНастройка.ТехническоеНаименование, ЭлементСтавки[ЭлНастройка.ТехническоеНаименование]);
							
							масОшибки.Добавить(стрТекстОшибки);	
						Иначе
							сооСтавка.Вставить(ЭлНастройка.Элемент, ЗначениеЭлементаСтавкиСсылка);	
						КонецЕсли;
						
					Иначе
						сооСтавка.Вставить(ЭлНастройка.Элемент, XMLЗначение(ТипЗначенияЭлементаСтавки, ЭлементСтавки[ЭлНастройка.ТехническоеНаименование]));	
					КонецЕсли;
					
				Иначе		
					масОшибки.Добавить(СтрШаблон(НСтр("ru = 'Отсутсвует элемент ставки ""%1""'"), ЭлНастройка.ТехническоеНаименование));	
				КонецЕсли;	
				
			КонецЦикла;
			
			масДанныеСтавкиНов.Добавить(сооСтавка);
		КонецЦикла;
		
		сткОбязательныеДанные.data = масДанныеСтавкиНов;
		
		Если масОшибки.Количество() <> 0 Тогда
			Возврат ЭдоОбщий._Ошибка(СтрСоединить(масОшибки, Символы.ПС));	
		КонецЕсли;	
	КонецЕсли;
			
	Возврат ЭдоОбщий._Успех();
КонецФункции

Функция ПроверитьДополнительныеДанныеКоманды_ОтправитьСообщенияУчастникам(пСткДанныеКоманды)	
	сткОбязательныеДанные = пСткДанныеКоманды.required_data;
	
	ссКанал = АукОбщийСервер.СсылкаОбъектаПоУИД(Тип("СправочникСсылка.АукКаналыВзаимодействия"), сткОбязательныеДанные.channel);
	
	Если Не ЗначениеЗаполнено(ссКанал) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Ошибка получения ссылки на канал взаимодействия'"));	
	Иначе
		сткОбязательныеДанные.channel = ссКанал;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(сткОбязательныеДанные.message) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'В данных команды отсутствует текст сообщения'"));	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(сткОбязательныеДанные.channel_settings) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'В данных команды отсутствуют настройки канала взаимодействия'"));	
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
КонецФункции	

Функция ПроверитьДополнительныеДанныеКоманды_ОтправитьСообщениеАвтору(пСткДанныеКоманды)	
	сткОбязательныеДанные = пСткДанныеКоманды.required_data;
	
	ссКанал = АукОбщийСервер.СсылкаОбъектаПоУИД(Тип("СправочникСсылка.АукКаналыВзаимодействия"), сткОбязательныеДанные.channel);
	
	Если Не ЗначениеЗаполнено(ссКанал) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Ошибка получения ссылки на канал взаимодействия'"));	
	Иначе
		сткОбязательныеДанные.channel = ссКанал;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(сткОбязательныеДанные.message) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Тема письма для служебного оповещения отсутствует'"));	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(сткОбязательныеДанные.channel_settings) Тогда
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'В данных команды отсутствуют настройки канала взаимодействия'"));	
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
КонецФункции

Функция ПроверитьСтруктуруДополнительныхДанныхКоманды(пСткДанныеКоманды)
	
	стрКоманда = пСткДанныеКоманды.command; 
	
	Если стрКоманда = "SendMessageToAuthor" Тогда	
		
		Возврат ВалидацияДополнительныхДанных(пСткДанныеКоманды,
					АукУправлениеАукционамиКлиентСервер.ОтправитьСообщениеАвтору_ОписаниеСтруктурыОбязательныхДанных());
		
	ИначеЕсли стрКоманда = "SendMessageToParticipant" Тогда	
		
		Возврат ВалидацияДополнительныхДанных(пСткДанныеКоманды,
					АукУправлениеАукционамиКлиентСервер.ОтправитьСообщениеУчастнику_ОписаниеСтруктурыОбязательныхДанных());
		
	ИначеЕсли стрКоманда = "GetDataFromParticipant" Тогда	
		
		Возврат ВалидацияДополнительныхДанных(пСткДанныеКоманды,
					АукУправлениеАукционамиКлиентСервер.ПолучениеДанныхОтУчастника_ОписаниеСтруктурыОбязательныхДанных());
					
	ИначеЕсли стрКоманда = "AutoCheckEnterInterimSummary" Тогда				
		
		Возврат ВалидацияДополнительныхДанных(пСткДанныеКоманды,
					АукУправлениеАукционамиКлиентСервер.АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_ОписаниеСтруктурыОбязательныхДанных());
		
	КонецЕсли;
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ВалидацияДополнительныхДанных(пСткДанныеКоманды, пПоляДопДанных)

	Если Не пСткДанныеКоманды.Свойство("required_data") Тогда
		
		Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'Отсутствуют обязательные данные ""required_data""'"));
		
	КонецЕсли;
	
	Возврат АукУправлениеАукционамиКлиентСервер.ПроверкаДополнительныхСвойствВДанныхКомандыПоСписку(пСткДанныеКоманды.required_data, пПоляДопДанных);
	
КонецФункции	

#КонецОбласти

#Область ПроверкиВозможностейВыполненияКоманд

Функция АвтоПроверкаНачатьАукцион_ВыполнениеВозможно(пАукцион)
			
	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Новый") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить старт аукциона'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;
		
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция НачатьАукцион_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.Новый") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить старт аукциона'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить переход на следующий этап'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ПерейтиКПодведениюПромежуточныхИтогов_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить переход на следующий этап'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция АвтоПроверкаПодвестиПромежуточныеИтоги_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение промежуточных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция РассчитатьПромежуточныеИтоги_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение промежуточных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ЗафиксироватьПромежуточныеИтоги_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение промежуточных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция АвтоПроверкаПерейтиКПодведениюИтогов_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение окончательных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции 

Функция ПерейтиКПодведениюИтогов_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение окончательных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция АвтоПроверкаПодвестиИтогиАукциона_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение окончательных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция РассчитатьИтогиАукциона_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение окончательных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ЗафиксироватьИтогиАукциона_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеИтогов") Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить подведение окончательных итогов'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

Функция ОтменитьАукцион_ВыполнениеВозможно(пАукцион)

	сткТекСостояниеАукциона = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(пАукцион);
	
	Если сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап")
		 И сткТекСостояниеАукциона.Статус <> ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов")
	Тогда
		
		стрТекстОшибки = СтрШаблон(НСтр("ru = 'Текущий статус аукциона <%1> не позволяет выполнить отмену аукциона'"), сткТекСостояниеАукциона.Статус);
		
		Возврат ЭдоОбщий._Ошибка(стрТекстОшибки);
		
	КонецЕсли;	
	
	Возврат ЭдоОбщий._Успех();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Адаптер
//
Функция ПолучитьДанныеОтУчастника_ДанныеРассылки(пСткДанныеКоманды, пТекПериод)
	сткДанныеУчастника = Новый Структура;
	сткДанныеУчастника.Вставить("Участник",	пСткДанныеКоманды.Участник);
	сткДанныеУчастника.Вставить("Период",	пТекПериод);
	
	масУчастники = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(сткДанныеУчастника);
	
	ВидСообщения = пСткДанныеКоманды.ДанныеКоманды.required_data.message_type;
	
	тзКонтактныеЛицаУчастников = Новый ТаблицаЗначений;
	тзКонтактныеЛицаУчастников.Колонки.Добавить("Участник",	Новый ОписаниеТипов("СправочникСсылка.АукУчастникиАукционов"));
	тзКонтактныеЛицаУчастников.Колонки.Добавить("КонтактноеЛицо",	Новый ОписаниеТипов("СправочникСсылка.АукКонтактныеЛицаУчастниковАукционов"));
	
	НовСтрока = тзКонтактныеЛицаУчастников.Добавить();
	НовСтрока.Участник = пСткДанныеКоманды.Участник;
	НовСтрока.КонтактноеЛицо = пСткДанныеКоманды.КонтактноеЛицо;
	
	Возврат ДанныеРассылкиПоСпискуУчастников(масУчастники, пСткДанныеКоманды.Аукцион, ВидСообщения, тзКонтактныеЛицаУчастников) 
КонецФункции

// Адаптер
//
Функция ДанныеРассылкиПоУчастникамПобедителям(пСткПараметры, пВидСообщения)	
	Если Не АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		масДанныеПобедителей = РегистрыСведений.АукДанныеТаблицПодведенияИтогов.СведенияОПобедителяхАукциона(пСткПараметры.Аукцион);
	Иначе
		масДанныеПобедителей = РегистрыСведений.АукРасчетИтоговРезультаты.ПобедителиАукционаПоРезультатамРасчета(пСткПараметры.Аукцион, пСткПараметры.НомерЭтапа);	
	КонецЕсли;	
	
	Возврат ДанныеРассылкиПоСпискуУчастников(масДанныеПобедителей, пСткПараметры.Аукцион, пВидСообщения) 
КонецФункции

Функция ДанныеРассылкиПоВсемУчастникам(пАукцион, пВидСообщения)
	масУчастники = Справочники.АукАукционы.УчастникиАукциона(пАукцион, Истина);
	
	Возврат ДанныеРассылкиПоСпискуУчастников(масУчастники, пАукцион, пВидСообщения) 
КонецФункции

Функция ДанныеРассылкиПоСпискуУчастников(пМасУчастники, пАукцион, пВидСообщения, пТзКонтактныеЛицаУчастников = Неопределено, пТекстСообщения = "")
	Если пТзКонтактныеЛицаУчастников = Неопределено Тогда
		пТзКонтактныеЛицаУчастников = Справочники.АукАукционы.КонтактныеЛицаСПривязкойКУчастникам(пАукцион);
	КонецЕсли;
	
	масКонтактныеЛица = пТзКонтактныеЛицаУчастников.ВыгрузитьКолонку("КонтактноеЛицо");
	
	// 2. Канал взаимодействия + настройки
	сооРез = Справочники.АукКонтактныеЛицаУчастниковАукционов.ТекущиеКонтактныеДанныеКонтактныхЛиц(масКонтактныеЛица);
	
	// 3. Ключевые данные аукциона
	сткКлючевыеДанныеАукциона = Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион);
	
	// 4. Получаем шаблоны текста и заголовка из РС АукШаблоныСообщений для каждого участника. Они могут быть разные
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("ВидСообщения",		пВидСообщения);
	сткОтбор.Вставить("ВидАукциона",		сткКлючевыеДанныеАукциона.ВидАукциона);
	сткОтбор.Вставить("Участники",			ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(пМасУчастники, "Участник", Истина));
	
	сооШаблоныСообщений = РегистрыСведений.АукШаблоныСообщений.ШаблонСообщенияУчастникуПоОтбору(сткОтбор);
	
	// 5. Из всех шаблонов нужно извлечь Параметры (вида [ТЕКСТ_ТЕКСТ]), чтобы получить их значения
	// параметры условно можно разделить на 2 категории: "Общие" и "Индивидуальные".
	// Для получения значений "общих" достаточно ссылки на аукцион. Их мы сразу отбираем и ищем по ним значения
	// Для получения значений "индивидуальных" нужны индивидуальные значения типа Участник, Контактное лицо и т.д.
	масПараметрыОбщие = Новый Массив;

	Для Каждого СткЭлСоо Из сооШаблоныСообщений Цикл
		СткЭлСоо.Значение.Шаблон = ?(ЗначениеЗаполнено(пТекстСообщения), пТекстСообщения, СткЭлСоо.Значение.Шаблон);
		
		сткПараметрыШаблонов = РегистрыСведений.АукШаблоныСообщений.ПараметрыШаблоновПоШаблону(
																СткЭлСоо.Значение.Шаблон + " " + СткЭлСоо.Значение.Заголовок);
		
		СткЭлСоо.Значение.Вставить("ПараметрыШаблонов", сткПараметрыШаблонов);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(масПараметрыОбщие, сткПараметрыШаблонов.Общие, Истина);
	КонецЦикла;
	
	// 6. Получение значений общих параметров
	сткПараметрыДанных = Новый Структура;
	сткПараметрыДанных.Вставить("Аукцион",			пАукцион);
	сткПараметрыДанных.Вставить("КлючевыеДанные",	сткКлючевыеДанныеАукциона);
	
	сооЗначПараметровШаблоновОбщие = АукОбщийСервер.ЗначенияПараметровШаблонов_Общие(масПараметрыОбщие, сткПараметрыДанных); 
		
	масРезультат = Новый Массив;
	Для Каждого сткЭлУчастник Из пМасУчастники Цикл
		масСтрокиТзУчастники = пТзКонтактныеЛицаУчастников.НайтиСтроки(Новый Структура("Участник", сткЭлУчастник.Участник));
		
		Для Сч_ = 0 По масСтрокиТзУчастники.ВГраница() Цикл	
			сткДанныеСообщения = ДанныеСообщенияПоКонтактномЛицу(масСтрокиТзУчастники, сткЭлУчастник, сооШаблоныСообщений,
																		сооЗначПараметровШаблоновОбщие, сткПараметрыДанных, сооРез, Сч_);
			
			масРезультат.Добавить(сткДанныеСообщения);	
		КонецЦикла;	
	КонецЦикла;
	
	Возврат масРезультат;	
КонецФункции	

Функция ДанныеСообщенияПоКонтактномЛицу(пМасСтрокиТзУчастники, пСткЭлУчастник, пСооШаблоныСообщений, пСооЗначПараметровШаблоновОбщие, пСткПараметрыДанных, пСооРез, пСч_)
	сткДанныеСообщения = Новый Структура;
	
	сткДанныеСообщения.Вставить("Участник",			пСткЭлУчастник.Участник);
	сткДанныеСообщения.Вставить("КонтактноеЛицо",	пМасСтрокиТзУчастники[пСч_].КонтактноеЛицо);
	сткДанныеСообщения.Вставить("СтрокаДанных",		пСч_);
	
	Если пСооШаблоныСообщений <> Неопределено Тогда
		сткНастройкиСообщения = пСооШаблоныСообщений.Получить(пСткЭлУчастник.Участник);
		
		сткДанныеСообщения.Вставить("ТекстСообщения",	сткНастройкиСообщения.Шаблон);
		сткДанныеСообщения.Вставить("ТемаСообщения",	сткНастройкиСообщения.Заголовок);
		
		масРез = Новый Массив;
		
		// 1. Обработаем значения общих параметров
		Для Каждого ЭлМас Из сткНастройкиСообщения.ПараметрыШаблонов.Общие Цикл
			масРез.Добавить(Новый Структура("NameParam, ValueParam", ЭлМас, пСооЗначПараметровШаблоновОбщие.Получить(ЭлМас)));	
		КонецЦикла;
		
		пСткПараметрыДанных.Вставить("Участник",		сткДанныеСообщения.Участник);
		пСткПараметрыДанных.Вставить("КонтактноеЛицо",	сткДанныеСообщения.КонтактноеЛицо);
		
		Если пСткЭлУчастник.Свойство("СтрокаДанных") Тогда
			пСткПараметрыДанных.Вставить("СтрокаДанных",	пСткЭлУчастник.СтрокаДанных);	
		КонецЕсли;
		
		Если пСткЭлУчастник.Свойство("Период") Тогда
			пСткПараметрыДанных.Вставить("Период",	пСткЭлУчастник.Период);	
		КонецЕсли;
		
		// 2. Получим и обработаем индивидуальные параметры
		Если сткНастройкиСообщения.ПараметрыШаблонов.Индивидуальные.Количество() <> 0 Тогда
			сооЗначПараметровШаблоновИндив = АукОбщийСервер.ЗначенияПараметровШаблонов_Индивидуальные(сткНастройкиСообщения.ПараметрыШаблонов.Индивидуальные,
																										пСткПараметрыДанных);
			
			Для Каждого ЭлМас Из сткНастройкиСообщения.ПараметрыШаблонов.Индивидуальные Цикл
				масРез.Добавить(Новый Структура("NameParam, ValueParam", ЭлМас, сооЗначПараметровШаблоновИндив.Получить(ЭлМас)));	
			КонецЦикла;
		КонецЕсли;
		
		сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", масРез);
		
	Иначе
		сткДанныеСообщения.Вставить("ТекстСообщения",	Неопределено);
		сткДанныеСообщения.Вставить("ТемаСообщения",	Неопределено);
		сткДанныеСообщения.Вставить("ЗначенияПараметровШаблонов", Неопределено);
	КонецЕсли;	
	
	сткДанныеКанала = пСооРез.Получить(пМасСтрокиТзУчастники[пСч_].КонтактноеЛицо);
	
	Если сткДанныеКанала <> Неопределено Тогда
		сткДанныеСообщения.Вставить("Канал",			сткДанныеКанала.КаналВзаимодействия);
		сткДанныеСообщения.Вставить("НастройкиКанала",	сткДанныеКанала.НастройкиКаналаВзаимодействия);
	Иначе
		сткДанныеСообщения.Вставить("Канал",			Неопределено);
		сткДанныеСообщения.Вставить("НастройкиКанала",	Неопределено);
	КонецЕсли;
	
	Возврат сткДанныеСообщения;
КонецФункции

Функция СообщенияАвторам_ДанныеРассылки(пСткПараметрыОповещения)
	сткДанныеРассылки = Новый Структура("ТемаСообщения, ТекстСообщения, ЗначенияПараметровШаблонов",,, Новый Массив);
	
	// 1. Получаем шаблон из РС АукШаблоныСообщений
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("ВидСообщения",	пСткПараметрыОповещения.ВидСообщения);
	сткОтбор.Вставить("ВидАукциона",	Справочники.АукАукционы.КлючевыеДанныеАукциона(пСткПараметрыОповещения.Аукцион).ВидАукциона);
	
	сткШаблоны = РегистрыСведений.АукШаблоныСообщений.ШаблонСообщенияАвторуПоОтбору(сткОтбор);
	
	Если сткШаблоны = Неопределено Тогда
		Возврат сткДанныеРассылки;	
	КонецЕсли;
	
	сткДанныеРассылки.ТемаСообщения		= сткШаблоны.Заголовок;
	сткДанныеРассылки.ТекстСообщения	= сткШаблоны.Шаблон;
	
	масПараметрыШаблонов = АукОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(сткШаблоны.Шаблон + " " + сткШаблоны.Заголовок,
																							АукОбщийКлиентСервер.Шаблон_ПараметрыШаблонаСообщения(),,, Истина);
	
	сткПараметрыШаблонов = Новый Структура;
	сткПараметрыШаблонов.Вставить("Аукцион", пСткПараметрыОповещения.Аукцион);
	
	сооЗначенияПараметровШаблонов = АукОбщийСервер.ЗначенияПараметровШаблонов_Общие(масПараметрыШаблонов, сткПараметрыШаблонов);
	
	Для Каждого ЭлСоо Из сооЗначенияПараметровШаблонов Цикл
		сткДанныеРассылки.ЗначенияПараметровШаблонов.Добавить(Новый Структура("NameParam, ValueParam", ЭлСоо.Ключ, ЭлСоо.Значение));	
	КонецЦикла;
	
	Возврат сткДанныеРассылки;	
КонецФункции	

#КонецОбласти

