
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	ПодпискиНаСобытияОбъектов.ПередЗаписью_Справочник(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Автор			= ПараметрыСеанса.глТекПользователь;
		ДатаСоздания	= ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_();
	Иначе
		АвторИзменения	= ПараметрыСеанса.глТекПользователь;
		ДатаИзменения	= ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_(); 
	КонецЕсли;	
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	СохранитьСнимокТекущегоСостоянияАукциона();
	
	ПодпискиНаСобытияОбъектов.ПередЗаписьюПосле_Справочник(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ПодпискиНаСобытияОбъектов.ПриЗаписи_Справочник(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьСтатусНовогоАукциона();
	
	ПодпискиНаСобытияОбъектов.ПриЗаписиПосле_Справочник(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.Автор			= Неопределено;
	ЭтотОбъект.ДатаСоздания		= Дата("00010101");
	
	ЭтотОбъект.АвторИзменения	= Неопределено;
	ЭтотОбъект.ДатаИзменения	= Дата("00010101");	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗафиксироватьСтатусНовогоАукциона()
	Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый И Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоСнимок") Тогда	
		АукОбщийСервер.ЗафиксироватьСтатусНовогоАукциона_(Ссылка);	
	КонецЕсли;	
КонецПроцедуры	

Процедура СохранитьСнимокТекущегоСостоянияАукциона()

	Если ТребуетсяСохранитьСнимокТекущегоСостоянияАукциона() Тогда
			
		Справочники.АукАукционы.СоздатьСнимокТекущегоАукциона(Ссылка.ПолучитьОбъект());
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТребуетсяСохранитьСнимокТекущегоСостоянияАукциона()
	
	Возврат Не ЭтоНовый()
			И ЭтотОбъект.ДополнительныеСвойства.Свойство("ДанныеМодифицированы")
		 	И ЭтотОбъект.ДополнительныеСвойства.ДанныеМодифицированы
		 	И Справочники.АукАукционы.ТребуетсяЗаписьВИсторию(Ссылка);
	
КонецФункции

#КонецОбласти



