
#Область ПрограммныйИнтерфейс

Функция СуществуетЭлементСТехническимНаименованием(пТекущийОбъект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АукЭлементыНастроекКаналовВзаимодействия.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.АукЭлементыНастроекКаналовВзаимодействия КАК АукЭлементыНастроекКаналовВзаимодействия
	|ГДЕ
	|	АукЭлементыНастроекКаналовВзаимодействия.ТехническоеНаименование = &ТехническоеНаименование
	|	И АукЭлементыНастроекКаналовВзаимодействия.Ссылка <> &ТекущийЭлемент";
	
	Запрос.УстановитьПараметр("ТехническоеНаименование",	пТекущийОбъект.ТехническоеНаименование);
	Запрос.УстановитьПараметр("ТекущийЭлемент",				пТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция СуществуетЭлементСНаименованием(пТекущийОбъект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АукЭлементыНастроекКаналовВзаимодействия.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.АукЭлементыНастроекКаналовВзаимодействия КАК АукЭлементыНастроекКаналовВзаимодействия
	|ГДЕ
	|	АукЭлементыНастроекКаналовВзаимодействия.Наименование = &Наименование
	|	И АукЭлементыНастроекКаналовВзаимодействия.Ссылка <> &ТекущийЭлемент";
	
	Запрос.УстановитьПараметр("Наименование",	пТекущийОбъект.Наименование);
	Запрос.УстановитьПараметр("ТекущийЭлемент",	пТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ЭлементНастроекПоТехническомуНаименованию(пТехническоеНаименование) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукЭлементыНастроекКаналовВзаимодействия.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.АукЭлементыНастроекКаналовВзаимодействия КАК АукЭлементыНастроекКаналовВзаимодействия
	|ГДЕ
	|	АукЭлементыНастроекКаналовВзаимодействия.ТехническоеНаименование = &ТехническоеНаименование";
	
	Запрос.УстановитьПараметр("ТехническоеНаименование", пТехническоеНаименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции	

#КонецОбласти