
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ПодпискиНаСобытияФорм.РегистрСведений_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияФорм.РегистрСведений_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ПодпискиНаСобытияФормКлиент.РегистрСведений_ПриОткрытии(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияФормКлиент.РегистрСведений_ПослеОткрытия(ЭтотОбъект, Отказ);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти


