
#Область ПрограммныйИнтерфейс

Функция ИмяКомандыДляЗаписиВJSONПоСсылке(пСсВидКоманды) Экспорт
		
	Возврат Метаданные.Перечисления.АукКоманды.ЗначенияПеречисления.Получить(Индекс(пСсВидКоманды)).Комментарий; 
	
КонецФункции

Функция ВсеКомандыВJSONПредставлении() Экспорт
	
	масКоманды = Новый Массив;
	
	Для Каждого ЭлЗначение Из Метаданные.Перечисления.АукКоманды.ЗначенияПеречисления Цикл
		
		масКоманды.Добавить(ЭлЗначение.Комментарий);
		
	КонецЦикла;
	
	Возврат масКоманды;
	
КонецФункции

#КонецОбласти