
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.РегистрСведений_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.РегистрСведений_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ПодпискиНаСобытияФормКлиент.РегистрСведений_ПриОткрытии(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияФормКлиент.РегистрСведений_ПослеОткрытия(ЭтотОбъект, Отказ);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачальнаяИнициализация()
	ЭтотОбъект.ПараметрыШаблонов = Новый ФиксированноеСоответствие(РегистрыСведений.АукШаблоныСообщений.ОписаниеПараметровШаблонов());
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	масПараметры = АукОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(ТекущийОбъект.ТекстЗаголовка + " " + ТекущийОбъект.ТекстШаблона,
																								АукОбщийКлиентСервер.Шаблон_ВалидацияПараметовШаблонаСообщения(),,, Истина);
																								
	масНеверныеПараметры = Новый Массив;																							
	
	Для Каждого ЭлПараметр Из масПараметры Цикл
		Если ЭтотОбъект.ПараметрыШаблонов.Получить(ЭлПараметр) = Неопределено Тогда
			масНеверныеПараметры.Добавить(ЭлПараметр);	
		КонецЕсли;	
	КонецЦикла;
	
	Если масНеверныеПараметры.Количество() <> 0 Тогда
		стрСообщение = СтрШаблон(НСтр("ru = 'В шаблонах заголовка и текста присутствуют некорректные параметры: %1'"), СтрСоединить(масНеверныеПараметры, ","));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(стрСообщение,,,, Отказ);	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
