
// Отправляет почтовое сообщение, используя корпоративный почтовый сервер, либо заданные параметры отправки.
// Функция может вызвать исключение, которое требуется обработать. Отсутствие исключения означает успешность отправки письма.
//
// Параметры:
//  Письмо                 - ИнтернетПочтовоеСообщение         - Почтовое сообщение к отправке.
//                         - Структура                         - Структура, описывающая письмо к отправке.
//                                                               См. Рассылки.НовоеПисьмо().
//
//  Аккаунт                - Строка                            - Будет использован аккаунт рассылки с указанным Идентификатором и корпоративный почтовый сервер.
//                         - СправочникСсылка.АккаунтыРассылки - Будет использован указаный аккаунт рассылки и корпоративный почтовый сервер.
//                         - Неопределено                      - Будет использован Основной аккаунт рассылки и корпоративный почтовый сервер.
//                         - Структура                         - Только для отправки через внешний почтовый сервер. Позволяет задать собственные параметры подключения.
//                                                               Описание структуры см. Обработка.РаботаСПочтовымСерверомКомпании.ДанныеSMTPПодключенияПоАккаунтуРассылки().
//
//  ДопПараметры           - Неопределено                      - Дополнительные параметры не используются.
//                         - Структура                         - См Рассылки.НовыеПараметрыОтправки().
//
// Возвращаемое значение:
//  Структура:
//  * ИдентификаторПисьма - Строка                           - Уникальный идентификатор отправленного письма.
//  * ОшибочныеПолучатели - Соответствие                     - См. синтаксис-помощник, возвращаемое значение метода ИнтернетПочта.Послать().
//
Функция ОтправитьПисьмо(Письмо, Аккаунт = Неопределено, ДопПараметры = Неопределено) Экспорт
	
	ПрофильОтправки = Новый ИнтернетПочтовыйПрофиль;
	ПрофильОтправки.АутентификацияSMTP	= СпособSMTPАутентификации.Login;
	ПрофильОтправки.АдресСервераSMTP	= "smtp.mail.ru";
	ПрофильОтправки.ПортSMTP         	= 465;
	ПрофильОтправки.ПользовательSMTP	= "zuker_gta@mail.ru";
	ПрофильОтправки.ПарольSMTP			= "diIZ6jZJdzGwaGpfofv1";
	ПрофильОтправки.ИспользоватьSSLSMTP	= Истина;
	
	Почта = Новый ИнтернетПочта;
	Почта.Подключиться(ПрофильОтправки);
	
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.ИмяОтправителя = "zuker_gta@mail.ru";
	Сообщение.Отправитель = "zuker_gta@mail.ru";
	Сообщение.Тема = Письмо.Тема;
	
	Для Каждого ЭлПолучатель Из Письмо.Получатели Цикл
		Сообщение.Получатели.Добавить(ЭлПолучатель);	
	КонецЦикла;	
	
	Сообщение.Тексты.Добавить(Письмо.Текст, ТипТекстаПочтовогоСообщения.HTML);
	
	Почта.Послать(Сообщение);	
	Почта.Отключиться();
	
	Результат = Новый Структура();
	Результат.Вставить("РезультатыОтправки", Новый Массив());
	Результат.Вставить("НеотправленныеПисьма", Новый Массив());
	Результат.Вставить("ТекстОшибки", "");
	
	//РаботаСПочтой = РассылкиПовтИсп.ОбъектРаботыСПочтой();
	//Результат = РаботаСПочтой.ОтправитьПисьмо(Письмо, Аккаунт, ДопПараметры);
	
	Возврат Результат;
	
КонецФункции