
// Функция - Эл почта пользователя
//
// Возвращает электронную почту прикладного пользователя с учетов хранения в СПД
//
// Параметры:
//  Пользователи - Массив, СправочникСсылка.Пользователи - 
// 
// Возвращаемое значение:
//   - ТаблицаЗначений
//
Функция ЭлПочтаПользователя(Пользователи) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Пользователь",	Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Результат.Колонки.Добавить("ЭлПочта",		Новый ОписаниеТипов("Строка"));
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СписокПользователи", Пользователи);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.ЭлПочта КАК ЭлПочта
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка В(&СписокПользователи)";
	
	ТЗДанные = Запрос.Выполнить().Выгрузить();
	
	//СоответствиеПД_ЭлПочта = ХранилищеПерсональныхДанных.ПолучитьДанныеПоКлючам(ТЗДанные.ВыгрузитьКолонку("ЭлПочта"));
	
	Для Каждого СтрокаТЗДанные Из ТЗДанные Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Пользователь = СтрокаТЗДанные.Пользователь;
		
		//ЭлПочта = СоответствиеПД_ЭлПочта.Получить(СтрокаТЗДанные.ЭлПочта);		
		//Если НЕ ЗначениеЗаполнено(ЭлПочта) Тогда
		//	ЭлПочта = СтрокаТЗДанные.ЭлПочта;
		//КонецЕсли;
		
		НоваяСтрока.ЭлПочта = СтрокаТЗДанные.ЭлПочта;	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции