
#Область ПрограммныйИнтерфейс

Функция ДанныеНастройкиРасчетаИтоговАукциона(пНастройкаРасчетаИтога) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукНастройкиРасчетовИтогов.Ссылка КАК НастройкаРасчетаИтогов,
	|	АукНастройкиРасчетовИтогов.Формула КАК Формула,
	|	АукНастройкиРасчетовИтогов.ШаблонРезультата КАК ШаблонРезультата,
	|	АукНастройкиРасчетовИтогов.ВидРезультата КАК ВидРезультата
	|ИЗ
	|	Справочник.АукНастройкиРасчетовИтогов КАК АукНастройкиРасчетовИтогов
	|ГДЕ
	|	АукНастройкиРасчетовИтогов.Ссылка = &НастройкаРасчетаИтога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Аук_НастройкиРасчетовИтоговПеременные.Переменная КАК Переменная,
	|	Аук_НастройкиРасчетовИтоговПеременные.Редактируется КАК Редактируется
	|ИЗ
	|	Справочник.АукНастройкиРасчетовИтогов.Переменные КАК Аук_НастройкиРасчетовИтоговПеременные
	|ГДЕ
	|	Аук_НастройкиРасчетовИтоговПеременные.Ссылка = &НастройкаРасчетаИтога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Аук_НастройкиРасчетовИтоговНастройкаВыбораЗначенийПеременных.Переменная КАК Переменная,
	|	Аук_НастройкиРасчетовИтоговНастройкаВыбораЗначенийПеременных.ИсточникДанных КАК ИсточникДанных,
	|	Аук_НастройкиРасчетовИтоговНастройкаВыбораЗначенийПеременных.ЗначениеДанных КАК ЗначениеДанных,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование КАК ТехническоеНаименование,
	|	АукЭлементыДанныхАукционов.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	Справочник.АукНастройкиРасчетовИтогов.НастройкаВыбораЗначенийПеременных КАК Аук_НастройкиРасчетовИтоговНастройкаВыбораЗначенийПеременных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО Аук_НастройкиРасчетовИтоговНастройкаВыбораЗначенийПеременных.ЗначениеДанных = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	Аук_НастройкиРасчетовИтоговНастройкаВыбораЗначенийПеременных.Ссылка = &НастройкаРасчетаИтога
	|
	|УПОРЯДОЧИТЬ ПО
	|	Аук_НастройкиРасчетовИтоговНастройкаВыбораЗначенийПеременных.НомерСтроки
	|ИТОГИ ПО
	|	Переменная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Аук_НастройкиРасчетовИтоговНастройкаСписанияПараметров.Параметр КАК Параметр,
	|	Аук_НастройкиРасчетовИтоговНастройкаСписанияПараметров.СписыватьПоПеременной КАК СписыватьПоПеременной,
	|	Аук_НастройкиРасчетовИтоговНастройкаСписанияПараметров.МожноСписыватьЧастично КАК МожноСписыватьЧастично
	|ПОМЕСТИТЬ втТемп
	|ИЗ
	|	Справочник.АукНастройкиРасчетовИтогов.НастройкаСписанияПараметров КАК Аук_НастройкиРасчетовИтоговНастройкаСписанияПараметров
	|ГДЕ
	|	Аук_НастройкиРасчетовИтоговНастройкаСписанияПараметров.Ссылка = &НастройкаРасчетаИтога
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТемп.Параметр КАК Параметр,
	|	втТемп.СписыватьПоПеременной КАК СписыватьПоПеременной,
	|	втТемп.МожноСписыватьЧастично КАК МожноСписыватьЧастично
	|ИЗ
	|	втТемп КАК втТемп";
	
	Запрос.УстановитьПараметр("НастройкаРасчетаИтога", пНастройкаРасчетаИтога);
	
	масРезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	сткРезультат = ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(масРезультатыЗапроса[0]);
	
	сткРезультат.Вставить("Переменные",			масРезультатыЗапроса[1].Выгрузить());	
	сткРезультат.Вставить("ЗначенияПеременных", ТаблицаЗначенийПеременныхВСоответствие(масРезультатыЗапроса[2], "Переменная", "ИсточникДанных,
																												| ЗначениеДанных, ТехническоеНаименование, ТипЗначения"));
	сткРезультат.Вставить("НастройкаСписания",	масРезультатыЗапроса[4].Выгрузить());
	
	Возврат сткРезультат;
КонецФункции	

Функция ПредставлениеРезультатаПоШаблонуВНастройке(пНастройкаРасчетаИтога, пСтрРезультат) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СТРЗАМЕНИТЬ(АукНастройкиРасчетовИтогов.ШаблонРезультата, &ПодстрокаПоиска, &ПодстрокаЗамены) КАК ПредставлениеРезультата
	|ИЗ
	|	Справочник.АукНастройкиРасчетовИтогов КАК АукНастройкиРасчетовИтогов
	|ГДЕ
	|	АукНастройкиРасчетовИтогов.Ссылка = &НастройкаРасчетаИтога";
	
	Запрос.УстановитьПараметр("НастройкаРасчетаИтога",	пНастройкаРасчетаИтога);
	Запрос.УстановитьПараметр("ПодстрокаПоиска",		АукОбщийКлиентСервер.ОперандПредставленияПромежуточногоИтога());
	Запрос.УстановитьПараметр("ПодстрокаЗамены",		пСтрРезультат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.ПредставлениеРезультата;
	Иначе
		Возврат пСтрРезультат;	
	КонецЕсли;	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаЗначенийПеременныхВСоответствие(пРезультатЗапроса, пКлюч, пКлючСтруктуры)
	сооРезультат = Новый Соответствие;
	
	Если пРезультатЗапроса.Пустой() Тогда
		Возврат сооРезультат;
	КонецЕсли;
	
	ВыборкаПеременные = пРезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПеременные.Следующий() Цикл
		ВыборкаДетальная = ВыборкаПеременные.Выбрать();
		
		масЗначенияПер = Новый Массив;
		Пока ВыборкаДетальная.Следующий() Цикл
			сткЗначениеПер = Новый Структура(пКлючСтруктуры);
			
			ЗаполнитьЗначенияСвойств(сткЗначениеПер, ВыборкаДетальная); 
			
			масЗначенияПер.Добавить(сткЗначениеПер);	
		КонецЦикла;
		
		сооРезультат.Вставить(ВыборкаПеременные[пКлюч], масЗначенияПер);
	КонецЦикла;
	
	Возврат сооРезультат;
КонецФункции	

#КонецОбласти
