
#Область ПрограммныйИнтерфейс

Функция ИнициироватьЛоггер(Процесс, допСтруктураЛоггера = Неопределено) Экспорт
	
	допСтруктура = Новый Структура;
	
	Для каждого элКлЗнч Из допСтруктураЛоггера Цикл
		
		XMLСтрокаКлюч 	  = XMLСтрока(элКлЗнч.Ключ);
		XMLСтрокаЗначение = XMLСтрока(элКлЗнч.Значение);
		
		допСтруктура.Вставить(XMLСтрокаКлюч, XMLСтрокаЗначение); 
		
	КонецЦикла;
	
	ОбязательнаяСтруктураЛоггера = Неопределено;
	ОбязательнаяСтруктураЛоггера = ОбязательнаяСтруктураЛога(Процесс);
	
	ФиксированнаяДопСтруктура 	 = Новый ФиксированнаяСтруктура(допСтруктура);
	
	СтруктураЛоггераПромежуточная = Новый Структура();
	СтруктураЛоггераПромежуточная.Вставить("обязательнаяСтруктура", ОбязательнаяСтруктураЛоггера);
	СтруктураЛоггераПромежуточная.Вставить("допСтруктура", ФиксированнаяДопСтруктура);
	
	сткЛоггера = Новый ФиксированнаяСтруктура(СтруктураЛоггераПромежуточная);	
	
	Возврат сткЛоггера;
	
КонецФункции

Процедура ОтправитьСообщениеЛога_Инфо(Логгер, ДопСтруктураСообщения, КороткоеСообщение) Экспорт
	
	ОтправитьСообщение(Логгер, УровеньЛогаИнфо(Неопределено), КороткоеСообщение, ДопСтруктураСообщения);
	
КонецПроцедуры

#КонецОбласти

Функция ОбязательнаяСтруктураЛога(ИмяПроцесса)
	
	Если СтрНайти(" ", ИмяПроцесса) > 0 Тогда
		ИмяПроцесса = СтрЗаменить(ИмяПроцесса, " ", "");
		Если СтрНайти(" ", ИмяПроцесса) > 0 Тогда
		
			ВызватьИсключение НСтр("ru = 'Ошибка определения ключа процесса! Ключ не должне содержать пробелов.'");	
		КонецЕсли;
	КонецЕсли;
	
	Ключи 						  = ПолучитьКлючиСтруктурыВСтроке();	
	КлючиСтруктурыВСтроке 		  = Новый Структура(Ключи);
	
	ФиксСтрук = Новый ФиксированнаяСтруктура(КлючиСтруктурыВСтроке);
	
	Возврат ФиксСтрук;
	
КонецФункции

Функция ПолучитьКлючиСтруктурыВСтроке()
	
	КлючиСтруктуры = "host, short_message, level, process, production, event_date, system, id_logger, cut_keys";
						
	Возврат КлючиСтруктуры; 
	
КонецФункции // ()

Процедура ОтправитьСообщение(Логгер, уровеньЛога, КороткоеСообщение, допСтруктура = Неопределено)
	
	Шаблон		 = СтрШаблон("%1_%2", уровеньЛога, Логгер.обязательнаяСтруктура.process);		
	СтрокаЛоггер = СокрЛП(Шаблон);
	
	//ЛоггерДоступенДляОтправки = ЛогированиеПовтИсп.ДоступностьЛоггераДляОтправки(СтрокаЛоггер);
	//
	//Если уровеньЛога = УровеньЛогаДебаг(Неопределено)И НЕ ЛоггерДоступенДляОтправки Тогда				
	//	Возврат;
	//КонецЕсли;
	
	СоставПростыхТипов 	   = Новый ОписаниеТипов("Строка, Число, Булево, Дата");
	СтрокаНужногоСтека 	   = "";
	ЛимитСимволовСообщения = 15000;
	
	//Попытка
	//	// переходим в исключение, получаем информацию об ошибке и из нее получаем стек вызовов
	//	Если уровеньЛога = УровеньЛогаДебаг(Неопределено) Тогда			
	//		ВызватьИсключение "";
	//	КонецЕсли;
	//Исключение
	//	
	//	ИнфоОбОшибке 					= ИнформацияОбОшибке();
	//	СтрокаПолноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
	//	ИсходныйСтекВызова 				= СтрРазделить(СтрокаПолноеПредставлениеОшибки, Символы.ПС);
	//	
	//	СтэкНашегоВызова  = Новый Массив;
	//	ВсегоВызовов 	  = ИсходныйСтекВызова.ВГраница();
	//	КоличествоВызовов = ВсегоВызовов - 2;
	//	
	//	Для Итератор = 0 По КоличествоВызовов Цикл	
	//		
	//		ИндексСтекаВызова = ВсегоВызовов - Итератор;
	//		СтекВызова 		  = ИсходныйСтекВызова[ИндексСтекаВызова];
	//		
	//		СтэкНашегоВызова.Добавить(СтекВызова);
	//	КонецЦикла;
	//	
	//	СтрокаНужногоСтека = СтрСоединить(СтэкНашегоВызова, Символы.ПС);
	//КонецПопытки;
		
	обязательнаяСтруктура = Новый Структура(Логгер.обязательнаяСтруктура);
	//ПроверитьЛогерНаПравильностьЗаполнения(обязательнаяСтруктура);
	
	//Получим универсальную дату отправки сообщения
	МилесекВСек 							= 1000;
	ТекущаяУниверсальнаяДатаВМиллисекундах  = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЦелоеЧисло 								= Цел(ТекущаяУниверсальнаяДатаВМиллисекундах / МилесекВСек);	
	XMLДатаВМиллисекундах 					= XMLСтрока('00010101000000' + ЦелоеЧисло);	
	ФорматированнаяДатаВМиллисекундах 		= Формат(ТекущаяУниверсальнаяДатаВМиллисекундах % МилесекВСек, "ЧЦ=3; ЧВН=");
	
	//ПроверитьУровеньЛога(уровеньЛога);
	
	обязательнаяСтруктура.event_date 	= XMLДатаВМиллисекундах + "." + ФорматированнаяДатаВМиллисекундах;	
	обязательнаяСтруктура.short_message = Строка(КороткоеСообщение);	
	//обязательнаяСтруктура.level 		= ПолучитьВсеУровкиЛогера()[уровеньЛога];
	
	//ЗапрещенныеДопПоля = ПолучитьСписокЗапрещенныхДопКлючей();
		
	Если Логгер.Свойство("допСтруктура") Тогда 
		
		ВспомогательнаяСтруктура = Новый Структура(Логгер.допСтруктура);
	ИначеЕсли Логгер.Свойство("ДополнительнаяСтруктура") Тогда 
		
		ВспомогательнаяСтруктура = Новый Структура(Логгер.ДополнительнаяСтруктура);
	Иначе
		
		ВспомогательнаяСтруктура = Новый Структура();		
	КонецЕсли;

	Если ТипЗнч(допСтруктура) = Тип("Структура") Тогда
		
		Для каждого элКлЗнч Из допСтруктура Цикл
			
			XMLСтрокаЗначения = XMLСтрока(элКлЗнч.Значение);			
			Если НЕ СоставПростыхТипов.СодержитТип(ТипЗнч(элКлЗнч.Значение)) Тогда
				
				ВызватьИсключение НСтр("ru = 'Ошибка формирования дополнительной структуры лога. 
								  		|Ожидаемые Типы данных: Строка, Число, Булево, Дата'");
				
			ИначеЕсли СтрДлина(XMLСтрокаЗначения) > ЛимитСимволовСообщения Тогда
				
				XMLСтрокаЗначения = Лев(XMLСтрокаЗначения, ЛимитСимволовСообщения);
				обязательнаяСтруктура.cut_keys = СтрШаблон("%1,%2", обязательнаяСтруктура.cut_keys, элКлЗнч.Ключ);  
			КонецЕсли;
			
			//Если ЗапрещенныеДопПоля[элКлЗнч.Ключ] = Неопределено Тогда
				ИмяКлюча = элКлЗнч.Ключ;
			//Иначе	
			//    ИмяКлюча = ЗапрещенныеДопПоля[элКлЗнч.Ключ];
			//КонецЕсли;
			
			XMLСтрокаИмяКлюча = XMLСтрока(ИмяКлюча);
			
			ВспомогательнаяСтруктура.Вставить(XMLСтрокаИмяКлюча, XMLСтрокаЗначения);
		КонецЦикла;
		
		ДлинаСтроки = СтрДлина(обязательнаяСтруктура.cut_keys) - 1;
		
		обязательнаяСтруктура.cut_keys = Прав(обязательнаяСтруктура.cut_keys, ДлинаСтроки);
	КонецЕсли;

	Для каждого элКлЗнч Из ВспомогательнаяСтруктура Цикл
		
		Если НЕ ЗначениеЗаполнено(элКлЗнч.Значение) Тогда			
			Продолжить;
		КонецЕсли;
		
		ИмяКлюча = элКлЗнч.Ключ;
		
		Если обязательнаяСтруктура.Свойство(элКлЗнч.Ключ) Тогда
			
			ИмяКлюча = элКлЗнч.Ключ + "_";
		Иначе			
			
			ИмяКлюча = элКлЗнч.Ключ;
		КонецЕсли;
		
		обязательнаяСтруктура.Вставить(ИмяКлюча, элКлЗнч.Значение);
	КонецЦикла;
	
	обязательнаяСтруктура.Вставить("callStack", СтрокаНужногоСтека);	
	
	Вектор = "";
	
	обязательнаяСтруктура.Свойство("Vector", Вектор);
	
	Если Вектор = Неопределено Тогда
		 Вектор = "vector.log1c";
	КонецЕсли;
	
	ЗаписьJSON 		 = Новый ЗаписьJSON();
	НастройкиЗаписпи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");
	
	ЗаписьJSON.УстановитьСтроку(НастройкиЗаписпи);
	ЗаписатьJSON(ЗаписьJSON, обязательнаяСтруктура);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();

	ЗаписатьЛогСобытия(СтрокаJSON, Вектор); 
	
КонецПроцедуры

Функция УровеньЛогаИнфо(пулЛогеров = Неопределено)
	
	Если НЕ пулЛогеров = Неопределено Тогда
		пуллогеров.Вставить("Инфо", "info");
	КонецЕсли;
	
	Возврат "Инфо";
	
КонецФункции // ()

Процедура ЗаписатьЛогСобытия(Строка, Вектор)
	ЗаписьТекста = Новый ЗаписьТекста("C:\GrayLog\" + ТекущаяУниверсальнаяДатаВМиллисекундах() + ".txt");
	ЗаписьТекста.ЗаписатьСтроку(Строка);
	ЗаписьТекста.Закрыть();
КонецПроцедуры
