
// Клиентская процедура [ПриОткрытии] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//
Процедура Справочник_ПриОткрытии(Форма, Отказ) Экспорт   
	
КонецПроцедуры

// Клиентская процедура [ПриОткрытии] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//
Процедура Обработка_ПриОткрытии(Форма, Отказ) Экспорт
	
КонецПроцедуры

// Клиентская процедура [ПриОткрытии] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//
Процедура РегистрСведений_ПриОткрытии(Форма, Отказ) Экспорт
	
КонецПроцедуры

// Клиентская процедура [ПриОткрытии] вызывается из обработчика формы
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//
Процедура ПланВидовХарактеристик_ПриОткрытии(Форма, Отказ) Экспорт
	
КонецПроцедуры

// Клиентская процедура вызывается в конце обработчика формы ПриОткрытии
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//
Процедура Справочник_ПослеОткрытия(Форма, Отказ) Экспорт   
	
КонецПроцедуры

// Клиентская процедура вызывается в конце обработчика формы ПриОткрытии
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//
Процедура Обработка_ПослеОткрытия(Форма, Отказ) Экспорт
	
КонецПроцедуры

// Клиентская процедура вызывается в конце обработчика формы ПриОткрытии
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//
Процедура РегистрСведений_ПослеОткрытия(Форма, Отказ) Экспорт
	
КонецПроцедуры

// Клиентская процедура вызывается в конце обработчика формы ПриОткрытии
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма из которой происходит вызов
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//
Процедура ПланВидовХарактеристик_ПослеОткрытия(Форма, Отказ) Экспорт
	
КонецПроцедуры