
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Обработка_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Обработка_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Обработка_ПриОткрытии(ЭтотОбъект, Отказ);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияФормКлиент.Обработка_ПослеОткрытия(ЭтотОбъект, Отказ);			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы 

&НаКлиенте
Процедура тзПромежуточныеИтогиРасчетПоФормулеРезультатПриИзменении(Элемент)
	
	ОтсортироватьТаблицуПоКолонкеРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура тзПромежуточныеИтогиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "тзПромежуточныеИтогиРасчетПоФормулеРезультат"
		 И Поле.Имя <> "тзПромежуточныеИтогиИтоговоеЗначение"
	Тогда	 
		 
		СтандартнаяОбработка = Ложь;
		
		ТекДанные = ЭтотОбъект.тзПромежуточныеИтоги.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		ПодтвердитьВыборЛидераИПродолжить(ТекДанные);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если ЭтотОбъект.тзПромежуточныеИтоги.Количество() = 0 Тогда
			
		Закрыть(Истина);
		
	Иначе		
		масВыделенныеСтроки = Элементы.тзПромежуточныеИтоги.ВыделенныеСтроки;
		
		Если масВыделенныеСтроки.Количество() <> 0 Тогда
			
			ПодтвердитьВыборЛидераИПродолжить(ЭтотОбъект.тзПромежуточныеИтоги.НайтиПоИдентификатору(масВыделенныеСтроки[0]));
			
		Иначе
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран участник, являющийся лидером'"));
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

&НаКлиенте
Процедура ПодтвердитьВыборЛидераИПродолжить(пТекДанные)

	Оповещение = Новый ОписаниеОповещения("ПодтвердитьВыбор_Продолжить", ЭтотОбъект, пТекДанные);	
	
	ПоказатьВопрос(Оповещение, СтрШаблон(ШаблонТекстаВопросаПодтверждение(), пТекДанные.Участник), РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Функция ШаблонТекстаВопросаПодтверждение()

	Возврат НСтр("ru = 'Подтверждая это Вы соглашаетесь с тем, что на текущем этапе лидирует участник <%1> и то, что все участники будут оповещены. Продолжить?'");
	
КонецФункции

&НаКлиенте
Процедура ПодтвердитьВыбор_Продолжить(Результат, пТекДанные) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		сткДанныеДляЗаписи = АукОбщийКлиентСервер.ДанныеПобедителяЭтапаИзТаблицыРезультатовЭтапа(ЭтотОбъект.Аукцион, ЭтотОбъект.НомерЭтапа, пТекДанные); 
		
		АукОбщийВызовСервера.СохранитьДанныеПромежуточногоЛидераЭтапа(сткДанныеДляЗаписи);
		
		Закрыть(Истина);	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтсортироватьТаблицуПоКолонкеРасчета()

	ЭтотОбъект.тзПромежуточныеИтоги.Сортировать(СтрШаблон("РезультатРасчета %1", ?(ЭтотОбъект.ВариантСортировки = 0, "ВОЗР", "УБЫВ")));
	
КонецПроцедуры	

&НаСервере
Процедура НачальнаяИнициализация()
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Аукцион,ВидАукциона,НомерЭтапа");
	
	АукОбщийСервер.ДобавитьКолонкиДанныхСтавкиПоВидуАукциона(ЭтотОбъект, Параметры.ВидАукциона, "тзПромежуточныеИтоги", Элементы.тзПромежуточныеИтогиДанныеСтавки);
	
	ЗаполнитьПромежуточныеИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПромежуточныеИтоги()
	
	ЭтотОбъект.ВариантСортировки = Справочники.АукВидыАукционов.ОписаниеРасчетаПромежуточныхИтоговПоВидуАукциона(Параметры.ВидАукциона).ПромежуточныйИтогВариантВыбора;
	
	тзПромежуточныеИтогиТемп = АукОбщийСервер.ПромежуточныеИтогиРасчетПоУмолчанию(Параметры.Аукцион, Параметры.ВидАукциона);
	
	//Если сткРез.Успех Тогда	
		тзТемп = РеквизитФормыВЗначение("тзПромежуточныеИтоги");
		
		Для Каждого СтрокаТз Из тзПромежуточныеИтогиТемп Цикл
			
			ЗаполнитьЗначенияСвойств(тзТемп.Добавить(), СтрокаТз);
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(тзТемп, "тзПромежуточныеИтоги");	
	//Иначе	
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(сткРез.Результат);	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


