
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Справочник_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Отказ Тогда
		Возврат; 
	КонецЕсли;
	
	ПодпискиНаСобытияФорм.Справочник_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Справочник_ПриОткрытии(ЭтотОбъект, Отказ);
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	ПодпискиНаСобытияФормКлиент.Справочник_ПослеОткрытия(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтруктураНастроекЭлементНастройкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	сткОтбор = Новый Структура("ЭлементНастройки", ВыбранноеЗначение); 
	
	Если Объект.СтруктураНастроек.НайтиСтроки(сткОтбор).Количество() <> 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Копирование;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	

#КонецОбласти

