
#Область ПрограммныйИнтерфейс

Функция ОбязательныеПоляКомандыВСтрокеJSON() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("command");
	масРезультат.Добавить("auction");
	
	Возврат масРезультат;
	
КонецФункции

Функция БазоваяСтруктураДанныхДляКоманды() Экспорт
		
	Возврат АукОбщийКлиентСервер.СтруктураПоМассивуИмен(ОбязательныеПоляКомандыВСтрокеJSON());
	
КонецФункции

Функция РасширеннаяСтруктураДанныхДляКоманды(пДобавитьДопДанные = Ложь) Экспорт

	сткРезультат = БазоваяСтруктураДанныхДляКоманды();
	
	сткРезультат.Вставить("required_data");
	
	Если пДобавитьДопДанные Тогда
		
		сткРезультат.Вставить("optional_data");
	
	КонецЕсли;
	
	Возврат сткРезультат;
	
КонецФункции

Функция ПроверкаОбязательныхСвойствВДанныхКоманды(пСткДанные) Экспорт
	
	масОбязательныПоля = ОбязательныеПоляКомандыВСтрокеJSON();
	
	Возврат ПроверкаДополнительныхСвойствВДанныхКомандыПоСписку(пСткДанные, масОбязательныПоля);	
		
КонецФункции

Функция ПроверкаДополнительныхСвойствВДанныхКомандыПоСписку(пДанные, пИменаПолей) Экспорт
		
	масОшибки = Новый Массив;
	
	Если ТипЗнч(пДанные) = Тип("Структура") Тогда
		
		Для Каждого ЭлМас Из пИменаПолей Цикл
			
			Если Не пДанные.Свойство(ЭлМас) Тогда
				
				масОшибки.Добавить(СтрШаблон(НСтр("ru = 'Отсутствует обязательное поле ""%1"".'"), ЭлМас));
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе	
		ВызватьИсключение "Неопр. тип";	
	КонецЕсли;
	
	Если масОшибки.Количество() <> 0 Тогда	
		Возврат ЭдоОбщий._Ошибка(СтрСоединить(масОшибки, Символы.ПС));	
	Иначе	
		Возврат ЭдоОбщий._Успех();	
	КонецЕсли;	
		
КонецФункции

Функция ПроверкаДополнительныхСвойствВДанныхКомандыПоСтроке(пСткДанные, пСтрИменаПолей) Экспорт
	
	масИменаПолей = СтрРазделить(пСтрИменаПолей, ",");
	
	Возврат ПроверкаДополнительныхСвойствВДанныхКомандыПоСписку(пСткДанные, масИменаПолей);	
		
КонецФункции

Функция ПромежутокВремениМеждуОповещениямиМинут() Экспорт // 15
	Возврат 2;	
КонецФункции

Функция КоличествоСлужебныхОповещений() Экспорт
	Возврат 2;	
КонецФункции

#КонецОбласти

#Область СтруктураОбязательныхДанныхКоманд

Функция ОтправитьСообщениеАвтору_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("channel");
	масРезультат.Добавить("channel_settings");
	
	//масРезультат.Добавить("recipients");
	масРезультат.Добавить("subject");
	масРезультат.Добавить("message");
	масРезультат.Добавить("template_parameter_values");
	
	Возврат масРезультат;
	
КонецФункции

Функция ОтправитьСообщениеУчастнику_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("channel");
	масРезультат.Добавить("channel_settings");
	масРезультат.Добавить("message");
	масРезультат.Добавить("subject");
	масРезультат.Добавить("period");
	масРезультат.Добавить("data_element");
	масРезультат.Добавить("template_parameter_values");
	масРезультат.Добавить("stage_number");
	
	Возврат масРезультат;
	
КонецФункции

Функция ПолучениеДанныхОтУчастника_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("data_type");
	масРезультат.Добавить("data"); 
	масРезультат.Добавить("confirmation_required");
	масРезультат.Добавить("message_type");
	
	Возврат масРезультат;
	
КонецФункции

Функция ПерейтиКПодведениюПромежуточныхИтогов_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("stage_number");
	
	Возврат масРезультат;
	
КонецФункции

Функция АвтоПроверкаПерейтиКПодведениюПромежуточныхИтогов_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("stage_number");
	
	Возврат масРезультат;
	
КонецФункции

Функция ПерейтиКПодведениюИтогов_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("stage_number");
	
	Возврат масРезультат;
	
КонецФункции

Функция АвтоПроверкаПерейтиКПодведениюИтогов_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("stage_number");
	
	Возврат масРезультат;
	
КонецФункции

Функция АвтоПроверкаПодвестиИтогиАукциона_ОписаниеСтруктурыОбязательныхДанных() Экспорт

	масРезультат = Новый Массив;
	
	масРезультат.Добавить("stage_number");
	
	Возврат масРезультат;
	
КонецФункции

#КонецОбласти

#Область ОбязательныеПараметрыКоманд

Процедура ЗафиксироватьДанныеСтавки_ОбщиеПараметры(пСткПараметры) Экспорт

	пСткПараметры.Вставить("ВидДанных",					ПредопределенноеЗначение("Перечисление.АукВидыДанных.Ставка"));
	пСткПараметры.Вставить("ТребуетсяПодтверждение",	Истина);
	пСткПараметры.Вставить("ВидСообщения",				ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПриемеСтавки"));
	
КонецПроцедуры	

Процедура ЗафиксироватьОтказОтУчастия_ОбщиеПараметры(пСткПараметры) Экспорт

	пСткПараметры.Вставить("ВидДанных",					ПредопределенноеЗначение("Перечисление.АукВидыДанных.Отказ"));	
	пСткПараметры.Вставить("ТребуетсяПодтверждение",	Истина);
	пСткПараметры.Вставить("ВидСообщения",				ПредопределенноеЗначение("Перечисление.АукВидыСообщений.УведомлениеОПриемеОтказа"));
	
КонецПроцедуры

Процедура ЗафиксироватьСообщениеОтУчастника_ОбщиеПараметры(пСткПараметры) Экспорт

	пСткПараметры.Вставить("ВидДанных",					ПредопределенноеЗначение("Перечисление.АукВидыДанных.Сообщение"));	
	пСткПараметры.Вставить("ТребуетсяПодтверждение",	Ложь);
	
КонецПроцедуры

#КонецОбласти
