
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "АукДанныеТаблицПодведенияИтогов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;
	КонецЕсли;	
	
КонецФункции

Функция ДобавитьЗаписи(пМасЗаписи) Экспорт	
	
	сткРез = АукОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМасЗаписи, "АукДанныеТаблицПодведенияИтогов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;
	КонецЕсли;
	
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат АукОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "АукДанныеТаблицПодведенияИтогов");
	
КонецФункции	

Функция ТекущиеДанныеТаблицПодведенияИтогов(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукДанныеТаблицПодведенияИтогов.Участник КАК Участник,
	|	АукДанныеТаблицПодведенияИтогов.СтрокаДанных КАК СтрокаДанных,
	|	АукДанныеТаблицПодведенияИтогов.РаспределяемаяСумма КАК РаспределяемаяСумма,
	|	АукДанныеТаблицПодведенияИтогов.ЭтоПобедитель КАК ЭтоПобедитель
	|ИЗ
	|	РегистрСведений.АукДанныеТаблицПодведенияИтогов КАК АукДанныеТаблицПодведенияИтогов
	|ГДЕ
	|	АукДанныеТаблицПодведенияИтогов.Аукцион = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить();
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции	

Функция ЗафиксироватьИтогиАукциона(пСткПараметры) Экспорт

	масЗаписи = Новый Массив;
	
	Для Каждого ЭлСоо Из пСткПараметры.ИтогиАукциона Цикл
		
		сткЗапись = Новый Структура;
		
		сткЗапись.Вставить("Аукцион",				пСткПараметры.Аукцион);
		сткЗапись.Вставить("Участник",				ЭлСоо["Участник"]);
		сткЗапись.Вставить("СтрокаДанных",			ЭлСоо["СтрокаДанных"]);
		сткЗапись.Вставить("РаспределяемаяСумма",	ЭлСоо["РаспределяемаяСумма"]);
		сткЗапись.Вставить("ЭтоПобедитель",			ЭлСоо["ЭтоПобедитель"]);
		сткЗапись.Вставить("Автор",					пСткПараметры.Автор);
		сткЗапись.Вставить("ДатаЗаписи",			пСткПараметры.ДатаЗаписи);
	
		масЗаписи.Добавить(сткЗапись);
		
	КонецЦикла;	
	
	Возврат ДобавитьЗаписи(масЗаписи);
	
КонецФункции	

Функция ДанныеСтавкиПобедителя(пСткОтбор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Аукцион,
	|	Аук_ВидыАукционовСтруктураСтавки.НомерСтроки КАК НомерСтроки,
	|	Аук_ВидыАукционовСтруктураСтавки.ЭлементСтавки КАК ЭлементСтавки
	|ПОМЕСТИТЬ втСтруктураСтавкиПоАукциону
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукВидыАукционов.СтруктураСтавки КАК Аук_ВидыАукционовСтруктураСтавки
	|		ПО АукАукционы.ВидАукциона = Аук_ВидыАукционовСтруктураСтавки.Ссылка
	|ГДЕ
	|	АукАукционы.Ссылка = &Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АукЭлементыДанныхАукционов.Представление КАК ЭлементДанныхПредставление,
	|	Аук_ИсторияДанныхАукционовСрезПоследних.ЗначениеЭлементаДанных КАК ЗначениеЭлементаДанных
	|ИЗ
	|	втСтруктураСтавкиПоАукциону КАК втСтруктураСтавкиПоАукциону
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияДанныхАукционов.СрезПоследних КАК Аук_ИсторияДанныхАукционовСрезПоследних
	|		ПО втСтруктураСтавкиПоАукциону.Аукцион = Аук_ИсторияДанныхАукционовСрезПоследних.Аукцион
	|			И втСтруктураСтавкиПоАукциону.ЭлементСтавки = Аук_ИсторияДанныхАукционовСрезПоследних.ЭлементДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукДанныеТаблицПодведенияИтогов КАК АукДанныеТаблицПодведенияИтогов
	|		ПО (Аук_ИсторияДанныхАукционовСрезПоследних.Аукцион = АукДанныеТаблицПодведенияИтогов.Аукцион)
	|			И (Аук_ИсторияДанныхАукционовСрезПоследних.Участник = АукДанныеТаблицПодведенияИтогов.Участник)
	|			И (Аук_ИсторияДанныхАукционовСрезПоследних.СтрокаДанных = АукДанныеТаблицПодведенияИтогов.СтрокаДанных)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО втСтруктураСтавкиПоАукциону.ЭлементСтавки = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	АукДанныеТаблицПодведенияИтогов.Участник = &Участник
	|	И АукДанныеТаблицПодведенияИтогов.ЭтоПобедитель
	|	И АукДанныеТаблицПодведенияИтогов.СтрокаДанных = &СтрокаДанных
	|
	|УПОРЯДОЧИТЬ ПО
	|	втСтруктураСтавкиПоАукциону.НомерСтроки";
		
	Запрос.УстановитьПараметр("Аукцион",		пСткОтбор.Аукцион);
	Запрос.УстановитьПараметр("Участник",		пСткОтбор.Участник);
	Запрос.УстановитьПараметр("СтрокаДанных",	пСткОтбор.СтрокаДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
КонецФункции	

Функция СведенияОПобедителяхАукциона(пАукцион) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукДанныеТаблицПодведенияИтогов.Участник КАК Участник,
	|	АукДанныеТаблицПодведенияИтогов.СтрокаДанных КАК СтрокаДанных
	|ИЗ
	|	РегистрСведений.АукДанныеТаблицПодведенияИтогов КАК АукДанныеТаблицПодведенияИтогов
	|ГДЕ
	|	АукДанныеТаблицПодведенияИтогов.Аукцион = &Аукцион";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
КонецФункции	

#КонецОбласти