
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Обработка_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Обработка_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Обработка_ПриОткрытии(ЭтотОбъект, Отказ);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияФормКлиент.Обработка_ПослеОткрытия(ЭтотОбъект, Отказ);			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УчастникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	АукОбщийКлиент.НачатьВыборУчастника(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	АукОбщийКлиент.НачатьВыборКонтактногоЛица(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникОчистка(Элемент, СтандартнаяОбработка)
	
	ЭтотОбъект.КонтактноеЛицо = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникПриИзменении(Элемент)
	
	АукОбщийКлиент.УчастникПриИзменении(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Принять(Команда)
	
	ЗафиксироватьИнформациюОтУчастников();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗафиксироватьИнформациюОтУчастников()
	
	Если ПроверитьЗаполнение() Тогда	
		
		Закрыть(ДанныеОтказаИзДанныхФормы());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеОтказаИзДанныхФормы()
	
	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Аукцион",		ЭтотОбъект.Аукцион);
	сткРезультат.Вставить("Участник",		ЭтотОбъект.Участник);
	сткРезультат.Вставить("КонтактноеЛицо",	ЭтотОбъект.КонтактноеЛицо);
	сткРезультат.Вставить("Данные",			ЭтотОбъект.ТекстПримечания);
	
	Возврат сткРезультат;
	
КонецФункции

&НаСервере
Процедура НачальнаяИнициализация()
	
	ЭтотОбъект.Аукцион	= Параметры.Аукцион;
	
	АукОбщийСервер.ЗаполнитьДанныеДляОтборовНаФорме(ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

