
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "АукИсторияСтатусовАукционов"); 
	
	Если Не сткРез.Успех Тогда	
		ВызватьИсключение сткРез.Ошибка;		
	КонецЕсли;
	
КонецПроцедуры

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат АукОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "АукИсторияСтатусовАукционов");
	
КонецФункции

Функция ТекущееСостояниеАукциона(пАукцион, пДата = Неопределено) Экспорт
	сткРезультат = Новый Структура("Статус, НомерЭтапа, Этап", ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПустаяСсылка"), 0, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Статус КАК Статус,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа КАК НомерЭтапа,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Этап КАК Этап
	|ИЗ
	|	РегистрСведений.АукИсторияСтатусовАукционов.СрезПоследних(&НаДату, Аукцион = &Аукцион) КАК Аук_ИсторияСтатусовАукционовСрезПоследних";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НаДату",		пДата);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат сткРезультат;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(сткРезультат, Выборка);
		
		Возврат сткРезультат;
	КонецЕсли;	
КонецФункции

Функция ВремяОтказаОтПродолженияАукциона(пАукцион) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукИсторияСтатусовАукционов.Период КАК Период
	|ИЗ
	|	РегистрСведений.АукИсторияСтатусовАукционов КАК АукИсторияСтатусовАукционов
	|ГДЕ
	|	АукИсторияСтатусовАукционов.Аукцион = &Аукцион
	|	И АукИсторияСтатусовАукционов.Статус = Значение(Перечисление.АукСтатусыАукционов.Отменен)";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.Период;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;	
КонецФункции	

#КонецОбласти

