
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписи(пМассивСтруктур) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМассивСтруктур, "АукРасчетИтоговРезультаты"); 
	
	Если Не сткРез.Успех Тогда	
		ВызватьИсключение сткРез.Ошибка;		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьДанныеДляЗаписи(пСткПараметры) Экспорт
	масРезультат = Новый Массив;
	
	Для Каждого сткРезультатыРасчета Из пСткПараметры.РезультатыРасчета Цикл	
		сткЗапись = Новый Структура;
		
		сткЗапись.Вставить("Аукцион",		пСткПараметры.Аукцион);
		сткЗапись.Вставить("НомерЭтапа",	пСткПараметры.НомерЭтапа);
		
		сткЗапись.Вставить("Участник",		сткРезультатыРасчета.Участник);
		сткЗапись.Вставить("СтрокаДанных",	сткРезультатыРасчета.СтрокаДанных);
		
		сткЗапись.Вставить("РезультатРасчета",	сткРезультатыРасчета.РезультатРасчета);
		сткЗапись.Вставить("УчастникВыбран",	сткРезультатыРасчета.УчастникВыбран);
		сткЗапись.Вставить("ЭтоПобедитель",		сткРезультатыРасчета.ЭтоПобедитель);
		
		сткЗапись.Вставить("Автор",			пСткПараметры.Автор);
		сткЗапись.Вставить("ДатаЗаписи",	пСткПараметры.ТекДата);
		
		масРезультат.Добавить(сткЗапись);	
	КонецЦикла;	
	
	Возврат масРезультат;
КонецФункции

Функция СохраненныеДанныеРезультатовРасчетаИтоговАукционаПоЭтапу(пАукцион, пНомерЭтапа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговРезультаты.Участник КАК Участник,
	|	АукРасчетИтоговРезультаты.СтрокаДанных КАК СтрокаДанных,
	|	АукРасчетИтоговРезультаты.РезультатРасчета КАК РезультатРасчета,
	|	АукРасчетИтоговРезультаты.УчастникВыбран КАК УчастникВыбран,
	|	АукРасчетИтоговРезультаты.ЭтоПобедитель КАК ЭтоПобедитель
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговРезультаты КАК АукРасчетИтоговРезультаты
	|ГДЕ
	|	АукРасчетИтоговРезультаты.Аукцион = &Аукцион
	|	И АукРасчетИтоговРезультаты.НомерЭтапа = &НомерЭтапа";	
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа",	пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе		
		Возврат РезультатЗапроса.Выгрузить();	
	КонецЕсли;	
КонецФункции

Функция ДанныеСтавкиПобедителя(пСткОтбор) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Аукцион,
	|	Аук_ВидыАукционовСтруктураСтавки.НомерСтроки КАК НомерСтроки,
	|	Аук_ВидыАукционовСтруктураСтавки.ЭлементСтавки КАК ЭлементСтавки
	|ПОМЕСТИТЬ втСтруктураСтавкиПоАукциону
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукВидыАукционов.СтруктураСтавки КАК Аук_ВидыАукционовСтруктураСтавки
	|		ПО АукАукционы.ВидАукциона = Аук_ВидыАукционовСтруктураСтавки.Ссылка
	|ГДЕ
	|	АукАукционы.Ссылка = &Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АукЭлементыДанныхАукционов.Представление КАК ЭлементДанныхПредставление,
	|	Аук_ИсторияДанныхАукционовСрезПоследних.ЗначениеЭлементаДанных КАК ЗначениеЭлементаДанных
	|ИЗ
	|	втСтруктураСтавкиПоАукциону КАК втСтруктураСтавкиПоАукциону
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияДанныхАукционов.СрезПоследних КАК Аук_ИсторияДанныхАукционовСрезПоследних
	|		ПО втСтруктураСтавкиПоАукциону.Аукцион = Аук_ИсторияДанныхАукционовСрезПоследних.Аукцион
	|			И втСтруктураСтавкиПоАукциону.ЭлементСтавки = Аук_ИсторияДанныхАукционовСрезПоследних.ЭлементДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукРасчетИтоговРезультаты КАК АукРасчетИтоговРезультаты
	|		ПО (Аук_ИсторияДанныхАукционовСрезПоследних.Аукцион = АукРасчетИтоговРезультаты.Аукцион)
	|			И (Аук_ИсторияДанныхАукционовСрезПоследних.Участник = АукРасчетИтоговРезультаты.Участник)
	|			И (Аук_ИсторияДанныхАукционовСрезПоследних.СтрокаДанных = АукРасчетИтоговРезультаты.СтрокаДанных)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО втСтруктураСтавкиПоАукциону.ЭлементСтавки = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	АукРасчетИтоговРезультаты.Участник = &Участник
	|	И АукРасчетИтоговРезультаты.ЭтоПобедитель
	|	И АукРасчетИтоговРезультаты.СтрокаДанных = &СтрокаДанных
	|
	|УПОРЯДОЧИТЬ ПО
	|	втСтруктураСтавкиПоАукциону.НомерСтроки";
		
	Запрос.УстановитьПараметр("Аукцион",		пСткОтбор.Аукцион);
	Запрос.УстановитьПараметр("Участник",		пСткОтбор.Участник);
	Запрос.УстановитьПараметр("СтрокаДанных",	пСткОтбор.СтрокаДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
КонецФункции

Функция ПобедителиАукционаПоРезультатамРасчета(пАукцион, пНомерЭтапа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговРезультаты.Участник КАК Участник,
	|	АукРасчетИтоговРезультаты.СтрокаДанных КАК СтрокаДанных
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговРезультаты КАК АукРасчетИтоговРезультаты
	|ГДЕ
	|	АукРасчетИтоговРезультаты.Аукцион = &Аукцион
	|	И АукРасчетИтоговРезультаты.НомерЭтапа = &НомерЭтапа
	|	И АукРасчетИтоговРезультаты.ЭтоПобедитель";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа", пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
КонецФункции

Функция РезультатПромежуточногоПобедителя(пАукцион, пНомерЭтапа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговРезультаты.РезультатРасчета КАК РезультатРасчета
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговРезультаты КАК АукРасчетИтоговРезультаты
	|ГДЕ
	|	АукРасчетИтоговРезультаты.Аукцион = &Аукцион
	|	И АукРасчетИтоговРезультаты.НомерЭтапа = &НомерЭтапа
	|	И АукРасчетИтоговРезультаты.ЭтоПобедитель";	
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа",	пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.РезультатРасчета;	
	КонецЕсли;	
КонецФункции	

#КонецОбласти