
#Область ПрограммныйИнтерфейс

Функция СписокПредставленийПоЭлементамТабличнойЧасти(пФорма, пИмяТабличнойЧасти, пИмяРеквизита, пОтборТип = Неопределено) Экспорт

	масСписокЭлементов = КолонкаТабличнойЧастиВМассив(пФорма, пИмяТабличнойЧасти, пИмяРеквизита);
	
	Возврат АукОбщийВызовСервера.СписокПредставленийПоМассивуЭлементов(масСписокЭлементов, пОтборТип);
	
КонецФункции	

Функция КолонкаТабличнойЧастиВМассив(пФорма, пИмяТаблицы, пИмяРеквизита) Экспорт

	масРезультат = Новый Массив;
	
	Для Каждого СтрокаТч Из пФорма[пИмяТаблицы] Цикл
		
		масРезультат.Добавить(СтрокаТч[пИмяРеквизита]);
		
	КонецЦикла;	
	
	Возврат масРезультат;
	
КонецФункции

Функция ПроверитьФормулуРасчета(пСткПараметры) Экспорт
	
	Если пСткПараметры.ЭтоФормулаРасчетаОкончательныхИтогов Тогда	
		масОперандыВФормуле = АукОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(пСткПараметры.ИсходнаяФормула,
																									   АукОбщийКлиентСервер.Шаблон_ОперандФормулаРасчетаИтогов());
		
		Для Каждого ЭлОперанд Из пСткПараметры.СписокВозможныхОперандов Цикл
			
			Если масОперандыВФормуле.Найти(ЭлОперанд) = Неопределено Тогда
				
				Возврат ЭдоОбщий._Ошибка(НСтр("ru = 'В формуле нет обязательных операндов.'"));
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	ГотовоеВыражение = АукОбщийВызовСервера.СтрокаЗаменитьПоРегулярномуВыражению(пСткПараметры.ИсходнаяФормула, АукОбщийКлиентСервер.Шаблон_ОперандФормулаРасчетаИтогов(), "1"); 
	
	Попытка
		
		чслРезультат = Вычислить(ГотовоеВыражение);
		
		Возврат ЭдоОбщий._Успех();
		
	Исключение
		
		Возврат ЭдоОбщий._Ошибка(СтрШаблон(НСтр("ru = 'Ошибка при вычислении выражения с тестовыми данными. Выражение: %1'"), ГотовоеВыражение));
		
	КонецПопытки;
	
КонецФункции

Функция ПараметрыПроверкиФормулы() Экспорт

	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("ИсходнаяФормула",						"");
	сткРезультат.Вставить("СписокВозможныхОперандов",				Новый Массив);
	сткРезультат.Вставить("ЭтоФормулаРасчетаОкончательныхИтогов",	Ложь);
	
	Возврат сткРезультат;
	
КонецФункции	

Функция ДанныеСтавкиВМассивСтруктур(пТаблица, пМасРеквизиты) Экспорт
	
	масРезультат = Новый Массив;
	
	Для Каждого СтрокаТз Из пТаблица Цикл
		
		сткЭлемент = Новый Структура;
		
		Для Каждого ЭлМас Из пМасРеквизиты Цикл
			
			сткЭлемент.Вставить(ЭлМас, СериализаторXDTO.XMLСтрока(СтрокаТз[ЭлМас]));
			
		КонецЦикла;	
		
		масРезультат.Добавить(сткЭлемент);
	КонецЦикла;
	
	Возврат масРезультат;
	
КонецФункции

Функция НормализоватьСтрокуФормулы(пСтрФормулаРасчета) Экспорт

	масЭлементыФормулы = АукОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(пСтрФормулаРасчета,
													АукОбщийКлиентСервер.Шаблон_ОперандыИАрифметическиеЗнакиВФормулеРасчетаИтогов());

	Возврат СтрСоединить(масЭлементыФормулы, " ");												
КонецФункции	

Процедура ЗаполнитьТаблицуДаннымиМассиваСтруктур(пТаблица, пМасДанные, пСтрПоля) Экспорт
	Для Каждого сткЭлМас Из пМасДанные Цикл
		сткОтбор = Новый Структура(пСтрПоля);
		
		ЗаполнитьЗначенияСвойств(сткОтбор, сткЭлМас); 
		
		Если пТаблица.НайтиСтроки(сткОтбор).Количество() = 0 Тогда	
			ЗаполнитьЗначенияСвойств(пТаблица.Добавить(), сткЭлМас); 	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

Функция Факториал(пЧисло) Экспорт
	
	Если пЧисло < 0 Тогда
		ВызватьИсключение НСтр("ru = 'Факториал отрицательного числа не определен'");
	КонецЕсли;
	
	Если пЧисло = 0 Или пЧисло = 1 Тогда
		Возврат 1;
	КонецЕсли;
	
	чслРезультат = 1;
	Для Сч = 2 По пЧисло Цикл
		чслРезультат = чслРезультат * Сч;
	КонецЦикла;
	
	Возврат чслРезультат;
	
КонецФункции

#КонецОбласти

#Область ИнтерактивныеКомандыПользователей

Процедура ЗафиксироватьДанныеСтавки(пСткПараметры) Экспорт
	
	пСткПараметры.Вставить("Автоматическая",			Ложь);
	
	АукУправлениеАукционамиКлиентСервер.ЗафиксироватьДанныеСтавки_ОбщиеПараметры(пСткПараметры);
	
	АукУправлениеАукционамиВызовСервера.ПолучитьДанныеОтУчастника(пСткПараметры);
	
КонецПроцедуры

Процедура ЗафиксироватьОтказОтУчастия(пСткПараметры) Экспорт
	
	пСткПараметры.Вставить("Автоматическая",			Ложь);
	
	АукУправлениеАукционамиКлиентСервер.ЗафиксироватьОтказОтУчастия_ОбщиеПараметры(пСткПараметры);
	
	АукУправлениеАукционамиВызовСервера.ПолучитьДанныеОтУчастника(пСткПараметры);
	
КонецПроцедуры

Процедура ЗафиксироватьСообщениеОтУчастника(пСткПараметры) Экспорт
	
	пСткПараметры.Вставить("Автоматическая",			Ложь);
	
	АукУправлениеАукционамиКлиентСервер.ЗафиксироватьСообщениеОтУчастника_ОбщиеПараметры(пСткПараметры);
	
	АукУправлениеАукционамиВызовСервера.ПолучитьДанныеОтУчастника(пСткПараметры);
	
КонецПроцедуры

Процедура ОтправитьСообщениеУчастникам(пСткПараметры) Экспорт

	пСткПараметры.Вставить("Автоматическая",	Ложь);
	пСткПараметры.Вставить("ВидСообщения",		ПредопределенноеЗначение("Перечисление.АукВидыСообщений.ПростоеСообщение"));
	
	АукУправлениеАукционамиВызовСервера.ОтправитьСообщениеУчастникам(пСткПараметры);
	
КонецПроцедуры

Функция АукционПереведенВРаботу(пАукцион) Экспорт
	
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",		пАукцион);	
	сткПараметры.Вставить("Автоматическая",	Ложь);
	
	Возврат АукУправлениеАукционамиВызовСервера.ПеревестиАукционВРаботу(сткПараметры);
	
КонецФункции

Функция ВыполнитьПроверкиНастроекАукциона(пСткДанныеАук, пОповещение, пОтказ = Неопределено) Экспорт	
	сткРез = АукОбщийВызовСервера.ВыполнитьКонтрольКритическиВажныхНастроек(пСткДанныеАук);
	
	Если сткРез.Успех Тогда
		сткРез = АукОбщийКлиентСервер.ВыполнитьКонтрольОбычныхНастроек(пСткДанныеАук);
		
		Если Не сткРез.Успех Тогда
			пОтказ = Истина;
			
			ПоказатьВопрос(пОповещение, СтрШаблон(НСтр("ru = '%1.%2Продолжить?'"), сткРез.Результат, Символы.ПС), РежимДиалогаВопрос.ДаНет,,, НСтр("ru = 'Предупреждение'"));
		Иначе
			ВыполнитьОбработкуОповещения(пОповещение, КодВозвратаДиалога.Да);
		КонецЕсли;	
	Иначе	
		ОбщегоНазначенияКлиент.СообщитьПользователю(сткРез.Результат,,,, пОтказ);	
	КонецЕсли;	
КонецФункции

Функция АукционПомещенВАрхив(пАукцион) Экспорт
	
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",		пАукцион);	
	сткПараметры.Вставить("Автоматическая",	Ложь);
	
	Возврат АукУправлениеАукционамиВызовСервера.ПоместитьАукционВАрхив(сткПараметры);
	
КонецФункции

Функция АукционПереведенНаПодведениеПромежуточныхИтогов(пСткПараметры) Экспорт
	
	пСткПараметры.Вставить("Автоматическая",	Ложь);
	
	Возврат АукУправлениеАукционамиВызовСервера.ПерейтиКПодведениюПромежуточныхИтогов(пСткПараметры);
	
КонецФункции

Функция АукционПереведенНаПодведениеОкончательныхИтогов(пСткПараметры) Экспорт
	
	пСткПараметры.Вставить("Автоматическая",	Ложь);
	
	Возврат АукУправлениеАукционамиВызовСервера.ПерейтиКПодведениюИтогов(пСткПараметры);
	
КонецФункции

Функция ПромежуточныйИтогЗафиксирован(пАукцион) Экспорт
	
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",		пАукцион);	
	сткПараметры.Вставить("Автоматическая",	Ложь);
	
	Возврат АукУправлениеАукционамиВызовСервера.ЗафиксироватьПромежуточныеИтогиАукциона(сткПараметры);
	
КонецФункции

Функция ОкончательныеИтогиЗафиксированы(пАукцион) Экспорт
	
	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",		пАукцион);	
	сткПараметры.Вставить("Автоматическая",	Ложь);
	
	Возврат АукУправлениеАукционамиВызовСервера.ЗафиксироватьОкончательныеИтогиАукциона(сткПараметры);
	
КонецФункции

Функция АукционОтменен(пАукцион) Экспорт

	сткПараметры = Новый Структура;
	
	сткПараметры.Вставить("Аукцион",		пАукцион);	
	сткПараметры.Вставить("Автоматическая",	Ложь);
	
	Возврат АукУправлениеАукционамиВызовСервера.ОтменитьАукцион(сткПараметры);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиФормы

Процедура НачатьВыборУчастника(пФорма, пСтандартнаяОбработка) Экспорт
	
	пСтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", пФорма.СписокУчастников));
	
	Оповещение = Новый ОписаниеОповещения("ВыборУчастника_Продолжить", АукОбщийКлиент, пФорма);
	
	ОткрытьФорму("Справочник.АукУчастникиАукционов.ФормаВыбора", ПараметрыФормы, пФорма,,,, Оповещение);
	
КонецПроцедуры

Процедура ВыборУчастника_Продолжить(Результат, пФорма) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		пФорма.Участник = Результат;
		
		ЗаполнитьСписокВыбораКонтактныхЛиц(пФорма);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура УчастникПриИзменении(пФорма) Экспорт

	ЗаполнитьСписокВыбораКонтактныхЛиц(пФорма);
	
КонецПроцедуры	

Процедура НачатьВыборКонтактногоЛица(пФорма, пСтандартнаяОбработка) Экспорт
	
	пСтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка, Владелец", пФорма.СписокКонтактныхЛиц, пФорма.Участник));
	
	Оповещение = Новый ОписаниеОповещения("ВыборКонтактногоЛица_Продолжить", АукОбщийКлиент, пФорма);
	
	ОткрытьФорму("Справочник.АукКонтактныеЛицаУчастниковАукционов.ФормаВыбора", ПараметрыФормы, пФорма,,,, Оповещение);
	
КонецПроцедуры

Процедура ВыборКонтактногоЛица_Продолжить(Результат, пФорма) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		пФорма.КонтактноеЛицо = Результат;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормами

Процедура УставновитьРежимТолькоПросмотрУВсехЭлементов(пФорма, пБулТолькоПросмотр = Истина, пСтрИсключение = "") Экспорт
	масИсключения = СтрРазделить(пСтрИсключение, ",");
	
	УставновитьРежимТолькоПросмотрУВсехЭлементовРекурсивно(пФорма, пБулТолькоПросмотр, масИсключения);	
КонецПроцедуры

// Будет работать если имя команды совпадает с именем элемента
//
Процедура УстановитьВидимостьКоманд(пФорма, пБулВидимость = Ложь, пСтрИсключение = "") Экспорт
	масИсключения = СтрРазделить(пСтрИсключение, ",");
	
	Для Каждого Команда_ Из пФорма.Команды Цикл
		Если масИсключения.Найти(Команда_.Имя) <> Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		
		пФорма.Элементы[Команда_.Имя].Видимость = пБулВидимость;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПодсказкуДляПоляТехническогоНаименования(пФорма) Экспорт

	пФорма.Элементы["ТехническоеНаименование"].РасширеннаяПодсказка.Заголовок = ПодсказкаДляПоляВвода_ТехническоеНаименование();	
	
КонецПроцедуры

Процедура ЗаполнитьПодсказкуДляПоляНаименования(пФорма) Экспорт

	пФорма.Элементы["Наименование"].РасширеннаяПодсказка.Заголовок = ПодсказкаДляПоляВвода_Наименование();	
	
КонецПроцедуры

Процедура ЗапускМастераПоРаспределениюУчастниковПоВидам(пФорма) Экспорт
	Оповещение = Новый ОписаниеОповещения("НовыйВидАукциона_Продолжить", АукОбщийКлиент, пФорма);
	
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Вы создали новый вид аукциона. Вы желаете привязать его к участникам и контактным лицам?'"), РежимДиалогаВопрос.ДаНет);
КонецПроцедуры	

Процедура НовыйВидАукциона_Продолжить(Результат, пФорма) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидАукциона", пФорма.Объект.Ссылка);
		
		Оповещение = Новый ОписаниеОповещения("МастерРаспределенияПоУчастникам_Продолжить", АукОбщийКлиент, пФорма);
		
		ОткрытьФорму("Справочник.АукВидыАукционов.Форма.МастерРаспределенияПоУчастникам", ПараметрыФормы,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		пФорма.ЭтоНовыйВидАукциона = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура МастерРаспределенияПоУчастникам_Продолжить(Результат, пФорма) Экспорт
	
	пФорма.ЭтоНовыйВидАукциона = Ложь;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПеременнымиПоФормуле(пФормула, пТчПеременные, пТчНастройкаВыбораЗначений, пТчНастройкаСписанияПараметров) Экспорт 
	масРез = АукОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(пФормула,  АукОбщийКлиентСервер.Шаблон_ОперандФормулыРасчетаИтоговБезСкобок(),,, Истина);
	
	// 1. Добавляем отсутсвующие (добавляем циклом, чтобы не сбрасыват установленные флаги)
	Для Сч = 0 По масРез.ВГраница() Цикл			
		Если пТчПеременные.НайтиСтроки(Новый Структура("Переменная", масРез[Сч])).Количество() = 0 Тогда
			НовСтрока = пТчПеременные.Добавить();
			НовСтрока.Переменная = масРез[Сч];	
		КонецЕсли;	
	КонецЦикла;
	
	// 2. Удаляем лишние (чего нет в формуле)
	масСтрокиНаУдаление = Новый Массив;
	Для Каждого СтрокаТз Из пТчПеременные Цикл
		Если масРез.Найти(СтрокаТз.Переменная) = Неопределено Тогда
			масСтрокиНаУдаление.Добавить(СтрокаТз);
			
			АукОбщийКлиентСервер.УдалитьСтрокиТабличнойЧастиПоОтбору(пТчНастройкаВыбораЗначений, Новый Структура("Переменная", СтрокаТз.Переменная));
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого СтрокаНаУдаление Из масСтрокиНаУдаление Цикл
		АукОбщийКлиентСервер.УдалитьСтрокиТабличнойЧастиПоОтбору(пТчНастройкаСписанияПараметров, Новый Структура("СписыватьПоПеременной", СтрокаНаУдаление.Переменная));
		
		пТчПеременные.Удалить(СтрокаНаУдаление);	
	КонецЦикла;	
КонецПроцедуры

Функция ПреобразоватьСтрокуИмениПеременнойПоФормату(пИсходнаяСтрока) Экспорт
	Возврат "[" + СтрЗаменить(пИсходнаяСтрока, " ", "_") + "]";	
КонецФункции

Функция ОтформатироватьФормулуРасчета(Знач пФормула) Экспорт
	масФормулаТемп = АукОбщийВызовСервера.СтрокаНайтиВсеПоРегулярномуВыражениюТолькоЗначения(пФормула, АукОбщийКлиентСервер.Шаблон_ОперандыИАрифметическиеЗнакиВФормулеРасчетаИтогов());
	
	Для Сч = 0 По масФормулаТемп.ВГраница() Цикл
		масФормулаТемп[Сч] = СтрЗаменить(масФормулаТемп[Сч], " ", "_");	
	КонецЦикла;
	
	Возврат СтрСоединить(масФормулаТемп, " ");
КонецФункции	

Процедура УстановитьПараметрыОтбораДляЭлементаФормы(пИмя, пЗначение, пЭлементФормы) Экспорт
	НовыйПараметр = Новый ПараметрВыбора(пИмя, пЗначение);
	
	НовыеПараметры = Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовыйПараметр));
	
	пЭлементФормы.ПараметрыВыбора = НовыеПараметры;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

Процедура УставновитьРежимТолькоПросмотрУВсехЭлементовРекурсивно(пФорма, пБулТолькоПросмотр, пМасИсключения) Экспорт
	Для Каждого ПодчиненныйЭлемент Из пФорма.ПодчиненныеЭлементы Цикл
		Если пМасИсключения.Найти(ПодчиненныйЭлемент.Имя) <> Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПолеФормы") Тогда
			ПодчиненныйЭлемент.ТолькоПросмотр = пБулТолькоПросмотр;	
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("КнопкаФормы") Тогда	
			ПодчиненныйЭлемент.Доступность = Не пБулТолькоПросмотр;	
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("ТаблицаФормы") Тогда
			ПодчиненныйЭлемент.ТолькоПросмотр = пБулТолькоПросмотр;
			
			УставновитьРежимТолькоПросмотрУВсехЭлементовРекурсивно(ПодчиненныйЭлемент.КоманднаяПанель, пБулТолькоПросмотр, пМасИсключения);
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда	
			УставновитьРежимТолькоПросмотрУВсехЭлементовРекурсивно(ПодчиненныйЭлемент, пБулТолькоПросмотр, пМасИсключения);
		КонецЕсли;			
	КонецЦикла;	
КонецПроцедуры

Функция ПодсказкаДляПоляВвода_Наименование()

	ЧастиСтроки = Новый Массив;
	
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = 'Требования к наименованию:%1'"), Символы.ПС)); 
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = '1. Латинские буквы и кириллические в верхнем либо нижнем регистре, а также цифры%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = '2. Из спецсимволов допускается только: ""_"", ""."", ""("", "")"", пробелы%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = '3. В базе не должно существовать элементов с таким же наименованием%1%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = 'Пример:%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = 'Неправильно%1'"), Символы.ПС), Новый Шрифт(,,Истина), WebЦвета.Красный));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' [Сумма ставки]%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' Процент/ставки%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = 'Правильно%1'"), Символы.ПС), Новый Шрифт(,,Истина), WebЦвета.Зеленый));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' Процент_ставки_5%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' Сумма.Кредит%1'"), Символы.ПС));
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецФункции

Функция ПодсказкаДляПоляВвода_ТехническоеНаименование()

	ЧастиСтроки = Новый Массив;
	
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = 'Требования к техническому наименованию:%1'"), Символы.ПС)); 
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = '1. Отсутствие пробелов%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = '2. Только латинские буквы и цифры%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = '3. Начинается только с буквы%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = '4. В базе не должно существовать элементов с таким же наименованием%1%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = 'Пример:%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = 'Неправильно%1'"), Символы.ПС), Новый Шрифт(,,Истина), WebЦвета.Красный));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' Сумма ставки%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' Процент%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' 5Percent%1'"), Символы.ПС)); 
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' Count of days%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = 'Правильно%1'"), Символы.ПС), Новый Шрифт(,,Истина), WebЦвета.Зеленый));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' CountOfDays%1'"), Символы.ПС));
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = ' For3Days%1'"), Символы.ПС));
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецФункции	

Процедура ЗаполнитьСписокВыбораКонтактныхЛиц(пФорма)

	СписокКонтактныхЛиц = АукОбщийВызовСервера.КонтактныеЛицаУчастникаАукциона(пФорма.Аукцион, пФорма.Участник);
	
	СписокВыбора = пФорма.Элементы.КонтактноеЛицо.СписокВыбора;
	
	СписокВыбора.Очистить();
	
	Для Каждого ЭлКонтЛицо Из СписокКонтактныхЛиц Цикл
		СписокВыбора.Добавить(ЭлКонтЛицо);	
	КонецЦикла;	
	
	// Сразу выберем контактное лицо, если  в списке оно только одно
	Если СписокКонтактныхЛиц.Количество() = 1 Тогда
		пФорма.КонтактноеЛицо = СписокКонтактныхЛиц[0];
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти
