
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаписи(пМассивСтруктур) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМассивСтруктур, "АукРасчетИтоговПараметры"); 
	
	Если Не сткРез.Успех Тогда	
		ВызватьИсключение сткРез.Ошибка;		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьДанныеДляЗаписи(пСткПараметры) Экспорт
	масРезультат = Новый Массив;
	
	Для Каждого сткПараметрыАукциона Из пСткПараметры.ПараметрыАукциона Цикл
		сткЗапись = Новый Структура;
		
		сткЗапись.Вставить("Аукцион",		пСткПараметры.Аукцион);
		сткЗапись.Вставить("НомерЭтапа",	пСткПараметры.НомерЭтапа);
		сткЗапись.Вставить("Параметр",		сткПараметрыАукциона.Параметр);
		сткЗапись.Вставить("Значение",		сткПараметрыАукциона.Значение);
		сткЗапись.Вставить("Автор",			пСткПараметры.Автор);
		сткЗапись.Вставить("ДатаЗаписи",	пСткПараметры.ТекДата);
		
		масРезультат.Добавить(сткЗапись);
	КонецЦикла;	
	
	Возврат масРезультат;
КонецФункции

Функция СохраненныеЗначенияПараметровИтоговАукционаПоЭтапу(пАукцион, пНомерЭтапа) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукРасчетИтоговПараметры.Параметр КАК Параметр,
	|	АукРасчетИтоговПараметры.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.АукРасчетИтоговПараметры КАК АукРасчетИтоговПараметры
	|ГДЕ
	|	АукРасчетИтоговПараметры.Аукцион = &Аукцион
	|	И АукРасчетИтоговПараметры.НомерЭтапа = &НомерЭтапа";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НомерЭтапа",	пНомерЭтапа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат Неопределено;	
	//Иначе
		Возврат ЭдоОбщийСервер.РезультатЗапросаВСоответствие(РезультатЗапроса, "Параметр", "Значение");
	//КонецЕсли;	
КонецФункции	

#КонецОбласти

