
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.ПланВидовХарактеристик_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияФорм.ПланВидовХарактеристик_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.ПланВидовХарактеристик_ПриОткрытии(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	АукОбщийКлиент.ЗаполнитьПодсказкуДляПоляТехническогоНаименования(ЭтотОбъект); 
	
	АукОбщийКлиент.ЗаполнитьПодсказкуДляПоляНаименования(ЭтотОбъект);
	
	ПодпискиНаСобытияФормКлиент.ПланВидовХарактеристик_ПослеОткрытия(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ТехническоеНаименование	= СокрЛП(Объект.ТехническоеНаименование); 
	Объект.Наименование				= СокрЛП(Объект.Наименование);
	
	ПараметрыЗаписи.Вставить("ТехническоеНаименованиеБылоИзменено",	ЭтотОбъект.ТехническоеНаименованиеБылоИзменено);
	ПараметрыЗаписи.Вставить("НаименованиеБылоИзменено",			ЭтотОбъект.НаименованиеБылоИзменено);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	АукОбщийСервер.ОбработкаПередЗаписьюФормЭлементовПВХ(ТекущийОбъект, ПараметрыЗаписи, Отказ);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТехническоеНаименованиеПриИзменении(Элемент)
	
	ЭтотОбъект.ТехническоеНаименованиеБылоИзменено = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЭтотОбъект.НаименованиеБылоИзменено = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	

#КонецОбласти





