
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.РегистрСведений_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.РегистрСведений_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ПодпискиНаСобытияФормКлиент.РегистрСведений_ПриОткрытии(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияФормКлиент.РегистрСведений_ПослеОткрытия(ЭтотОбъект, Отказ);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПараметровПриАктивизацииСтроки(Элемент)
	
	стрШаблон =
	"	<!DOCTYPE html>
	|<html lang=""ru"">
	|<head>
	|    <meta charset=""UTF-8"">
	|</head>
	|<body>

	|<div>
	|   %1	
	|</div>
	
	|</body>
	|</html>";
	
	ЭтотОбъект.ОписаниеПараметра = СтрШаблон(стрШаблон, ЭтотОбъект.ПараметрыШаблонов.Получить(Элемент.ТекущиеДанные.ИмяПараметра));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачальнаяИнициализация()
	ЭтотОбъект.ПараметрыШаблонов = Новый ФиксированноеСоответствие(РегистрыСведений.АукШаблоныСообщений.ОписаниеПараметровШаблонов());
	
	Для Каждого ЭлСоо Из ЭтотОбъект.ПараметрыШаблонов Цикл
		НовСтрока = ЭтотОбъект.СписокПараметров.Добавить();
		
		НовСтрока.ИмяПараметра = ЭлСоо.Ключ;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти
