
Функция ЗначенияЭлементовДанныхПоКоличеству(пЭлементДанных, пКоличествоЗначений = 5, пБулОбрамитьВКавычки = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	АукДопЭлементыДанныхАукционов.Представление КАК ЗначениеЭлемента
	|ИЗ
	|	Справочник.АукДопЭлементыДанныхАукционов КАК АукДопЭлементыДанныхАукционов
	|ГДЕ
	|	АукДопЭлементыДанныхАукционов.Владелец = &ЭлементДанных";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 0", СтрШаблон("ПЕРВЫЕ %1", пКоличествоЗначений)); 
	
	Запрос.УстановитьПараметр("ЭлементДанных", пЭлементДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	масРезультат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если пБулОбрамитьВКавычки Тогда 
			масРезультат.Добавить(СтрШаблон("""%1""", Выборка.ЗначениеЭлемента));
		Иначе
			масРезультат.Добавить(Выборка.ЗначениеЭлемента);	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат масРезультат;
КонецФункции	