
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Справочник_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Отказ Тогда
		Возврат; 
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Справочник_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Справочник_ПриОткрытии(ЭтотОбъект, Отказ);
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	ПодпискиНаСобытияФормКлиент.Справочник_ПослеОткрытия(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

Процедура НачальнаяИнициализация()

	Если Параметры.Свойство("МожноСоздаватьЭлементы") Тогда
		
		Элементы.Список.ИзменятьСоставСтрок = Параметры.МожноСоздаватьЭлементы;
		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти 


