
#Область ПрограммныйИнтерфейс

Функция ТекущиеКонтактныеДанныеКонтактныхЛиц(пМасКонтактныеЛица) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукКонтактныеЛицаУчастниковАукционов.Ссылка КАК КонтактноеЛицо,
	|	АукКонтактныеЛицаУчастниковАукционов.Владелец КАК Участник,
	|	КонтактныеЛицаУчастниковКаналыВзаимодействия.КаналВзаимодействия КАК КаналВзаимодействия,
	|	КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.НПП КАК НПП,
	|	КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.ЭлементНастройки КАК ЭлементНастройки,
	|	КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.ЗначениеНастройки КАК ЗначениеНастройки,
	|	АукЭлементыНастроекКаналовВзаимодействия.ТехническоеНаименование КАК ТехническоеНаименование
	|ИЗ
	|	Справочник.АукКонтактныеЛицаУчастниковАукционов КАК АукКонтактныеЛицаУчастниковАукционов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукКонтактныеЛицаУчастниковАукционов.КаналыВзаимодействия КАК КонтактныеЛицаУчастниковКаналыВзаимодействия
	|		ПО АукКонтактныеЛицаУчастниковАукционов.Ссылка = КонтактныеЛицаУчастниковКаналыВзаимодействия.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукКонтактныеЛицаУчастниковАукционов.НастройкиКаналовВзаимодействия КАК КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыНастроекКаналовВзаимодействия КАК АукЭлементыНастроекКаналовВзаимодействия
	|			ПО КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.ЭлементНастройки = АукЭлементыНастроекКаналовВзаимодействия.Ссылка
	|		ПО (КонтактныеЛицаУчастниковКаналыВзаимодействия.КаналВзаимодействия = КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.КаналВзаимодействия)
	|			И (КонтактныеЛицаУчастниковКаналыВзаимодействия.Ссылка = КонтактныеЛицаУчастниковНастройкиКаналовВзаимодействия.Ссылка)
	|ГДЕ
	|	АукКонтактныеЛицаУчастниковАукционов.Ссылка В(&КонтактныеЛица)
	|	И КонтактныеЛицаУчастниковКаналыВзаимодействия.Текущий
	|ИТОГИ ПО
	|	КонтактноеЛицо,
	|	КаналВзаимодействия,
	|	НПП";
	
	Запрос.УстановитьПараметр("КонтактныеЛица", пМасКонтактныеЛица);
	
	Возврат СформироватьКоллекциюНстроекКаналовСвязиВРазрезеУчастникаИЕгоКонтактногоЛица(Запрос); 
	
КонецФункции

Функция ДанныеКонтактногоЛица(пКонтактноеЛицо) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукКонтактныеЛицаУчастниковАукционов.Фамилия КАК Фамилия,
	|	АукКонтактныеЛицаУчастниковАукционов.Имя КАК Имя,
	|	АукКонтактныеЛицаУчастниковАукционов.Отчество КАК Отчество,
	|	АукКонтактныеЛицаУчастниковАукционов.Должность КАК Должность
	|ИЗ
	|	Справочник.АукКонтактныеЛицаУчастниковАукционов КАК АукКонтактныеЛицаУчастниковАукционов
	|ГДЕ
	|	АукКонтактныеЛицаУчастниковАукционов.Ссылка = &КонтактноеЛицо";
	
	Запрос.УстановитьПараметр("КонтактноеЛицо", пКонтактноеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
КонецФункции

Функция ФамилияИмяОтчествоКонтактногоЛица(пКонтактноеЛицо) Экспорт
	сткДанныеКонтЛица = ДанныеКонтактногоЛица(пКонтактноеЛицо);
	
	масСтрока = Новый Массив;
	
	масСтрока.Добавить(сткДанныеКонтЛица.Фамилия);
	масСтрока.Добавить(сткДанныеКонтЛица.Имя);
	
	Если ЗначениеЗаполнено(сткДанныеКонтЛица.Отчество) Тогда
		масСтрока.Добавить(сткДанныеКонтЛица.Отчество);
	КонецЕсли;
	
	Возврат СтрСоединить(масСтрока, " "); 
КонецФункции

Функция ФамилияИИнициалыКонтактногоЛица(пКонтактноеЛицо) Экспорт
	сткДанныеКонтЛица = ДанныеКонтактногоЛица(пКонтактноеЛицо);
	
	стрРезультат = сткДанныеКонтЛица.Фамилия;
	
	стрРезультат = стрРезультат + " " + СтрШаблон("%1.", Лев(сткДанныеКонтЛица.Имя, 1));
	
	Если ЗначениеЗаполнено(сткДанныеКонтЛица.Отчество) Тогда
		стрРезультат = стрРезультат + " " + СтрШаблон("%1.", Лев(сткДанныеКонтЛица.Отчество, 1));
	КонецЕсли;
	
	Возврат стрРезультат; 
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьКоллекциюНстроекКаналовСвязиВРазрезеУчастникаИЕгоКонтактногоЛица(пЗапрос) 
	
	сооРезультат = Новый Соответствие;
	
	ВыборкаКонтактныеЛица = пЗапрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтактныеЛица.Следующий() Цикл
		
		сткРезультат = Новый Структура("КонтактноеЛицо, Участник, КаналВзаимодействия, НастройкиКаналаВзаимодействия",,,, Новый Массив);
		
		ЗаполнитьЗначенияСвойств(сткРезультат, ВыборкаКонтактныеЛица);
		
		ВыборкаКаналВзаимодействия = ВыборкаКонтактныеЛица.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
		Пока ВыборкаКаналВзаимодействия.Следующий() Цикл
			
			сткРезультат.КаналВзаимодействия = ВыборкаКаналВзаимодействия.КаналВзаимодействия;
			
			ВыборкаНПП = ВыборкаКаналВзаимодействия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаНПП.Следующий() Цикл
				
				ВыборкаДетальная = ВыборкаНПП.Выбрать();
				
				сткНастройки = Новый Структура;
				
				Пока ВыборкаДетальная.Следующий() Цикл
					
					сткНастройки.Вставить(ВыборкаДетальная.ТехническоеНаименование, ВыборкаДетальная.ЗначениеНастройки);	
					
				КонецЦикла;
				
				сткРезультат.НастройкиКаналаВзаимодействия.Добавить(сткНастройки);
					
			КонецЦикла;
			
		КонецЦикла; 
		
		сооРезультат.Вставить(ВыборкаКонтактныеЛица.КонтактноеЛицо, сткРезультат);
		
	КонецЦикла;	
	
	Возврат сооРезультат;
	
КонецФункции	

#КонецОбласти