
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	ПодпискиНаСобытияОбъектов.ПередЗаписью_Справочник(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияОбъектов.ПередЗаписьюПосле_Справочник(ЭтотОбъект, Отказ);	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	ПодпискиНаСобытияОбъектов.ПриЗаписи_Справочник(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПодпискиНаСобытияОбъектов.ПриЗаписиПосле_Справочник(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

